{
  "date": "2025-07-10",
  "jobs": [
      {
          "id": "4256751757",
          "title": "Staff Site Reliability Engineer",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4256751757/",
          "postedDate": "2025-07-09T21:14:02.000Z",
          "expireAt": "2025-08-26T12:00:40.000Z",
          "descriptionText": "The Wikimedia Foundation is looking for a Staff Site Reliability Engineer (SRE) focused on Machine Learning Infrastructure. You will join a distributed team working across UTC -5 to UTC +3 (Eastern Americas, Europe, and Africa) and report directly to the Director of Machine Learning, Chris Albon.\n\nAs a Staff SRE specializing in ML infrastructure, your primary responsibility is designing, developing, maintaining, and scaling the foundational infrastructure that enables Wikimedia's Machine Learning Engineers and Researchers to efficiently train, deploy, and monitor machine learning models in production.\n\nYou Will Be Responsible For\n\nDesigning and implementing robust ML infrastructure used for training, deployment, monitoring, and scaling of machine learning models.Improving reliability, availability, and scalability of ML infrastructure, ensuring smooth and efficient workflows for internal ML engineers and researchers.Collaborating closely with ML engineers, product teams, researchers, SREs, and the Wikimedia volunteer community to identify infrastructure requirements, resolve operational issues, and streamline the ML lifecycle.Proactively monitoring and optimizing system performance, capacity, and security to maintain high service quality.Providing expert guidance and documentation to teams across Wikimedia to effectively utilize the ML infrastructure and best practices.Mentoring team members and sharing knowledge on infrastructure management, operational excellence, and reliability engineering.\n\nSkills And Experience\n\n7+ years of experience in Site Reliability Engineering (SRE), DevOps, or infrastructure engineering roles, with substantial exposure to production-grade machine learning systems.Proven expertise with on-premises infrastructure for machine learning workloads (e.g., Kubernetes, Docker, GPU acceleration, distributed training systems).Strong proficiency with infrastructure automation and configuration management tools (e.g., Terraform, Ansible, Helm, Argo CD).Experience implementing observability, monitoring, and logging for ML systems (e.g., Prometheus, Grafana, ELK stack).Familiarity with popular Python-based ML frameworks (e.g., PyTorch, TensorFlow, scikit-learn).Strong English communication skills and comfort working asynchronously across global teams.\n\nQualities That Are Important To Us\n\nCollaborative, proactive, and independently motivated.Experienced working with diverse, remote teams.Committed to open-source software and volunteer communities.Systematic thinker focused on operational excellence and reliability.\n\nAdditionally, ideal candidates will excel in at least one of these areas:\n\nScalable ML Infrastructure: Deep understanding of scalable infrastructure design for high-performance machine learning training and inference workloads.Reliability and Operations: Proven track record ensuring high reliability and robust operations of complex, distributed ML systems at scale.Tooling and Automation: Demonstrated expertise creating robust tooling and automation solutions that simplify the deployment, management, and monitoring of ML infrastructure.\n\nAbout The Wikimedia Foundation\n\nThe Wikimedia Foundation is the nonprofit organization that operates Wikipedia and the other Wikimedia free knowledge projects. Our vision is a world in which every single human can freely share in the sum of all knowledge. We believe that everyone has the potential to contribute something to our shared knowledge, and that everyone should be able to access that knowledge freely. We host Wikipedia and the Wikimedia projects, build software experiences for reading, contributing, and sharing Wikimedia content, support the volunteer communities and partners who make Wikimedia possible, and advocate for policies that enable Wikimedia and free knowledge to thrive.\n\nThe Wikimedia Foundation is a charitable, not-for-profit organization that relies on donations. We receive donations from millions of individuals around the world, with an average donation of about $15. We also receive donations through institutional grants and gifts. The Wikimedia Foundation is a United States 501(c)(3) tax-exempt organization with offices in San Francisco, California, USA.\n\nAs an equal opportunity employer, the Wikimedia Foundation values having a diverse workforce and continuously strives to maintain an inclusive and equitable workplace. We encourage people with a diverse range of backgrounds to apply. We do not discriminate against any person based upon their race, traits historically associated with race, religion, color, national origin, sex, pregnancy or related medical conditions, parental status, sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, or any other legally protected characteristics.\n\nThe Wikimedia Foundation is a remote-first organization with staff members including contractors based 40+ countries*. Salaries at the Wikimedia Foundation are set in a way that is competitive, equitable, and consistent with our values and culture. The anticipated annual pay range of this position for applicants based within the United States is US$129,347 to US$200,824 with multiple individualized factors, including cost of living in the location, being the determinants of the offered pay. For applicants located outside of the US, the pay range will be adjusted to the country of hire. We neither ask for nor take into consideration the salary history of applicants. The compensation for a successful applicant will be based on their skills, experience and location.\n\nPlease note that we are currently able to hire in the following countries: Australia, Austria, Bangladesh, Belgium, Brazil, Canada, Colombia, Costa Rica, Croatia, Czech Republic, Denmark, Egypt, Estonia, Finland, France, Germany, Ghana, Greece, India, Indonesia, Ireland, Israel, Italy, Kenya, Mexico, Netherlands, Nigeria, Peru, Poland, Singapore, South Africa, Spain, Sweden, Switzerland, Uganda, United Kingdom, United States of America and Uruguay. Our non-US employees are hired through a local third party Employer of Record (EOR).\n\nWe periodically review this list to streamline to ensure alignment with our hiring requirements.\n\nAll applicants can reach out to their recruiter to understand more about the specific pay range for their location during the interview process.\n\nIf you are a qualified applicant requiring assistance or an accommodation to complete any step of the application process due to a disability, you may contact us at recruiting@wikimedia.org or +1 (415) 839-6885.\n\nU.S. Benefits & Perks\n\nApplicant Privacy Policy\n\nWikimedia Foundation\n\nWhat does the Wikimedia Foundation do?\n\nWhat makes Wikipedia different from social media platforms?\n\nOur Projects\n\nOur Tech Stack\n\nNews from across the Wikimedia movement\n\nWikimedia Blog\n\nWikimedia 2030",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": null,
          "applicants": 68,
          "views": 466,
          "jobApplicationLimitReached": false,
          "applyMethod": "https://job-boards.greenhouse.io/wikimedia/jobs/6721797?gh_src=94cfded01us",
          "salary": null,
          "company": {
              "specialities": [
                  "Non-Profit",
                  "Free knowledge",
                  "Open Source Culture",
                  "Internet",
                  "Technology",
                  "Mobile",
                  "Open Source",
                  "Education",
                  "Free Knowledge ",
                  "Wikipedia"
              ],
              "industries": [
                  "Software Development"
              ],
              "locations": [
                  {
                      "city": "San Francisco",
                      "state": "California",
                      "country": "United States"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/wikimedia-foundation",
              "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQHLq52VMetF7A/company-logo_400_400/company-logo_400_400/0/1696256412979/wikimedia_foundation_logo?e=1757548800&v=beta&t=T65H1hfvHBv8xvq2k2r-96lxHpKxn6Np26ucafX_REc",
              "website": null,
              "name": "Wikimedia Foundation",
              "employeeCount": 1064,
              "followerCount": 93002,
              "description": "About the Wikimedia Foundation\n\nThe Wikimedia Foundation is the nonprofit organization that operates Wikipedia and the other Wikimedia free knowledge projects. Our vision is a world in which every single human can freely share in the sum of all knowledge. We believe that everyone has the potential to contribute something to our shared knowledge, and that everyone should be able to access that knowledge freely. We host Wikipedia and the Wikimedia projects, build software experiences for reading, contributing, and sharing Wikimedia content, support the volunteer communities and partners who make Wikimedia possible, and advocate for policies that enable Wikimedia and free knowledge to thrive. \n\nThe Wikimedia Foundation is a charitable, not-for-profit organization that relies on donations. We receive donations from millions of individuals around the world, with an average donation of about $15. We also receive donations through institutional grants and gifts. The Wikimedia Foundation is a United States 501(c)(3) tax-exempt organization with offices in San Francisco, California, USA."
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 0.2,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0,
          "kpi_salary": 0.5,
          "kpi_company_size": 0.8,
          "kpi_company_popularity": 0.75,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 0.4,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0.33,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 1,
          "final_score": 0.63,
          "tier": "Yellow"
      },
      {
          "id": "4256751756",
          "title": "Senior Site Reliability Engineer",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4256751756/",
          "postedDate": "2025-07-09T21:19:29.000Z",
          "expireAt": "2025-08-26T12:00:40.000Z",
          "descriptionText": "Summary\n\nWikimedia Foundation is hiring a Senior Site Reliability Engineer (SRE) to join our Service Operations SRE team, where we take care of the infrastructure that runs wikipedia.org and other Wikimedia Foundation projects.\n\nThe SRE team at Wikimedia is a distributed and diverse team of engineers with a drive to explore, experiment, and embrace new technologies. The SRE Service Operations team focuses on the application layer of our complex infrastructure as well as our developer-facing services. Our stack includes MediaWiki instances running on bare metal, surrounding microservices running on our own Kubernetes platform, an in-house designed deployment pipeline, and open source collaboration software (Gerrit, Gitlab, and Phabricator). We ❤️automation, and we automate as much as we can using primarily Python, Puppet, and Spicerack (https://github.com/wikimedia/operations-software-spicerack). We work in the open and document our work on our internal task management system and our technical wiki (https://wikitech.wikimedia.org). Feel free to check out our activities there!\n\nAs a senior engineer in the SRE Service Operations team, you will be involved in designing and running the infrastructure and services that form the base of Wikimedia Foundation’s projects, including, but not limited to: Kubernetes clusters, application servers, related datastores, and other developer-facing services. You will participate in 24/7 incident response and be on-call rotation. This role requires frequent work with other members of the SRE team to maintain and improve our systems, as well as interacting with people not in SRE, like Security, Release, and Software Engineers, together striving to move our projects and technologies forward.\n\nWe use more technologies than we can list here, and are interested in your experience even if it doesn’t exactly match the keywords above / below. If you find what we do interesting and enjoy the idea of working with a globally distributed team that runs a Top-15 website, we may be what you’re looking for!\n\nYou Are Responsible For\n\nDesign, implementation and maintenance of public facing infrastructure and servicesUse of configuration management and deployment toolsArchitectural design and operation at scaleMonitoring of systems and services, optimization of performance and resource utilizationProactively identify sources of instability in distributed systems and analyze how complex systems fail from a reliability and resilience perspective.Common operating system level tasks such as logging and backup / restoreCookbook / runbook implementation for common maintenance actions Participate in 24/7 on-call rotation and escalations for resolving production issuesLead incident response and post-incident reviews, contributing to failure analysis and implementing preventive measuresAutomation and streamlining of tasks as well as identifying process gapsCollaborating with a global and asynchronously communicating team (don’t worry if you have never worked remotely, we’ll help you get used to it)Mentoring peers in your areas of technical and operational strengthExpected to travel domestically or potentially internationally 2-3 times in a year for team gatherings and conferences\n\nSkills And Experience\n\n5+ years of experience in an SRE/Operations/DevOps roleExperience with operating highly available infrastructureExperience with running applications and services at scaleExperience implementing containerization solutions (Docker, Kubernetes)Proficient with shell and a programming language used in an SRE/Operations engineering context (Python, Go, Ruby, etc.)Comfortable with Open Source configuration management and orchestration tools (Puppet, Ansible, TerraForm etc.)Communicative technical English\n\nAdditionally, We’d Love It If You Have\n\nExperience with package management for operating systems (Debian, etc)We are avid supporters (and users) of open source software; history of contributing to Open Source projects is valuedFamiliarity with RFC 2549Prior participation in the Wikimedia movement\n\nAbout The Wikimedia Foundation\n\nThe Wikimedia Foundation is the nonprofit organization that operates Wikipedia and the other Wikimedia free knowledge projects. Our vision is a world in which every single human can freely share in the sum of all knowledge. We believe that everyone has the potential to contribute something to our shared knowledge, and that everyone should be able to access that knowledge freely. We host Wikipedia and the Wikimedia projects, build software experiences for reading, contributing, and sharing Wikimedia content, support the volunteer communities and partners who make Wikimedia possible, and advocate for policies that enable Wikimedia and free knowledge to thrive.\n\nThe Wikimedia Foundation is a charitable, not-for-profit organization that relies on donations. We receive donations from millions of individuals around the world, with an average donation of about $15. We also receive donations through institutional grants and gifts. The Wikimedia Foundation is a United States 501(c)(3) tax-exempt organization with offices in San Francisco, California, USA.\n\nAs an equal opportunity employer, the Wikimedia Foundation values having a diverse workforce and continuously strives to maintain an inclusive and equitable workplace. We encourage people with a diverse range of backgrounds to apply. We do not discriminate against any person based upon their race, traits historically associated with race, religion, color, national origin, sex, pregnancy or related medical conditions, parental status, sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, or any other legally protected characteristics.\n\nThe Wikimedia Foundation is a remote-first organization with staff members including contractors based 40+ countries*. Salaries at the Wikimedia Foundation are set in a way that is competitive, equitable, and consistent with our values and culture. The anticipated annual pay range of this position for applicants based within the United States is US$109,047 to US$169,455 with multiple individualized factors, including cost of living in the location, being the determinants of the offered pay. For applicants located outside of the US, the pay range will be adjusted to the country of hire. We neither ask for nor take into consideration the salary history of applicants. The compensation for a successful applicant will be based on their skills, experience and location.\n\nPlease note that we are currently able to hire in the following countries: Australia, Austria, Bangladesh, Belgium, Brazil, Canada, Colombia, Costa Rica, Croatia, Czech Republic, Denmark, Egypt, Estonia, Finland, France, Germany, Ghana, Greece, India, Indonesia, Ireland, Israel, Italy, Kenya, Mexico, Netherlands, Nigeria, Peru, Poland, Singapore, South Africa, Spain, Sweden, Switzerland, Uganda, United Kingdom, United States of America and Uruguay. Our non-US employees are hired through a local third party Employer of Record (EOR).\n\nWe periodically review this list to streamline to ensure alignment with our hiring requirements.\n\nAll applicants can reach out to their recruiter to understand more about the specific pay range for their location during the interview process.\n\nIf you are a qualified applicant requiring assistance or an accommodation to complete any step of the application process due to a disability, you may contact us at recruiting@wikimedia.org or +1 (415) 839-6885.\n\nU.S. Benefits & Perks\n\nApplicant Privacy Policy\n\nWikimedia Foundation\n\nWhat does the Wikimedia Foundation do?\n\nWhat makes Wikipedia different from social media platforms?\n\nOur Projects\n\nOur Tech Stack\n\nNews from across the Wikimedia movement\n\nWikimedia Blog\n\nWikimedia 2030",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": null,
          "applicants": 183,
          "views": 657,
          "jobApplicationLimitReached": false,
          "applyMethod": "https://job-boards.greenhouse.io/wikimedia/jobs/6963387?gh_src=94cfded01us",
          "salary": null,
          "company": {
              "specialities": [
                  "Non-Profit",
                  "Free knowledge",
                  "Open Source Culture",
                  "Internet",
                  "Technology",
                  "Mobile",
                  "Open Source",
                  "Education",
                  "Free Knowledge ",
                  "Wikipedia"
              ],
              "industries": [
                  "Software Development"
              ],
              "locations": [
                  {
                      "city": "San Francisco",
                      "state": "California",
                      "country": "United States"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/wikimedia-foundation",
              "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQHLq52VMetF7A/company-logo_400_400/company-logo_400_400/0/1696256412979/wikimedia_foundation_logo?e=1757548800&v=beta&t=T65H1hfvHBv8xvq2k2r-96lxHpKxn6Np26ucafX_REc",
              "website": null,
              "name": "Wikimedia Foundation",
              "employeeCount": 1064,
              "followerCount": 93002,
              "description": "About the Wikimedia Foundation\n\nThe Wikimedia Foundation is the nonprofit organization that operates Wikipedia and the other Wikimedia free knowledge projects. Our vision is a world in which every single human can freely share in the sum of all knowledge. We believe that everyone has the potential to contribute something to our shared knowledge, and that everyone should be able to access that knowledge freely. We host Wikipedia and the Wikimedia projects, build software experiences for reading, contributing, and sharing Wikimedia content, support the volunteer communities and partners who make Wikimedia possible, and advocate for policies that enable Wikimedia and free knowledge to thrive. \n\nThe Wikimedia Foundation is a charitable, not-for-profit organization that relies on donations. We receive donations from millions of individuals around the world, with an average donation of about $15. We also receive donations through institutional grants and gifts. The Wikimedia Foundation is a United States 501(c)(3) tax-exempt organization with offices in San Francisco, California, USA."
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 0.2,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0,
          "kpi_salary": 0.5,
          "kpi_company_size": 0.8,
          "kpi_company_popularity": 0.75,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 0.4,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0.66,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 1,
          "final_score": 0.65,
          "tier": "Yellow"
      },
      {
          "id": "4264834995",
          "title": "Director of DevOps",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4264834995/",
          "postedDate": "2025-07-10T10:14:50.000Z",
          "expireAt": "2025-08-09T10:14:49.000Z",
          "descriptionText": "Director of DevOps - MLOPS€90,000 - €110,000 + Bonus + Relocation Package + VisaHybrid - Basque Country - Spain\nWHY JOIN THE TEAM?LEAD A TEAM OF DevOps, MLOPS ENGINEERSAUTONOMY TO LEAD PROJECTS FROM A TECHNICAL POINTOPPORTUNITY TO OWN AND NURTURE A FUNCTIONSCALE THE TEAM\nThe Ideal profileWork and support a team of DevOps and MLOPS Engineers, technical decision-makers to define the strategic vision for deliveryMake complex decisions involving a wide range of solutions, possibly affecting several work areas within the organization.Minimum 2 years managing teams of 10 + engineers.Build a scalable DevOps and MLOps infrastructure.Deep expertise in AWS & Azure services, Kubernetes, and containerization technologies.Design state-of-the-art technical solutions on AWS that are scalable, reliable, secure, and meet performance requirements.Experience establishing standards and procedures across a service lifecycle, including the development lifecycleExcellent English communication.\n\nFor more infoIf you feel this is the role for you or you know someone suitable for the role.Email me at pinto@botifytech.com",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": "https://www.linkedin.com/job-apply/4264834995",
          "applicants": 15,
          "views": 188,
          "jobApplicationLimitReached": false,
          "applyMethod": null,
          "salary": null,
          "company": {
              "specialities": [
                  "Artificial Intelligence ",
                  "Engineering ",
                  "Data & Analytics",
                  "Cloud ",
                  "Multi - hires ",
                  "Executive Search ",
                  "Talent acquisition ",
                  "Robotics",
                  "Software",
                  "Recruitment, strategy",
                  "Head hunting"
              ],
              "industries": [
                  "Staffing and Recruiting"
              ],
              "locations": [
                  {
                      "city": "London",
                      "state": "England",
                      "country": "UK"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/botify-tech",
              "logo": "https://media.licdn.com/dms/image/v2/D560BAQHCUZt_b5i-Ew/company-logo_400_400/company-logo_400_400/0/1723032951448?e=1757548800&v=beta&t=RZ5kAXHCdo_G4ucBo6jCAJFnMUfXYTR4kyWhBDi3Ljk",
              "website": null,
              "name": "Botify Tech",
              "employeeCount": 1,
              "followerCount": 6830,
              "description": "FACING GROWTH & TALENT STRATEGY CHALLENGES?\n\nExplore our curated list of C-Level Advisors ready to help elevate your business.\n\nHere’s what you’ll find:\nCTOs – Experts who’ve scaled early-stage startups into Unicorns.\nData Science Leaders – Ranked among the Top 100 most influential figures in Data Science & AI.\nAnd much more... \n\nCTO's CPO's CMO'S Chief AI Officers\n\nAt Botify Tech, we understand that while hiring matters, EFFICIENT HIRING is key. Why not grab a quick coffee with one of our advisors and discover what your next steps towards sustainable growth could be?\n\n We are revolutionizing the staffing industry by connecting top TALENT & ADVISORS with leading businesses in the AI, Engineering & Technology space. Our mission is to redefine the way businesses and job seekers perceive staffing solutions, creating a positive impact on both ends."
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 1,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0.66,
          "kpi_salary": 0.5,
          "kpi_company_size": 0.1,
          "kpi_company_popularity": 0.5,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 0.2,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0.33,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 0.5,
          "final_score": 0.61,
          "tier": "Yellow"
      },
      {
          "id": "3936104342",
          "title": "Senior Design Manager (Infrastructure)",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/3936104342/",
          "postedDate": "2025-07-09T12:47:07.000Z",
          "expireAt": "2025-12-18T16:20:02.000Z",
          "descriptionText": "Canonical is a leading provider of open source software and operating systems to the global enterprise and technology markets. Our platform, Ubuntu, is very widely used in breakthrough enterprise initiatives such as public cloud, data science, AI, engineering innovation and IoT. Our customers include the world's leading public cloud and silicon providers, and industry leaders in many sectors. The company is a pioneer of global distributed collaboration, with 1200+ colleagues in 75+ countries and very few office based roles. Teams meet two to four times yearly in person, in interesting locations around the world, to align on strategy and execution.\n\nThe company is founder led, profitable and growing.\n\nWe are hiring a senior design manager to play a key role making open source software available to the world. Our Design function ensures the experience of the software and infrastructure we build is true to our intentions, and delivers the tools our community and customers need. The Design Manager makes this possible through leadership within, and beyond, our teams.\n\nAs a Senior Design Manager, you bring both experience managing design teams and have expertise in a deeply technical domain. This enables you to coach designers in creating tools for developers and cloud engineers, and cross-context to move towards tangible outcomes and lift the quality of their work. You will manage expectations and ensure deadlines are met in a timely manner against your roadmap. You will be able to communicate clearly and actively listen to product and engineering stakeholders, and your team, to drive sustainable quality improvements and guide individuals towards meaningful growth.\n\nLeading the Infrastructure Design team, you will take responsibility for the products that help to build cloud experiences and software distribution mechanisms, and you will help to evolve the security of how software is packaged and delivered.\n\nLocation: This role will be based remotely in the EMEA region\n\nWhat the role entails\n\nReviewing the work of your design team for qualityWorking with individual designers to support their professional growthContinuously improving operational workflows, including production outsourcing and collaboration with Web EngineeringWorking with stakeholders, especially the Engineering organization, to clearly define and validate outcomesEvolving design systems and guidelines to drive consistent quality and improve efficiencyCoordinating with the rest of design leadership to mature our collective practiceBringing your team and others together to share their work and strengthen cultureEngaging the open source community to learn and make the value of our work legible\n\n\nWhat we are looking for in you\n\nA portfolio demonstrating outstanding quality in UX design and savviness in technologyExceptional educational achievements in design or related behavioral science disciplineFull lifecycle experience from user needs discovery through validation and implementation guidanceCommitment to transparent project delivery and owning team deadlinesExperience of managing a team that interacts with technical stakeholdersFamiliarity with quantitative optimisation approachesA passion for balancing consistency and innovationWillingness to travel up to 4 times a year for internal events\n\n\nWhat we offer you\n\nYour base pay will depend on various factors including your geographical location, level of experience, knowledge and skills. In addition to the benefits below, certain roles are also eligible for additional benefits and rewards including annual bonuses and sales incentives based on revenue or utilisation. Our compensation philosophy is to ensure equity right across our global workforce.\n\nIn addition to a competitive base pay, we provide all team members with additional benefits, which reflect our values and ideals. Please note that additional benefits may apply depending on the work location and, for more information on these, you can ask in the later stages of the recruitment process.\n\nFully remote working environment - we’ve been working remotely since 2004!Personal learning and development budget of 2,000USD per annumAnnual compensation reviewRecognition rewardsAnnual holiday leaveParental LeaveEmployee Assistance ProgrammeOpportunity to travel to new locations to meet colleagues at ‘sprints’Priority Pass for travel and travel upgrades for long haul company events\n\n\nAbout Canonical\n\nCanonical is a pioneering tech firm that is at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do.\n\nCanonical has been a remote-first company since its inception in 2004. Work at Canonical is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game. Canonical provides a unique window into the world of 21st-century digital business.\n\nCanonical is an equal opportunity employer\n\nWe are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.\n\n",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": null,
          "applicants": 1212,
          "views": 16345,
          "jobApplicationLimitReached": false,
          "applyMethod": "https://job-boards.greenhouse.io/canonical/jobs/5995321?gh_src=1943652a1",
          "salary": null,
          "company": {
              "specialities": [
                  "Open Source",
                  "Certification",
                  "OpenStack",
                  "Software Development",
                  "Containers",
                  "Kubernetes",
                  "AI/ML",
                  "Software Engineering",
                  "IoT",
                  "Operating Systems",
                  "Software Operations",
                  "Cloud computing",
                  "Public cloud",
                  "Robotics",
                  "Cloud"
              ],
              "industries": [
                  "Software Development"
              ],
              "locations": [
                  {
                      "city": "London",
                      "state": "England",
                      "country": "UK"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/canonical",
              "logo": "https://media.licdn.com/dms/image/v2/C560BAQEbIYAkAURcYw/company-logo_400_400/company-logo_400_400/0/1650566107463/canonical_logo?e=1757548800&v=beta&t=ZNgc5lxVD0UQVkB_bHv4pt_AGoWVAP76sAho-Jh29xA",
              "website": null,
              "name": "Canonical",
              "employeeCount": 1765,
              "followerCount": 616478,
              "description": "We deliver open source to the world faster,  more securely and more cost effectively than any other company.\n\nWe're also the publishers of Ubuntu, the world’s most popular enterprise Linux from cloud to edge, together with a passionate global community of 200,000+ contributors. \n\nUbuntu means 'humanity to others'​. We chose it because it embodies the generosity at the heart of open source, the new normal for platforms and innovation.\n\nTogether with a community of 200,000, we publish an operating system that runs from the tiny connected devices up to the world's biggest mainframes, the platform that everybody uses on the public cloud, and the workstation experience of the world's most productive developers.\n\nSecure and reliable, elegant and intuitive, and open for innovation - this is the future of open source, which is why we're proud to be the developers of the fastest growing Linux in the world despite already being the most widely deployed.\n\nIf you're interested in a career at Canonical, we are a remote-first company so please apply to any suitable role as skills are valued more than location, despite some having a preferred geographic preference. \n\nwww.canonical.com "
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 0.2,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 1,
          "kpi_salary": 0.5,
          "kpi_company_size": 0.8,
          "kpi_company_popularity": 1,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 1,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 0.8,
          "kpi_experience_threshold": 1,
          "final_score": 0.72,
          "tier": "Green"
      },
      {
          "id": "4251508132",
          "title": "Release Engineer - MetaMask",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4251508132/",
          "postedDate": "2025-07-09T12:09:22.000Z",
          "expireAt": "2025-08-16T17:59:49.000Z",
          "descriptionText": "Location: US, EU or Remote (excluding France, Italy and Germany)\n\nConsensys is the leading blockchain and web3 software company founded by Joe Lubin, CEO of Consensys and Co-Founder of Ethereum. Since 2014, Consensys has been at the forefront of innovation, pioneering technological developments within the web3 ecosystem.\n\nThrough our product suite, including the MetaMask platform, Infura, Linea, Diligence, and our NFT toolkit Phosphor, we have become the trusted collaborator for users, creators, and developers on their path to build and belong in the world they want to see.\n\nWhether building a dapp, an NFT collection, a portfolio, or a better future, the instinct to build is universal. Consensys inspires and champions the builder instinct in everyone by making web3 universally easy to use and develop on.\n\nOur mission is to unlock the collaborative power of communities by making the decentralized web universally easy to access, use, and build on.\n\nYou’ll get to work on the tools, infrastructure, and apps that scale these platforms to onboard one billion participants and 5 million developers. You’ll be constantly exposed to new concepts, ideas, and frameworks from your peers, and as you work on different projects — challenging you to stay at the top of your game. You’ll join a network of builders that reaches the edge of our ecosystem. Consensys alumni have moved on to become tech entrepreneurs, CEOs, and team leads at tech companies.\n\nAbout MetaMask\n\nMetaMask aims to create a thriving engineering organization that supports the well-being of our engineers while empowering them to do work they are proud of and enjoy. We strive for an environment that gives our people high trust and autonomy, while also facilitating collaboration, communication and camaraderie among teams and teammates. We aspire to build a diverse engineering team, inclusive to people from all backgrounds and demographics. It is also of great importance to us that working at MetaMask is an experience that catalyzes career growth and learning.\n\nWhat You’ll Do\n\nWe’re looking for a Release Engineer to support and streamline the delivery of our Mobile (iOS & Android) and Extension (browser-based) applications. This is not a traditional DevOps position — it’s a hands-on, team-facing role focused on ensuring build quality, release consistency, and delivery velocity across platforms.\n\nYou’ll work closely with engineers, QA, and product managers to support day-to-day release needs, review cherry-picks, manage builds, validate artifacts, and continuously improve our tooling and processes.\n\nResponsibilities:\n\nSupport engineering teams with day-to-day release tasks, including cherry-pick reviews, build validations, and release coordinationOwn and maintain CI/CD pipelines using Bitrise, GitHub Actions, GitHub Runners, Advanced GH Workflows and CircleCIAutomate and improve build/test/release workflows via scripting (Bash, TypeScript/JavaScript, etc.)Monitor build health, troubleshoot issues, and proactively resolve blockersEnsure proper versioning, tagging, and signing of builds for mobile and browser extension platformsSubmit and track releases on App Store, Play Store, and extension stores (Chrome, Firefox, Edge)Partner with QA to integrate and validate unit, UI, and E2E tests in release workflowsMaintain clear documentation and checklists for release processesCoordinate feature flag rollouts using LaunchDarkly in collaboration with engineering and product\n\nWhat we're looking for:\n\n3+ years of experience in release engineering, CI/CD, or build/release coordination (not just infrastructure)Experience supporting cross-functional teams and reviewing/cherry-picking production code branchesDeep knowledge of CI/CD tools: Bitrise, GitHub Actions, CircleCI, GitHub RunnersStrong scripting ability, GH Actions, YML-based systemsGit workflows (trunk-based, Git Flow) and semantic versioningExcellent communication skills and the ability to support fast-moving teams\n\nWould be great if you brought this to the role\n\nExperience with LaunchDarkly or other feature flag systemsUnderstanding of staged rollouts, crash monitoring, and store compliance processesFamiliarity with extension-specific policies (e.g., CSP, permission management)iOS builds & release (Fastlane, Xcode, TestFlight, App Store Connect)Android builds & release (Gradle, Play Console)Browser extensions (manifest v2/v3, WebExtension APIs, Chrome/Firefox/Edge stores)Contributions to release tools, automation frameworks, or documentation in open source or prior roles\n\nDon't meet all the requirements? Don't sweat it. We’re passionate about building a diverse team of humans and as such, if you think you've got what it takes for our chaotic-but-fun, remote-friendly, start-up environment—apply anyway, detailing your relevant transferable skills in your cover letter. While we have a pretty good idea of what we need, we're ready for you to challenge our thinking on who needs to be in this role.\n\nSELECT BELOW\n\n$85,000—$160,000 USD\n\nIn the rapidly evolving Web3 space, we believe that everyone is a builder. This expansive paradigm requires a range of backgrounds, talents, skills, and experiences to influence and shape the future. At Consensys, this diversity fuels our ability to shift control and redefine the realm of possibility. We are committed to ensuring that our technology empowers people and communities with economic and political agency through decentralized technologies. We welcome the range of perspectives and differences and celebrate them. We're excited to see how your unique skills as a builder can contribute to our vision, drive innovation, and help us shape a more inclusive Web3.\n\nConsensys is an equal opportunity employer. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status, veteran status, or any other characteristic protected by law. Consensys is aware of fraudulent recruitment practices and we encourage all applicants to review our best practices to protect yourself which can be found (https://consensys.io/careers/best-practices-to-avoid-recruitment-fraud/).\n\n",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": null,
          "applicants": 120,
          "views": 1126,
          "jobApplicationLimitReached": false,
          "applyMethod": "https://consensys.io/open-roles/6964284?gh_jid=6964284&gh_src=4a7b57e21us",
          "salary": null,
          "company": {
              "specialities": [
                  "Cryptocurrency",
                  "Blockchain",
                  "Web 3.0",
                  "Ethereum",
                  "Fintech",
                  "Decentralized Applications (dApps)",
                  "solidity"
              ],
              "industries": [
                  "Software Development"
              ],
              "locations": [
                  {
                      "city": "Fort Worth",
                      "state": "Texas",
                      "country": "United States"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/consensys-software-inc",
              "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQE3hYT2QCBRzw/company-logo_400_400/company-logo_400_400/0/1687864720039/consensys_software_inc_logo?e=1757548800&v=beta&t=pXeQY45yKknZM2o_w3NDIwgvBicB8ZTU-KOqhV3U2Qc",
              "website": null,
              "name": "Consensys",
              "employeeCount": 781,
              "followerCount": 143098,
              "description": "A complete suite of trusted products to build anything in web3."
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 1,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0,
          "kpi_salary": 0.5,
          "kpi_company_size": 0.7,
          "kpi_company_popularity": 0.9,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 0.6,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0.33,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 1,
          "final_score": 0.7,
          "tier": "Green"
      },
      {
          "id": "4224361794",
          "title": "Product Designer",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4224361794/",
          "postedDate": "2025-07-09T12:44:55.000Z",
          "expireAt": "2025-09-03T11:10:37.000Z",
          "descriptionText": "Fuse Energy is seeking a talented and creative Product Designer to join our innovative team. In this role, you will work closely with operations managers, front-end developers, and backend engineers to build a 10X consumer product that revolutionizes the renewable energy space for everyday consumers. You'll have the opportunity to work across multiple platforms, including mobile applications on iOS and Android, websites, and eventually, responsive web applications. Additionally, you'll be responsible for generating creative collateral for various consumer touchpoints of the product.\n\nResponsibilities:\n\nWorking directly with the CEO and co-founder to build a groundbreaking consumer productDesign and iterate on user interfaces for mobile applications, websites, and responsive web applicationsGenerate creative collateral for consumer touchpoints, ensuring consistency and brand integrityParticipate in scoping and conceptualization sessions to define product requirements and user needsDrive the ideation of new features and functionality, contributing innovative solutions to enhance user experienceConduct user research, usability testing, and gather feedback to inform design decisionsAdapt quickly to evolving project requirements and proactively seek opportunities for improvementMaintain design consistency and standards across all platforms and devices\n\nRequirements\n\n3+ years product design experience using FigmaExperience designing consumer-facing products in data-driven environmentsEvidence of strong visual sensibility (graphic, typography, alternative media)Experience with motion graphics (2D / 3D)Hold a Bachelor's degree in a highly analytical discipline\n\nBenefits\n\nCompetitive salary and a stock options sign-on bonusBiannual bonus schemeFully expensed tech to match your needs!Paid annual leaveBreakfast and dinner for office based employees",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": "https://www.linkedin.com/job-apply/4224361794",
          "applicants": 1137,
          "views": 6587,
          "jobApplicationLimitReached": false,
          "applyMethod": "https://apply.workable.com/j/237CED6406?src=LinkedIn&utm_source=linkedin.com&src=LinkedIn&src=LinkedIn&utm_source=linkedin.com&gh_src=i5qg2y1&gh_src=3d45b0b2teu&utm_source=linkedin.com",
          "salary": null,
          "company": {
              "specialities": [],
              "industries": [
                  "Software Development"
              ],
              "locations": [
                  {
                      "city": "London",
                      "state": "England",
                      "country": "UK"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/fuseenergyhq",
              "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQFxE3Bjun6O5g/company-logo_400_400/company-logo_400_400/0/1689894735576/get_fuse_energy_logo?e=1757548800&v=beta&t=eYM1Rrivu2teP_6_x2SjjhWO8eOPZzvCthJ8QzwFas4",
              "website": null,
              "name": "Fuse Energy",
              "employeeCount": 134,
              "followerCount": 79963,
              "description": "We are building a full stack renewable energy company to accelerate global renewable energy transition. We are based in London, New York. \n \nWe've raised $90m from top tier investors like Balderton, Lakestar, Accel, Creandum, Lowercarbon, Ribbit, MultiCoin.\n\nEnergy is broken – We are here to fix it."
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 0.5,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0,
          "kpi_salary": 0.5,
          "kpi_company_size": 0.5,
          "kpi_company_popularity": 0.75,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 0.8,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 1,
          "final_score": 0.63,
          "tier": "Yellow"
      },
      {
          "id": "4252916081",
          "title": "Sr Software Engineer, Reliability Engineering",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4252916081/",
          "postedDate": "2025-07-10T09:48:18.000Z",
          "expireAt": "2025-08-18T05:32:32.000Z",
          "descriptionText": "About Gusto\n\nGusto is a modern, online people platform that helps small businesses take care of their teams. On top of full-service payroll, Gusto offers health insurance, 401(k)s, expert HR, and team management tools. Today, Gusto offices in Denver, San Francisco, and New York serve more than 400,000 businesses nationwide.\n\nOur mission is to create a world where work empowers a better life, and it starts right here at Gusto. That’s why we’re committed to building a collaborative and inclusive workplace, both physically and virtually. Learn more about our Total Rewards philosophy.\n\nSr Software Engineer, Reliability Engineering\n\nHere’s What You’ll Do Day-to-day\n\nBuild Tooling & Infrastructure: Design and implement reliability dashboards, AI-driven alerting systems, and internal developer tools that promote operational excellence and self-service.Drive Strategic Initiatives: Lead the adoption of DevOps practices across product engineering teams, including environment standardization, service readiness, and release reliability.Automate Reliability & Observability: Develop intelligent systems for automated alerting, diagnostics, and incident response using AI/ML approaches. Enhance observability through centralized dashboards and proactive monitoring strategies.Mentor & Influence: Coach engineers and leaders on DevOps best practices, champion reliability-focused principles, and mentor peers in systems thinking and operational maturity.Establish Standards & Automation: Define engineering standards and implement deterministic automation with a focus on usability, accessibility, and long-term system resilience.\n\nHere’s What We're Looking For\n\nStrategic thinker, driven to identify high impact opportunities and efficiently implement systemic solutions.Resilient problem solver, inspired to be in service of our peers and Gusto’s customers.Strong communicator, committed to drive alignment across technical and non-technical stakeholders.\n\nRequired Previous Experience\n\n5+ years of professional experience as a software engineer.Implementation and integration of observability platforms. (Datadog preferred)Experience with incident remediation and development of incident management programs.\n\nPreferred Previous Experiences\n\nExperience with Ruby, Python, and TypeScript.Deployment and operation of cloud infrastructure. (AWS preferred)Provisioning and managing infrastructure using Infrastructure-as-Code tools. (Terraform preferred)Deploying and operating container orchestration. (Kubernetes preferred)Proficient in Linux system administration and comfortable working in shell environments.Designed and supported high-availability architectures and scalability strategies.Participated in service extraction efforts to break apart monoliths and transition toward a service-oriented architecture.\n\nOur cash compensation amount for this role is targeted at $164,000-$204,000 in Denver & most remote locations, and $197,000-$235,000 for San Francisco & New York. Final offer amounts are determined by multiple factors including candidate experience and expertise and may vary from the amounts listed above.\n\nGusto has physical office spaces in Denver, San Francisco, and New York City. Employees who are based in those locations will be expected to work from the office on designated days approximately 2-3 days per week (or more depending on role). The same office expectations apply to all Symmetry roles, Gusto's subsidiary, whose physical office is in Scottsdale.\n\nNote: The San Francisco office expectations encompass both the San Francisco and San Jose metro areas.\n\nWhen approved to work from a location other than a Gusto office, a secure, reliable, and consistent internet connection is required.\n\nOur customers come from all walks of life and so do we. We hire great people from a wide variety of backgrounds, not just because it's the right thing to do, but because it makes our company stronger. If you share our values and our enthusiasm for small businesses, you will find a home at Gusto.\n\nGusto is proud to be an equal opportunity employer. We do not discriminate in hiring or any employment decision based on race, color, religion, national origin, age, sex (including pregnancy, childbirth, or related medical conditions), marital status, ancestry, physical or mental disability, genetic information, veteran status, gender identity or expression, sexual orientation, or other applicable legally protected characteristic. Gusto considers qualified applicants with criminal histories, consistent with applicable federal, state and local law. Gusto is also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. We want to see our candidates perform to the best of their ability. If you require a medical or religious accommodation at any time throughout your candidate journey, please fill out this form and a member of our team will get in touch with you.\n\nGusto takes security and protection of your personal information very seriously. Please review our Fraudulent Activity Disclaimer.\n\nPersonal information collected and processed as part of your Gusto application will be subject to Gusto's Applicant Privacy Notice.",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": null,
          "applicants": 65,
          "views": 183,
          "jobApplicationLimitReached": false,
          "applyMethod": "https://job-boards.greenhouse.io/gusto/jobs/6875132?gh_src=80fddc691us",
          "salary": "164,000 - 204,000 USD",
          "company": {
              "specialities": [
                  "compliance",
                  "payroll",
                  "human resources",
                  "benefits"
              ],
              "industries": [
                  "Software Development"
              ],
              "locations": [
                  {
                      "city": "San Francisco",
                      "state": "California",
                      "country": "United States"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/gustohq",
              "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQH658sJdurY4A/company-logo_400_400/company-logo_400_400/0/1731018699255/gustohq_logo?e=1757548800&v=beta&t=7SE1j6r9-D4l1-KqjMOYGR0kTMdFpPRxVpp3cvnTN6A",
              "website": null,
              "name": "Gusto",
              "employeeCount": 3586,
              "followerCount": 127559,
              "description": "Launched in 2011 as ZenPayroll, Gusto serves more than 400,000 businesses nationwide. Each year, we process tens of billions of dollars of payroll and provide employee benefits—like health insurance and 401(k) accounts—while helping companies create incredible workplaces.\n\nThrough one refreshingly easy, integrated platform, we automate and simplify your payroll, benefits, and HR, all while providing expert support. You and your employees will get the peace of mind you need to do your best work. \n\nLicensing details: https://gusto.com/about/licenses"
          },
          "kpi_jd_quality": 0.8,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 0.2,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0,
          "kpi_salary": 0.8,
          "kpi_company_size": 0.8,
          "kpi_company_popularity": 0.9,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 0.2,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 1,
          "final_score": 0.61,
          "tier": "Yellow"
      },
      {
          "id": "4261927035",
          "title": "Software Automation Test Engineer",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4261927035/",
          "postedDate": "2025-07-10T10:01:08.000Z",
          "expireAt": "2025-08-09T10:01:08.000Z",
          "descriptionText": "Seeking to hire a Software Automation Test Engineer to design, develop, and maintain automated testing frameworks for a high growth Healthcare Technology client in the PBM space. The ideal candidate will collaborate closely with developers to integrate testing into the software development lifecycle, ensuring robust and scalable applications.\nResponsibilities:• Design, develop, and maintain automated test frameworks for functional, performance, and security testing using tools like Selenium, Playwright, and JMeter.• Write and execute automated test scripts using tools such as Selenium, Playwright, and AI-driven platforms such as Functionize.• Collaborate with developers to implement Test-Driven Development (TDD) and set up CI/CD pipelines using tools like GitHub Actions, and Azure DevOps in Azure environments.• Perform API testing using tools like Postman, Karate, and REST Assured.• Leverage all-in-one automation platforms like Katalon Studio, TestComplete, or Functionize to support Web, and API testing.• Write and execute SQL queries to validate backend data and ensure data integrity.• Identify, document, and track defects using JIRA, or similar issue tracking tools.• Participate in code reviews to ensure testability, maintainability, and adherence to quality standards.• Continuously optimize and scale test automation strategies for improved efficiency, coverage, and reliability.\nRequirements:• 2-4 years of experience as Software Automation Test Engineer within Healthcare Technology or Pharmacy Benefit Management, (PBM)• Strong programming skills in JavaScript, Python, SQL, and familiarity with AI-assisted scripting.• Experience with test automation frameworks and building CI/CD pipelines.• Understanding of cloud-based testing environments, particularly in Azure.• Familiarity with performance testing concepts and tools.• Solid grasp of API testing, database validation, and test data management.• Knowledge of Agile methodologies and DevOps practices.• Ability to collaborate effectively with cross-functional teams and contribute to quality assurance strategies.",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": "https://www.linkedin.com/job-apply/4261927035",
          "applicants": 24,
          "views": 28,
          "jobApplicationLimitReached": false,
          "applyMethod": null,
          "salary": null,
          "company": {
              "specialities": [
                  "Talent Acquisition Strategy",
                  "Contingency Recruitment",
                  "Contract Recruitment",
                  "Executive Search",
                  "Sales Recruitment",
                  "Marketing Recruitment ",
                  "IT Recruitment"
              ],
              "industries": [
                  "Staffing and Recruiting"
              ],
              "locations": [
                  {
                      "city": "Holden",
                      "state": "Massachusetts",
                      "country": "United States"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/tsv-consulting",
              "logo": "https://media.licdn.com/dms/image/v2/D560BAQFsrtC8rVa6oQ/company-logo_400_400/B56ZVw_tLfHoAY-/0/1741357503761/tsv_consulting_logo?e=1757548800&v=beta&t=XMUscSInQOfPotgQoMIrcpnpwqn4V1IDXmUruJjAkUw",
              "website": null,
              "name": "TSV Consulting LLC",
              "employeeCount": 2,
              "followerCount": 9616,
              "description": "TSV Consulting is a boutique, woman-owned talent acquisition firm specializing in partnering with growth clients in the Healthcare Technology and PBM sectors. We focus on identifying and hiring Executive and Leadership talent across organizations nationwide. Our approach emphasizes being a trusted advisor to both clients and candidates, providing support and engagement throughout the recruitment process.\n\nTSV Consulting is dedicated to building long-lasting relationships with our clients and candidates by understanding their unique needs and preferences. Our personalized approach ensures that we create the best match for both parties, resulting in increased productivity, job satisfaction, and strong retention rates. At TSV Consulting, recruitment is about Hiring Success.\n\nTSV Consulting offers personalized, tailored recruitment solutions to meet today's competitive landscape. Our services include contingency search, executive search, contract recruitment, and talent acquisition strategy consulting. With specialties in Sales, Marketing, and Technical recruitment, we are committed to providing efficient and cost-effective solutions that result in quality hires, quick time-to-fill, and strong retention rates."
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 0.5,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0,
          "kpi_salary": 0.5,
          "kpi_company_size": 0.2,
          "kpi_company_popularity": 0.5,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 0.2,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 1,
          "final_score": 0.56,
          "tier": "Yellow"
      },
      {
          "id": "4252720036",
          "title": "DevOps Engineer (MLOps)",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4252720036/",
          "postedDate": "2025-07-10T10:37:01.000Z",
          "expireAt": "2025-08-17T23:01:06.000Z",
          "descriptionText": "About the Engineering Organization:  The Engineering Team at Loop is a balance of agility, consistency, and performance. These are the pillars that allow the team to constantly and consistently deliver value that matters to customers. That customer intimacy is what allows our engineering teams to be the best in our space, and bring the best ideas to the market.\n\nAbout the Role:  We are seeking a DevOps (MLOps) Engineer to pioneer and mature our machine learning operations capabilities, focusing on building robust infrastructure and deployment pipelines in AWS. This critical role will own the infrastructure underlying all of our productionalized ML models , from deployment to monitoring, fostering seamless collaboration between our machine learning and broader engineering teams. The MLOps engineer will work closely with ML engineers to keep state-of-the-art, mission-critical ML models up-to-date, scalable, and observable.\n\nOur Blended Work Environment:  At Loop, we’re intentional about the way we work so that we can do our best work. We call this our Blended Working Environment. We work from our HQ in Columbus, OH, or one of our Hub or Secluded locations, and are distributed throughout the United States, select Canadian provinces, and the United Kingdom. For this position, we’re looking for someone to join us in Columbus, OH; Chicago, IL; Austin, TX; Los Angeles, CA; or fully remote.\n\nOur Tech Stack:  AWS Cloud (Kubernetes, Serverless architecture, Redis, Aurora, DynamoDB, and identity management), Docker, MLFlow, Gitlab, Airflow, PHP/Laravel, Linux, Terraform, Datadog, Snowflake, dbt\n\nWhat You'll Do: \n\nDesign and implement scalable CI/CD pipelines for machine learning models within our AWS infrastructure, driving automated builds, deployments, and engineering excellence.Establish and evolve ML operational best practices in a greenfield environment, defining the standards for model versioning, reproducibility, and MLOps maturity.Collaborate closely with Machine Learning Engineers to understand model requirements and provide expert guidance on infrastructure, deployment strategies, and operationalizing their models.Implement and manage comprehensive monitoring and observability solutions for deployed ML models using tools like Datadog, ensuring high performance, accuracy, and quick issue resolution.Maintain and optimize ML model repositories to ensure efficient versioning and management of all model artifacts throughout their lifecycle.Drive the adoption of Infrastructure as Code (IaC) principles for ML infrastructure, ensuring reusability, consistency, and reliability across environments.Participate in the broader DevOps team ceremonies and planning, integrating ML Ops initiatives seamlessly into the overall engineering roadmap.\n\nYour Experience: \n\n5+ years of experience in DevOps or MLOps Engineering roles, with at least 2+ years dedicated to hands-on experience specifically with machine learning operations, including enterprise-grade deep learning architectures (e.g., transformers, graph NNs, VAEs).Bachelor’s degree or higher in Computer Science, Mathematics, Statistics, or a related quantitative discipline, or equivalent practical experience, is highly preferred.Deep expertise in AWS infrastructure and services, with a proven track record of deploying and managing scalable ML workloads in the cloud.Strong proficiency in Python and extensive experience with key machine learning libraries such as PyTorch, Pandas, and scikit-learn.Extensive experience with containerization technologies (ex: Docker) for packaging and deploying ML models.Demonstrated experience with ML lifecycle management platforms such as MLflow.Proven ability to thrive as a self-starter in ambiguous, greenfield environments, taking initiative and delivering solutions with minimal oversight.Excellent collaboration and communication skills, with a demonstrated ability to act as a critical bridge between machine learning, data science, and core engineering teams.\n\n$123,200 - $184,800 a year\n\nWe know that making decisions about your career and compensation is a huge deal. Because of that, we’re incredibly thoughtful about our compensation strategy. We want you to feel safe and excited, but also comfortable with the compensation package of a startup. We’ve outlined some important information for you here, but please know there’s a lot more to compensation than we can cover in this job posting.\n\nThe posted salary range is the base salary for this opportunity. The salary range is subject to change, and may be adjusted in the future.\n\nThe actual annual salary paid for this position will be based on several factors, including, but not limited to: your prior experience and skills related to the position, geographic location, company needs, current market demands, and your total compensation goals.\n\nGreat humans deserve great benefits. At Loop, you’ll be eligible for benefits such as: medical, dental, and vision insurance, flexible PTO, company holidays, sick & safe leave, parental leave, 401k, monthly wellness benefit, home workstation benefit, phone/internet benefit, and equity.\n\nLoop Story\n\nIn a perfect world, Loop wouldn't exist. If we had our way, we'd live in a world where we're mindful about how we consume, we love every product we own, and we share values with the brands who create them. In reality, commerce isn't perfect and often breaks. Loop creates second chances.\n\nWe're starting by revolutionizing the post-purchase experience. We've taken one of the most fragile commerce interactions - returns - and turned it into something consumers actually love, and that deepens our connection to brands and products.\n\nWe take connection seriously on the inside, too. We're building a work experience that allows you to Be A Human First and prioritizes empathy and wellbeing. We view Loop as a special place in your career to shape the future of an industry and become a better person while doing it. You can grow faste  r  here in a shorter amount of time - we'll give you space and trust you to fill it.\n\nLearn more about us here: https://loopreturns.com/careers .\n\nYou can review our privacy notice here .\n\n",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": null,
          "applicants": 597,
          "views": 1459,
          "jobApplicationLimitReached": false,
          "applyMethod": "https://jobs.lever.co/loopreturns/eeb34af0-e24f-4c0d-9a69-a4f069da0eb2/apply?lever-source=LinkedInJobs",
          "salary": "123,200 - 184,800 USD",
          "company": {
              "specialities": [],
              "industries": [
                  "Software Development"
              ],
              "locations": [
                  {
                      "city": "Columbus",
                      "state": "Ohio",
                      "country": "United States"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/loop-returns",
              "logo": "https://media.licdn.com/dms/image/v2/D560BAQFxXFh5pm3URQ/company-logo_400_400/company-logo_400_400/0/1719942662285/loop_returns_logo?e=1757548800&v=beta&t=nASbzKU9qXPXT3SJr4ddYUbwmvPDxVOPvNzZ_i_elbY",
              "website": null,
              "name": "Loop",
              "employeeCount": 289,
              "followerCount": 23127,
              "description": "In a perfect world, Loop wouldn't exist. If we had our way, we'd live in a world where we're mindful about how we consume, we love every product we own, and we share values with the brands who create them. In reality, commerce isn't perfect and often breaks. Loop creates second chances.\n\nWe're starting by revolutionizing the post-purchase experience. We've taken one of the most fragile commerce interactions - returns - and turned it into something consumers actually love, and that deepens our connection to brands and products.\n\nWe take connection seriously on the inside, too. We're building a work experience that allows you to Be A Human First and prioritizes empathy and wellbeing. We view Loop as a special place in your career to shape the future of an industry and become a better person while doing it. You can grow faster here in a shorter amount of time - we'll give you space and trust you to fill it.\n\nCome help us build the future of ecommerce: www.loopreturns.com/careers"
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 0.2,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0,
          "kpi_salary": 0.8,
          "kpi_company_size": 0.6,
          "kpi_company_popularity": 0.6,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 0.6,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0.33,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 1,
          "final_score": 0.64,
          "tier": "Yellow"
      },
      {
          "id": "4250737201",
          "title": "Senior Web Front-End Developer",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4250737201/",
          "postedDate": "2025-07-10T10:45:00.000Z",
          "expireAt": "2025-08-17T20:14:45.000Z",
          "descriptionText": "Job Description\n\nActive IRS Cleared (MBI) Required\n\nCherokee Nation Solutions Link (CNSL) is seeking a skilled Senior Front-End Developer to join our team. The ideal candidate will have a minimum of 5 years of professional front-end experience, proficient in modern web development tools, techniques, and methods. You will be responsible for front end web development using HTML5, CSS, JavaScript, React, and other related technologies. Additionally, you will ensure adherence to web standards, accessibility standards, and multi-lingual standards while collaborating within an Agile team environment. If you are passionate about creating exceptional user experiences and possess the required technical skills, we encourage you to apply.\n\nCompensation & Benefits\n\nEstimated Starting Salary Range for Senior Front-End Developer: $120,000 - $150,000\n\nPay commensurate with experience.\n\nFull time benefits include Medical, Dental, Vision, 401K, and other possible benefits as provided.Benefits are subject to change with or without notice.\n\nSenior Front End Developer Responsibilities Include\n\n Front end web dev with HTML5, CSS, SASS, and modern frameworks.  Crafting user-centric web layouts and optimizing user experience.  Integrating RESTful APIs for Java web app interoperability.  Developing JavaScript code with modern standards and libraries.  Creating web layouts from static images and templates in full-stack frameworks.  Ensuring software meets web, accessibility, and multi-lingual standards.  Considering 508 compliances and localization formats.  System Analysis, Design and Development: Designing and implementing software applications.  Documenting APIs and technical concepts for diverse audiences.  Conducting alternative analysis and maintaining code artifacts.  Following Test-driven development (TDD) and DevOps practices.  Supporting automation and performance testing.  Providing Tier 3 support and assisting with packaging.  Utilizing Git, GitHub, and open-source solutions.  Mentoring developers and fostering collaborative work.  Agile Teamwork: Active participation in stand-ups and planning activities.  Effective communication with Scrum Master and team.  Conducting demos and updating tasks in Rational CLM.  Identifying dependencies and Enabler Stories.  Engaging in retrospectives and translating requirements into stories.  Performs other job-related duties as assigned \nSenior Front End Developer Experience, Education, Skills, Abilities Requested\n\n Bachelor’s degree in information technology or a related field.  Active IRS Cleared (MBI)- required. Must have 5+ years of full-time professional front-end experience working on Agile teams and using modern web development tools, techniques, and methods for the creation and deployment of user-facing interfaces.  Proficient in client-side development tools and libraries: Node.js, NPM, Babel, Webpack, JavaScript, React, Create React App, Jest, Testing Library, Selenium , Jira, Confluence, React, AWS, Databricks  Strong understanding and application of web standards: CSS, HTML5.  Familiarity with accessibility standards: WCAG 2.0 (Section 508/WCAG 2.0 AA) and WAI-ARIA.  Experience with multi-lingual standards: Accessibility Standards (a11y), Internationalization (i18n), and Localization (l10n).  Must pass pre-employment qualifications of Cherokee Federal \n\nCompany Information\n\nCherokee Nation Solutions Link (CNSL) is a part of Cherokee Federal – the division of tribally owned federal contracting companies owned by Cherokee Nation Businesses. As a trusted partner for more than 60 federal clients, Cherokee Federal LLCs are focused on building a brighter future, solving complex challenges, and serving the government’s mission with compassion and heart. To learn more about CNSL, visit cherokee-federal.com.\n\n#CherokeeFederal \n\nCherokee Federal is a military friendly employer. Veterans and active military transitioning to civilian status are encouraged to apply.\n\nKeywords\n\n Front End Development  Agile Teams  Web Standards  Accessibility Standards  Multi-lingual Standards \n\nSimilar Job Titles\n\n Front End Engineer  Senior UI Developer  Front End Architect  Web Development Specialist  Senior Front End Software Engineer \n\nLegal Disclaimer\n\n All qualified applicants will receive consideration for employment without regard to protected veteran status, disability or any other status protected under applicable federal, state or local law. \n\n Many of our job openings require access to government buildings or military installations. Candidates must pass pre-employment qualifications of Cherokee Federal.",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": null,
          "applicants": 413,
          "views": 1126,
          "jobApplicationLimitReached": false,
          "applyMethod": "https://ibtcjb.fa.ocs.oraclecloud.com/hcmUI/CandidateExperience/en/job/28450/?utm_medium=jobboard&utm_source=linkedin",
          "salary": "120,000 - 150,000 USD",
          "company": {
              "specialities": [
                  "Federal Contracting"
              ],
              "industries": [
                  "Business Consulting and Services"
              ],
              "locations": [
                  {
                      "city": "Tulsa",
                      "state": "Oklahoma",
                      "country": "United States"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/cherokee-federal",
              "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQGO-5Ulm-SCKw/company-logo_400_400/company-logo_400_400/0/1630533579436/cherokee_federal_logo?e=1757548800&v=beta&t=CvT9ogxayrSJFKJzrXJEM1j-75AFmV6RWkfbDjNW_o4",
              "website": null,
              "name": "Cherokee Federal",
              "employeeCount": 2092,
              "followerCount": 51152,
              "description": "Cherokee Federal, a division of Cherokee Nation Businesses, is a trusted team of government contracting professionals who can rapidly build innovative solutions. We work around the globe to help solve issues in national security and intelligence, information technology, health solutions, DoD logistics and humanitarian relief. Our businesses serve the Cherokee Nation tribe, where 100% of our profits support building a brighter future for tribal citizens. "
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 0.2,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0,
          "kpi_salary": 0.6,
          "kpi_company_size": 0.8,
          "kpi_company_popularity": 0.75,
          "kpi_industry_match": 0,
          "kpi_job_popularity": 0.6,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 1,
          "final_score": 0.6,
          "tier": "Yellow"
      },
      {
          "id": "4143753303",
          "title": "Oracle Integration PaaS Cloud Engineer",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4143753303/",
          "postedDate": "2025-07-10T09:55:44.000Z",
          "expireAt": "2025-10-05T07:13:24.000Z",
          "descriptionText": "As an Oracle Integration PaaS Cloud Engineer, you will take on a strategic leadership role in managing complex Day 2 operations for enterprise clients. You will guide teams in designing, implementing, and maintaining advanced integration solutions using Oracle Integration Cloud (OIC) and related technologies. Your responsibilities will span technical delivery, client engagement, and ensuring operational excellence.\nYou will be a key technical advisor, ensuring the success of large-scale integrations while collaborating across diverse teams and stakeholders. As a senior individual contributor, you will act as a mentor, set standards for integration best practices, and lead the team in delivering high-quality, scalable solutions.\nPreference is for people in CA, NJ or NC, but people located in other US states will also be considered.\nCareer Level - IC4\nResponsibilitiesResponsibilities include supporting Customer Success Services (CSS) customers Paas4SaaS implementations and building critical business process improvement, monitoring, support, and regression testing of the end-to-end customer Paas4SaaS cloud deployments. Will accelerate consumption in high potential customer accounts by providing deep technical expertise. Will assist in deployment of projects, run, and maintain of cloud deployments, creation, and delivery of technical content, with a dedicated focus on Oracle SaaS & PaaS cloud services. Will assist engineering efforts for building tools including feature evaluation, feature selection, automation of tasks, visualization, monitoring and integration.\nMinimum Qualifications8+ years of experience in development, support, integration, or a related field.7+ years of expertise in delivering integration, OIC or API-based solutions.Hands-on experience leading multiple full lifecycle projects using OIC and API products.In-depth knowledge of integrating SaaS applications and on-premises software.Proficiency in web services, XML technologies, SOA, and RESTful services.Proven ability to architect and design solutions for enterprise-scale clients.Bachelor’s or master’s degree in computer science, Engineering, or a related field.\nPreferred QualificationsExperience with DevOps tools, automation frameworks, and end-to-end delivery of integration solutions.Hands-on expertise with Oracle VBCS, PCS, MFT CS, BPEL, OSB, and B2B.Experience with BI reports.Experience with PL/SQL and Database concepts.Experience in Oracle SaaS.Experience with WebLogic Server Administration.Proven track record of successfully managing Day 2 operations, including continuous improvement and issue resolution.Experience mentoring engineers and contributing to the evolution of technical standards and best practices.\nProfessional SkillsProven success in contributing to a team-oriented environment.Proven ability to work creatively and analytically in a problem-solving environment.Excellent leadership, communication (written and oral) and interpersonal skills.Excellent customer facing skills.Ability to be a self-starter and be always on the leading edge of technology.Sharp troubleshooting skills, problem solving and analytical skills.Ability to travel. While travel is occasional, when you do travel it could be 1 or 2 weeks at a time.\nDisclaimer: Certain US customer or client-facing roles may be required to comply with applicable requirements, such as immunization and occupational health mandates.\nRange and benefit information provided in this posting are specific to the stated locations onlyUS: Hiring Range in USD from $38.03 - $76.06 per hour; from: $79,100 - $158,200 per year. May be eligible for equity.\nOracle maintains broad salary ranges for its roles in order to account for variations in knowledge, skills, experience, market conditions and locations, as well as reflect Oracle’s differing products, industries and lines of business. Candidates are typically placed into the range based on the preceding factors as well as internal peer equity.\nOracle US offers a comprehensive benefits package which includes the following:Medical, dental, and vision insurance, including expert medical opinionShort term disability and long term disabilityLife insurance and AD&DSupplemental life insurance (Employee/Spouse/Child)Health care and dependent care Flexible Spending AccountsPre-tax commuter and parking benefits401(k) Savings and Investment Plan with company matchPaid time off: Flexible Vacation is provided to all eligible employees assigned to a salaried (non-overtime eligible) position. Accrued Vacation is provided to all other employees eligible for vacation benefits. For employees working at least 35 hours per week, the vacation accrual rate is 13 days annually for the first three years of employment and 18 days annually for subsequent years of employment. Vacation accrual is prorated for employees working between 20 and 34 hours per week. Employees working fewer than 20 hours per week are not eligible for vacation.11 paid holidaysPaid sick leave: 72 hours of paid sick leave upon date of hire. Refreshes each calendar year. Unused balance will carry over each year up to a maximum cap of 112 hours.Paid parental leaveAdoption assistanceEmployee Stock Purchase PlanFinancial planning and group legalVoluntary benefits including auto, homeowner and pet insurance\nThe role will generally accept applications for at least three calendar days from the posting date or as long as the job remains posted.\nAbout UsAs a world leader in cloud solutions, Oracle uses tomorrow’s technology to tackle today’s challenges. We’ve partnered with industry-leaders in almost every sector—and continue to thrive after 40+ years of change by operating with integrity.\nWe know that true innovation starts when everyone is empowered to contribute. That’s why we’re committed to growing an inclusive workforce that promotes opportunities for all.\nOracle careers open the door to global opportunities where work-life balance flourishes. We offer competitive benefits based on parity and consistency and support our people with flexible medical, life insurance, and retirement options. We also encourage employees to give back to their communities through our volunteer programs.\nWe’re committed to including people with disabilities at all stages of the employment process. If you require accessibility assistance or accommodation for a disability at any point, let us know by emailing accommodation-request_mb@oracle.com or by calling +1 888 404 2494 in the United States.\nOracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans’ status, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": null,
          "applicants": 89,
          "views": 686,
          "jobApplicationLimitReached": false,
          "applyMethod": "https://eeho.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/job/277658/?utm_medium=jobboard&utm_source=LinkedIn",
          "salary": "38 - 76 USD",
          "company": {
              "specialities": [
                  "enterprise",
                  "software",
                  "applications",
                  "database",
                  "middleware",
                  "fusion",
                  "business intelligence",
                  "Primavera",
                  "PeopleSoft",
                  "EPM",
                  "BEA",
                  "Hyperion",
                  "Retek",
                  "Utilities",
                  "On-Demand",
                  "server & storage systems",
                  "BPM",
                  "solutions for communications industry",
                  "ERP",
                  "CRM",
                  "CRM On Demand",
                  "JDE",
                  "Siebel"
              ],
              "industries": [
                  "IT Services and IT Consulting"
              ],
              "locations": [
                  {
                      "city": "Austin",
                      "state": "Texas",
                      "country": "United States"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/oracle",
              "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQHYCgYovUuPtQ/company-logo_400_400/company-logo_400_400/0/1665755678957/oracle_logo?e=1757548800&v=beta&t=FLJW4rq1I6tr3ngbOGJW65rtxxOHwwh6ynxTTDsykV0",
              "website": null,
              "name": "Oracle",
              "employeeCount": 200393,
              "followerCount": 10448723,
              "description": "We’re a cloud technology company that provides organizations around the world with computing infrastructure and software to help them innovate, unlock efficiencies and become more effective. We also created the world’s first – and only – autonomous database to help organize and secure our customers’ data.\n \nOracle Cloud Infrastructure offers higher performance, security, and cost savings. It is designed so businesses can move workloads easily from on-premises systems to the cloud, and between cloud and on-premises and other clouds. Oracle Cloud applications provide business leaders with modern applications that help them innovate, attain sustainable growth, and become more resilient. \n \nThe work we do is not only transforming the world of business--it's helping defend governments, and advance scientific and medical research. From nonprofits to companies of all sizes, millions of people use our tools to streamline supply chains, make HR more human, quickly pivot to a new financial plan, and connect data and people around the world.  \n\nAt work, we embrace diversity, encourage personal and professional growth, and celebrate a global team of passionate people developing innovative technologies that help people and companies tackle real-world problems head-on.\n\nIf you’d like to join us, please visit our Careers page: https://www.oracle.com/corporate/careers/\n\nFor investor news, SEC filings, and financial information about Oracle (NYSE:ORCL), please visit https://investor.oracle.com/home/.\n \nFollow us on X: x.com/oracle \nLike our page on Facebook: facebook.com/Oracle/ \nFollow us on Instagram: instagram.com/oracle/\n"
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 0.2,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0.33,
          "kpi_salary": 0.2,
          "kpi_company_size": 1,
          "kpi_company_popularity": 1,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 0.4,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0.66,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 1,
          "final_score": 0.68,
          "tier": "Yellow"
      },
      {
          "id": "4261686995",
          "title": "Salesforce Quality Assurance (QA) Tester (Secret Clearance)",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4261686995/",
          "postedDate": "2025-07-10T06:12:20.000Z",
          "expireAt": "2025-08-09T06:12:20.000Z",
          "descriptionText": "Salesforce Quality Assurance (QA) Tester(Secret Clearance)\n\nLocation: Remote\n\nThe HigherEchelon Salesforce Division is seeking a detail-oriented and experienced Salesforce Quality Assurance (QA) Tester to join our team. The Salesforce QA Tester will be responsible for ensuring the quality and reliability of Salesforce applications and solutions through comprehensive testing and quality control measures. This role requires strong technical skills, Salesforce knowledge, and a thorough understanding of QA methodologies and best practices.\n\nJob Responsibilities:\n\nDevelop and execute comprehensive test plans, test cases, and test scripts to validate Salesforce functionality, configurations, and customizations.\n\nCollaborate with business stakeholders, developers, and administrators to gather requirements and ensure test coverage aligns with business needs.\n\nConduct functional, integration, system, and regression testing for Salesforce applications, ensuring adherence to established quality standards.\n\nIdentify, document, and track defects and issues using a defect tracking system, and collaborate with technical teams to ensure timely resolution.\n\nCreate and maintain test data and test environments, ensuring accurate and representative test scenarios.\n\nDevelop and maintain automated test scripts and tools to streamline the testing process and improve efficiency.\n\nParticipate in the release management process, including reviewing deployment plans and providing input on the release readiness of Salesforce applications.\n\nCollaborate with cross-functional teams to understand business processes and requirements, ensuring testing aligns with end-to-end business workflows.\n\nContinuously improve QA processes and methodologies, identifying opportunities for optimization and implementing enhancements.\n\nStay updated on Salesforce releases, new features, and industry trends, and assess their impact on QA processes and testing strategies.\n\nProvide feedback and recommendations on user experience, system performance, and overall quality improvements.\n\nRequired Skills:\n\nPreferred public sector experience or multiple Salesforce project implementation experience.\n\nStrong technical expertise in Salesforce platform and applications, with a solid understanding of Salesforce functionalities, configurations, and data models.\n\nExperience in test planning, test case development, and execution for Salesforce projects.\n\nProficient in using QA tools and methodologies, including test management tools, defect tracking systems, and test automation frameworks.\n\nFamiliarity with test automation tools, such as Selenium, Katalon Sutdio, or Salesforce-specific tools like Salesforce DX or Apex Test Classes.\n\nStrong analytical and problem-solving skills, with the ability to troubleshoot complex issues and provide detailed defect reports.\n\nKnowledge of Agile or Scrum methodologies, with experience in working in Agile development teams.\n\nSalesforce certifications (e.g., Salesforce Administrator, Salesforce Certified Platform App Builder) are preferred.\n\nExcellent communication and teamwork skills, with the ability to collaborate effectively with cross-functional teams.\n\nAttention to detail and the ability to work in a fast-paced environment with multiple priorities and deadlines.\n\nMust possess an interim security clearance or higher (e.g., Secret, Top Secret, TS/SCI)\n\nRequired Education and Experience:\n\nBachelor's degree in Computer Science, Information Technology, or a related field.\n\nUS. Citizenship is required\n\nSalesforce certified (Administrator preferred).\n\nCertified DHS OAST Trusted Tester (preferred).\n\nShall have a minimum of four (7) years of general work experience.\n\nExperience testing enterprise software solutions.\n\nShall have three (3) years of experience in troubleshooting software.\n\nShall have experience working in Salesforce and Agile development processes.\n\n#dice\n\n#CJ\n\nAbout HigherEchelon, Inc.\n\nHigherEchelon, Inc. (HE) is a service-disabled veteran owned small business (SDVOSB) with offerings in Salesforce Implementation and Consulting. HigherEchelon aims to be the premier trusted partner in organizational excellence and achieves this through sustained investment in talent and the employee experience. HigherEchelon puts the employee first to better serve customer needs and sustain excellence.\n\nHigherEchelon offers competitive full-time benefits including paid vacation and holidays, 401(k) matching, full health/dental/vision coverage, plus much more. For on-site and remote employees, flexible work schedules are offered when authorized.\n\nBy joining our team, you are choosing to embark on a journey towards excellence as a valued team member and trusted partner. We appreciate your inquiry and look forward to discussing the opportunity further.\n\nEOE/Minorities/Females/Veterans/Disabled:\n\nHigherEchelon, Inc. is an Equal Employment Opportunity employer and provides reasonable accommodation for qualified individuals with disabilities and disabled veterans in its job application procedures.\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, genetic information, citizenship, ancestry, marital status, protected veteran status, disability status or any other status protected by federal, state, or local law. HigherEchelon, Inc. participates in E-Verify.",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": null,
          "applicants": 2,
          "views": 9,
          "jobApplicationLimitReached": false,
          "applyMethod": "https://click.appcast.io/t/LbkVoVVo32_0rZMWyFHuDphEikCgBrC6xX7Jy90bfsM=",
          "salary": null,
          "company": {
              "specialities": [],
              "industries": [
                  "Software Development"
              ],
              "locations": [],
              "linkedinUrl": "https://www.linkedin.com/company/jobs-via-dice",
              "logo": "https://media.licdn.com/dms/image/v2/D560BAQFwOT1y-MRTFQ/company-logo_400_400/B56ZVEKZkcHsAY-/0/1740605332130/jobs_via_dice_logo?e=1757548800&v=beta&t=05YBF1qiLGIEAs-I6J8MxBWFoE_rvaioKS7GrwolE_I",
              "website": null,
              "name": "Jobs via Dice",
              "employeeCount": 10,
              "followerCount": 50045,
              "description": "Welcome to Jobs via Dice, the go-to destination for discovering the tech jobs you want.\n\nThis page is dedicated to sharing job opportunities with tech professionals at every stage of their careers. When you see a job posted by Jobs via Dice, it’s a job for one of our many clients seeking to hire tech professionals like you.\n\nAt Dice, we understand that your career in technology is more than just a job; it’s a journey of growth, innovation and continuous learning. Stay connected with us to explore the latest job opportunities, industry trends and career tips tailored for tech professionals. Your future in tech starts here.\n\nWhat You’ll Find on Dice.com:\n\nTailored Tech Opportunities - Connect with the right tech companies and roles that match your skills and ambitions. Whether you're looking to land your first job or elevate your career, Dice is here to help.\n\nCareer Resources - Utilize our tools to build your skills, enhance your visibility, and get noticed by top employers.\n\nEasy Apply - Find and apply to your perfect tech role in just a few clicks with our Easy Apply feature. Simplify your job search and get hired faster.\n\nIndustry Insights - Stay ahead with our expert career advice and industry insights. From resume tips to interview prep, we provide the resources you need to succeed.\n\nEmployer Profiles - Get a firsthand look at a company’s culture to make informed decisions about where you want to work.\n\nJoin the community of tech professionals who trust Dice to help them find and apply to their next job in tech.\n\nTo follow our company page on LinkedIn, visit: https://www.linkedin.com/company/dice\n"
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 0.5,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0,
          "kpi_salary": 0.5,
          "kpi_company_size": 0.2,
          "kpi_company_popularity": 0.75,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 0.2,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 0.5,
          "final_score": 0.54,
          "tier": "Yellow"
      },
      {
          "id": "4261603978",
          "title": "QA Tester Lead SME – Facets Testing",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4261603978/",
          "postedDate": "2025-07-09T23:57:31.000Z",
          "expireAt": "2025-08-08T23:57:31.000Z",
          "descriptionText": "Job Title: QA Tester Lead SME – Facets TestingLocation: RemoteJob Type: Full-Time | Senior-Level | Consulting Leadership Role\n\nDuration: End of Year\n\nStart: Beginning of Aug 2025\n\nNO H1B or 3rd Party Vendors\n\nMUST HAVE EXCELLENT COMMUNICATION AND COMMAND OF THE ENGLISH LANGUAGE.\n\nAXIOM Systems is seeking a highly experienced QA Leader (Manager/Director level) to serve as a QA Tester Lead SME with a specialized focus on Facets Testing, working with all levels of management, leading testing teams and experience within large Health plans for Medicare and Medicaid LOBs. This strategic role combines manual and performance testing expertise with senior-level management, offering the opportunity to lead testing teams, drive QA strategy, and consult with executive stakeholders on quality initiatives in the health plan space.\n\nThe ideal candidate brings a comprehensive understanding of the health plan domain, strong leadership in QA best practices across all levels of testing, and the ability to guide clients toward successful outcomes through clear, executive-level communication and presentation.\n\nKey Responsibilities:\n\nLead and oversee end-to-end QA efforts, including functional, regression, UAT, integration, and system testing, for Facets systems involving Medicare/Medicaid. Manage QA teams and provide strategic direction, performance oversight, and resource planning to ensure quality objectives are met. Act as a trusted QA consultant, interfacing regularly with executives, program managers, and stakeholders, presenting testing strategies, results, risks, and solutions with clarity and confidence. Develop and enforce QA processes, standards, and best practices to ensure scalable and repeatable testing frameworks. Provide mentorship and training to QA staff while fostering a culture of quality, accountability, and continuous improvement. Collaborate with business and IT leadership to align QA strategies with overall project goals and compliance requirements. \n\nRequired Qualifications:\n\n10+ years of experience in Quality Assurance, with at least 5+ years in a QA Manager or Director role within the healthcare industry. Minimum 3 years of direct Facets experience within large healthplans. Minimum 3 years experience testing Medicare and Medicaid claims. Proven experience leading multi-disciplinary QA teams across complex healthcare implementations. Deep understanding of the entire healthcare lifecycle, including claims, enrollment, provider, encounter, and regulatory testing. Extensive background in manual and performance testing with the ability to design strategic test plans and lead defect triage and resolution processes. Strong consulting presence, with demonstrated ability to present to executive leadership and translate technical findings into business value. Excellent organizational, analytical, and interpersonal communication skills.",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": null,
          "applicants": 18,
          "views": 64,
          "jobApplicationLimitReached": false,
          "applyMethod": "https://easyapply.co/a/8a300640-a835-4f74-9462-6de7e39ba065",
          "salary": null,
          "company": {
              "specialities": [
                  "Healthcare Consulting",
                  "HealthCare IT Consulting",
                  "Project Management",
                  "Systems Implementation",
                  "System Integration",
                  "IT Staffing",
                  "HIPAA EDI Transaction Management",
                  "HIPAA EDI Gateway Products",
                  "Network Service Vendor",
                  "Electronic Medical Claims Creation",
                  "Healthcare Core Processing Systems Expertise",
                  "Application Configuration"
              ],
              "industries": [
                  "IT Services and IT Consulting"
              ],
              "locations": [
                  {
                      "city": "Frederick",
                      "state": "Maryland",
                      "country": "United States"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/axiom-systems",
              "logo": "https://media.licdn.com/dms/image/v2/D560BAQESGEyvoOOEeA/company-logo_400_400/company-logo_400_400/0/1729283243453/axiom_systems_logo?e=1757548800&v=beta&t=-MaLVnqf__M5vEOV6itHBEIkmUER-6hHVar3wOeuuy4",
              "website": null,
              "name": "AXIOM Systems, Inc.",
              "employeeCount": 113,
              "followerCount": 3565,
              "description": "AXIOM Systems, Inc. was founded in 1996 with the idea that a dedicated group of Healthcare technology professionals could thrive by providing exemplary services and deliver demonstrable value to Healthcare Payers.  Today AXIOM Systems is proud to have earned the moniker, The Healthcare IT Industry Experts, and has won the trust and respect of thousands of satisfied clients.\n\nOur services and products are driven by our extensive knowledge of healthcare and a detailed understanding of the regulatory and technology issues that drive business and information technology initiatives. Our clients are healthcare organizations operating varying lines of business and include Blue Cross and Blue Shield plans, regional and national Payer organizations, PPO’s, TPA's, carve-outs, specialty firms, providers, billing services, hospitals, and leading industry software vendors.\n\nOur extremely dedicated employees average over 15 years of healthcare technology experience which results in extraordinary client loyalty and repeat business. Our products have a strong and loyal install base, and deliver an industry leading return on investment. By leveraging the transaction sets which drive our clients business our products enhance Provider and Employer Group satisfaction while delivering operational efficiencies, making the promises of HIPAA a reality.\n\nPlease take the time to browse our entire site at www.axiom-systems.com in order to learn more about how our services and products can assist you and your organization, or to see if your skills and dedication make you an ideal candidate to join the 'AXIOM Family'​. \n\nIf you have any further questions regarding our services or products, please feel free to contact us at 301-815-5220."
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 1,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0,
          "kpi_salary": 0.5,
          "kpi_company_size": 0.5,
          "kpi_company_popularity": 0.5,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 0.2,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 1,
          "final_score": 0.61,
          "tier": "Yellow"
      },
      {
          "id": "4264052220",
          "title": "Senior QA Automation Engineer",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4264052220/",
          "postedDate": "2025-07-10T05:37:27.000Z",
          "expireAt": "2025-08-09T05:29:25.000Z",
          "descriptionText": "You’re more valuable than ever – And that’s just how we’ll make you feel.\n\nJob Summary\n\nDoes this mistake drive you crazy? If you can't let go of errors like that, you might be just right to join our team. As a Senior Software Tester and Automation Engineer on our development team at GoHealth, you'll play a critical role in ensuring that our software delivers on our promise of an effortless experience. These detail-oriented perfectionists test our software from a patient and medical professional's perspective to make sure it's efficient and intuitive. This position will be responsible for design, architecture, and implementation of complete solutions to testing software and quality assurance of GoHealth Urgent Care online web applications and back-end services. Design and develop test automation solutions using Selenium, Playwright, Web driver IO and other technologies determined to best suit our needs. This position will play a key role in developing patient, provider, and staff facing web applications to achieve outcomes such as allowing a patient to complete their demographic and insurance details an efficient and secure manner and feed the information into the electronic medical record system. The role will require collaboration with diverse roles including software developers, physicians, operations staff, as well as others within the IT team. It will require excellent problem-solving skills to anticipate and solve for complexities before software deployment/launch.\n\nJob Requirements\n\nEducation\n\n8 +year bachelor’s degree or greater required (or equivalent experience)\n\nWork Experience\n\n8+ years of experience in testing complex web/cloud-based applications.\n\n8+ years of software automation experience in web/cloud applications, and platforms\n\nExperience developing and executing manual and automated test suites based on engineering and customer specifications.\n\nStrong proficiency in Playwright and Knowledge of WebDriver IO.\n\nExperience in developing Automation framework and script development.\n\nExperience with software development life cycle concepts and software testing methodologies.\n\nDevelop automation test cases and execute them in support of user stories planned for the sprint.\n\nExcellent verbal and written communication skills\n\nStrong debugging and troubleshooting skills.\n\nStrong technical problem-solving skills and ability to work independently to investigate software defects.\n\nExpertise in API testing with tools like JMeter, K6 and SOAP UI.\n\nReview security documentation with developers to mitigate vulnerability findings.\n\nExperience in ADA testing with JAWS, NVIDIA and Wave.\n\nWorking experience with Browser stack or similar cross platform testing tools\n\nExpose to technologies like Docker, CI pipelines with tools like GitHub, Gitlab etc.\n\nHealthcare related experience such as with eClinicalWorks, Epic or HL7 integration\n\nKnowledge of healthcare business processes\n\nExperience with cloud computing resources such as Microsoft Azure.\n\nFollowing Are The Essential Functions Of The Job.\n\n Define testing strategy including specifications, write testing scripts and make estimations about efforts. Write test scripts and perform tests on scrum items, both manually and by automation Design and develop test automations to optimize the testing solutions and help with selection of appropriate automation tools when necessary. Provide technical support and strategic recommendations in software testing and automation for all systems. Design and develop clear, concise, comprehensive test plans and test cases for web applications, mobile applications, REST APIs, communications paths at the component level as well as at the system level. Detail oriented to capture as much information both in test case writing and in test case execution as needed to present clear results to developers and other key stakeholders. Diligence and attention to detail in documenting test cases and results. Ability to investigate/troubleshoot to why something might not be working correctly in the software to help assist the software developers in correcting a defect. Interact with software development engineers with respect to learning new functionality being built, requesting new builds to validate defect fixes. Ability to quickly learn about new technologies and apply that knowledge to find inconsistencies and issues with their implementations Demonstrate strong multitasking and problem-solving skills to identify errors in software. Self-motivated, detail-oriented and organized\n\nSet up email alerts as new job postings become available that meet your interest!\n\nAll qualified persons are granted an equal opportunity for employment without regard to race, color, religion, sex, sexual orientation and gender identity or expression, age, national origin, citizenship status, disability, genetic information, medical condition, family care leave status, pregnancy or pregnancy-related condition, otherwise qualified disabled or veteran status. The company will comply with all fair employment laws in each of the jurisdictions where we conduct business.\n\nFor applicants in California, please review our California Consumer Privacy Statement here. https://www.gohealthuc.com/privacy-policy",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": null,
          "applicants": 20,
          "views": 43,
          "jobApplicationLimitReached": false,
          "applyMethod": "https://gohealthuc.wd12.myworkdayjobs.com/External/job/Remote/Senior-QA-Automation-Engineer_JR104389?source=LinkedIn",
          "salary": null,
          "company": {
              "specialities": [
                  "Treatment of minor injuries",
                  "treatment of minor illnesses",
                  "laboratory services",
                  "diagnostic x-ray services",
                  "vaccinations",
                  "physical exams",
                  "treatment of work related injuries",
                  "occupational health services",
                  "behavioral health",
                  "urgent care",
                  "on demand care"
              ],
              "industries": [
                  "Hospitals and Health Care"
              ],
              "locations": [
                  {
                      "city": "Atlanta",
                      "state": "Georgia",
                      "country": "United States"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/gohealth-urgent-care",
              "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQEHOWey3lXQjg/company-logo_400_400/B4EZfHVLvCGcAc-/0/1751395908836/gohealth_urgent_care_logo?e=1757548800&v=beta&t=8G8WkxDZcfPSqDj660OBACpELwWRiO9MAcQMOrdDvO4",
              "website": null,
              "name": "GoHealth Urgent Care",
              "employeeCount": 1464,
              "followerCount": 14288,
              "description": "GoHealth partners with innovative and award-winning health systems to simplify and improve the way customers across the U.S. access high-quality healthcare for non-life-threatening conditions. Its on-demand care platform serves as the physical- and digital-front door to its 12 prominent health system partners and the communities they serve across 16 states, providing seamless access to care for more than 50% of Americans. GoHealth’s unique partnership model, consumer-centric approach and technology focus enables effortless, personalized, and connected on-demand care at nearly 400 co-branded neighborhood centers across the nation. Whenever follow-up treatment is needed, GoHealth’s connected care model provides customers with seamless same- and next-day access to robust networks of expert primary, specialty, and emergency care providers. GoHealth is committed to increasing access to quality care across the country, expanding inclusivity and removing barriers to wellness for all people.  "
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 1,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0,
          "kpi_salary": 0.5,
          "kpi_company_size": 0.8,
          "kpi_company_popularity": 0.6,
          "kpi_industry_match": 0,
          "kpi_job_popularity": 0.2,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0.33,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 1,
          "final_score": 0.64,
          "tier": "Yellow"
      },
      {
          "id": "4261183827",
          "title": "Quality Assurance Analyst",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4261183827/",
          "postedDate": "2025-07-09T21:43:18.000Z",
          "expireAt": "2025-08-08T21:43:17.000Z",
          "descriptionText": "HighlightTA is the on-demand talent team for Neon One.\n\nAbout Neon OneAt Neon One, we believe that technology is the key to building vibrant communities of generosity. As a leader in nonprofit software since 2004, we create intuitive solutions that help small and mid-sized nonprofits connect with people, build trust, and make good happen every day.Our culture is powered by empathy, innovation, and a shared mission to empower organizations making a difference. We operate with a customer-first mindset, take pride in extraordinary results, and grow together by supporting each other and embracing bold new ideas. If you’re passionate about using your skills to drive real impact and want to thrive in a collaborative, fully remote environment, Neon One is the place for you\n.\nAbout the Role:The Quality Assurance Analyst plays a crucial role in ensuring that our products meet the highest quality standards before they reach our customers. This position involves developing and executing test plans, identifying defects, and collaborating with cross-functional teams to enhance product quality. The analyst will be responsible for analyzing requirements and specifications to create comprehensive test cases that cover all aspects of functionality.By implementing best practices in quality assurance, the analyst will contribute to continuous improvement initiatives within the organization. Ultimately, the goal is to deliver a seamless user experience and maintain customer satisfaction through rigorous testing and quality control processe\ns.\nResponsibilities:Develop and execute detailed test plans and test cases based on product requirements and specifications.Identify, document, and track defects using appropriate tools, ensuring timely resolution and retesting.Collaborate with developers, product managers, and other stakeholders to understand product features and provide feedback on quality.Perform regression testing to ensure that new code changes do not adversely affect existing functionality.Participate in quality assurance meetings and contribute to the development of best practices and testing methodologi\nes.Requirements:Bachelor's degree in Computer Science, Information Technology, or a related field.Proven experience in software quality assurance and testing methodologies.Familiarity with automated testing tools and frameworks.Attention to detail for identifying defects and ensuring that all aspects of the product are thoroughly tested.Strong communication skills to facilitate collaboration with team members and stakeholders, allowing for a clear understanding of product requirements.Familiarity with automated testing tools to enhance efficiency and accuracy in the testing proce\nss.\nPreferred Skills and Attributes:Certification in Quality Assurance (e.g., ISTQB, CSTE) is a plus.Experience with Agile development methodologies.Knowledge of programming languages such as Java, Cypress, Python, or JavaScr\nipt.\nWhy Join Neon One?At Neon One, our values aren’t just words - they’re how we show up every day. We make good happen by putting empathy and passion at the center of our work, using technology to uplift mission-driven organizations. We stand for our customers, acting with care and intention in every decision. We own the solution, rolling up our sleeves to meet challenges head-on, and we grow together, valuing inclusivity, collaboration, and progress over perfection. We also innovate fearlessly, always exploring new ways to support our community and each other.If you’re energized by purpose-driven work and ready to thrive in a remote, people-first environment, we’d love to connect with\n you.\nBenefits and MoreOur people are at their best when they are happy, healthy, and have the resources and support they need.Unlimited paid time off.Comprehensive health plans (medical, dental, vision).401(k) with up to 3.5% company match.Paid parental leave after one year.Company-paid life insurance and long-term disability.Pet insurance.11 company holidays.Paid sick time and a monthly paid volunteer dayMedical and dependent care flexible spending accountsCommuter benefits, identity theft protectionFully remote wor\nkplace\nHow We Hire (and How We Use AI):We use AI tools to support our recruitment process, including helping us organize applications and identify early matches based on role criteria. That said, every rejection decision is made by a human. We encourage candidates to apply authentically and avoid relying solely on AI-generated responses, especially during interviews. We want to get to know you, not C\nhatGPT.\nThis opportunity is offered through HighlightTA, the on-demand talent team supporting Neon One’s growth.Connect with us and learn more:Neon One on LinkedInHighlightTA on LinkedIn",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": null,
          "applicants": 248,
          "views": 741,
          "jobApplicationLimitReached": false,
          "applyMethod": "https://jobs.ashbyhq.com/HighlightTA/d01ada37-019c-48ce-9dd5-332ea6aa7ec7?utm_source=Linkedin",
          "salary": "70,000 - 70,000 USD",
          "company": {
              "specialities": [
                  "Recruitment",
                  "Headhunting",
                  "Consulting",
                  "Embedded Recruitment",
                  "RPO",
                  "Technical Recruitment",
                  "HR Consulting",
                  "Embedded Talent Solutions",
                  "Talent Attraction",
                  "Employer Branding",
                  "People Operations"
              ],
              "industries": [
                  "Human Resources Services"
              ],
              "locations": [
                  {
                      "city": "Toronto",
                      "state": "Ontario",
                      "country": "Canada"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/highlightta",
              "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQGpYvCkYoTVXg/company-logo_400_400/company-logo_400_400/0/1719945822465?e=1757548800&v=beta&t=DrlNKtUD-m2nY9wV4Ln2Nxc37_R32Xja6bu8mVP8wCc",
              "website": null,
              "name": "HighlightTA",
              "employeeCount": 8,
              "followerCount": 1175,
              "description": "At HighlightTA, we simplify hiring by embedding talent partners into your team, leading recruitment projects, or managing your entire talent function. Our flexible, on-demand solutions let you scale up or down as needed, without long-term commitments or high agency fees. With decades of experience, our data-driven approach ensures fast access to top-tier talent, saving you time and reducing costs. Whether it's integrating talent partners, overseeing recruitment functions, or delivering one-off projects through our ProjectTA service, we tailor our solutions to meet your specific business needs. Ready to build exceptional teams? Let's connect."
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 1,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0,
          "kpi_salary": 0.4,
          "kpi_company_size": 0.2,
          "kpi_company_popularity": 0.5,
          "kpi_industry_match": 0,
          "kpi_job_popularity": 0.4,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 1,
          "final_score": 0.57,
          "tier": "Yellow"
      },
      {
          "id": "4261199459",
          "title": "Senior QA Engineer",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4261199459/",
          "postedDate": "2025-07-09T23:17:36.000Z",
          "expireAt": "2025-08-08T23:17:36.000Z",
          "descriptionText": "Company Description:\n\nRewst is a tool designed for Managed Service Providers (MSPs) to streamline and automate their processes, saving valuable time and effort. Our platform helps MSPs achieve big automation wins, resulting in increased productivity and efficiency. We value the flexibility of remote work and enjoy opportunities to collaborate in person on occasion.\n\nJob Overview:\n\nWe’re looking for a proactive and experienced Senior QA Engineer to take ownership of quality assurance on a dedicated project squad. In this role, you’ll be the primary QA resource, responsible for driving test strategy, executing test plans, and collaborating closely with developers and product managers to ensure a high-quality product. While your main focus will be leading QA efforts for your assigned team, you’ll also be expected to flexibly support other teams as needed based on shifting priorities and business goals.\n\nKey Responsibilities:\n\nServe as the primary QA point of contact for a dedicated cross-functional project squad. Test new integrations with third-party vendors and ensure seamless functionality. Conduct functional, regression, and exploratory testing for new features and bug fixes across different platforms. Identify, document, and track bugs and issues found during testing in Shortcut or other tracking tools. Work closely with development teams to ensure timely bug resolution. Collaborate with the product team during the planning process to ensure upcoming changes are testable and meet quality standards. Assist in developing and maintaining test plans and test cases for different projects. Contribute to the development of automated tests as part of a growing automation initiative. Provide feedback on testing strategies, tools, and best practices to improve overall QA processes. Contribute to the team's ongoing automation efforts by identifying high-value test cases for automation, maintaining existing scripts, and collaborating with our Automation Architect to expand automated coverage. Lead QA-side root cause analysis (RCA) for bugs that reach production by reproducing issues, identifying testing gaps, and implementing process or test improvements to prevent recurrence. Test from the perspective of the end user to identify usability issues and provide thoughtful feedback to the product team aimed at improving the overall customer experience. Step into multiple QA roles as needed, whether that means jumping in on another team, helping triage production issues, or supporting cross-functional testing efforts. Operate with a high level of autonomy—able to navigate ambiguity, make informed decisions, and keep momentum without needing constant direction. \n\nRequired Skills and Qualifications:\n\n5-7+ years of experience as a QA Engineer in an Agile environment. Experience with manual and automation testing of web applications, SaaS platforms, and third-party integrations. Strong understanding of software testing methodologies, tools, and processes. Experience with writing test plans, test cases, and executing structured testing efforts. Familiarity with bug tracking and test management tools (e.g., Shortcut, Jira, TestRail). Knowledge of APIs, content formats (JSON, XML), and API testing tools (e.g., Postman). Ability to adapt quickly to different teams and projects, demonstrating strong problem-solving skills. Proven ability to take initiative and identify opportunities for improvement or contribution without needing direction. Strong communication skills with a willingness to voice ideas, concerns, and constructive feedback to influence product quality and team processes. Comfortable working in a fast-paced startup environment with the adaptability, energy, and engagement to keep up with shifting priorities. \n\nAbove & Beyond:\n\nExperience with automated testing frameworks such as Playwright, Selenium, or similar. Experience with API testing and automation. Previous experience in a Robotic Process Automation (RPA) company or low-code/no-code platform. Experience integrating automated tests with CI/CD tools like Jenkins, GitLab CI, or CircleCI. \n\nWhy Join Us: \n\nOpportunity to make a significant impact in a fast-growing startup environmentCollaborative and inclusive culture that values creativity, diversity, and innovation Competitive compensation package, including equity options and benefitsFlexible work arrangements and a supportive work-life balance\n\nCompensation Range: $125K - $135K\n\n",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": null,
          "applicants": 131,
          "views": 267,
          "jobApplicationLimitReached": false,
          "applyMethod": "https://jobs.ashbyhq.com/rewst/cd8227c5-6f10-447d-9819-249257c1edde/application?utm_source=jy8YWA4JEd",
          "salary": "125,000 - 135,000 USD",
          "company": {
              "specialities": [],
              "industries": [
                  "Software Development"
              ],
              "locations": [
                  {
                      "city": "Tampa",
                      "state": "Florida",
                      "country": "United States"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/rewst",
              "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQFPHYXjhmQCKQ/company-logo_400_400/B4EZfB9hL6HIAY-/0/1751305819164/rewst_logo?e=1757548800&v=beta&t=dYXp2jqmNDIMPWbS5EM6n2w3MpuVmb2fFnnkMh45dyg",
              "website": null,
              "name": "Rewst",
              "employeeCount": 134,
              "followerCount": 10084,
              "description": "A tool for MSPs who have been hunting and pecking for their big automation wins – saving bushels of brain cycles."
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 1,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0,
          "kpi_salary": 0.6,
          "kpi_company_size": 0.5,
          "kpi_company_popularity": 0.6,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 0.2,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 1,
          "final_score": 0.62,
          "tier": "Yellow"
      },
      {
          "id": "4264830686",
          "title": "Senior/lead Front End Developer - Remote",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4264830686/",
          "postedDate": "2025-07-10T08:58:22.000Z",
          "expireAt": "2025-07-22T00:10:07.000Z",
          "descriptionText": "About\n\nOur client is a market-leading startup. They are the only company currently able to provide a full AI-driven solution to their market. They are looking for a Senior/Lead Front End Developer to join their UK remote team. The focus of the role will be to work with iOS and Android Devs and help get their code into the React Native application. They should have previously managed Developers and have good communication and leadership skills.\n\nHere are the requirements for a Senior/Lead Front End Developer.\n\nKey Responsibilities:\n\n Develop, test, and maintain software applications using React, React Native, and related technologies. Troubleshoot, debug, and optimise applications to ensure performance and reliability. Write clean, scalable, and efficient code following industry best practices. Build responsive and performant web applications. Manage and direct Senior Developers\n\nMobile Development\n\nCore Technical Skills Required:\n\nSkilled in React Native for developing cross-platform mobile applications. Advanced proficiency in TypeScript and JavaScript to ensure robust, type-safe, and maintainable code. Experience with Expo \n\nState Management\n\nFamiliarity with Redux, MobX, or other state management libraries for scalable mobile applications.\n\nFrontend Development\n\nProficient in React, TypeScript, JavaScript, and NextJS. Experienced in building responsive and performant web applications. Node.js for microservices \n\nDesirable\n\nAzure and CI/CD\n\nALL APPLICANTS MUST BE FREE TO WORK IN THE UK Exposed Solutions is acting as an employment agency to this client. Please note that no terminology in this advert is intended to discriminate on any grounds, and we confirm that we will gladly accept applications from any person for this role\n\nNice-to-have skills\n\nReactReact NativeTypeScriptJavaScriptReduxNode.JSAzureHermiston, Oregon\n\nWork experience\n\nFrontendMobileFullstack\n\nLanguages\n\nEnglish",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": null,
          "applicants": 1,
          "views": 12,
          "jobApplicationLimitReached": false,
          "applyMethod": "https://tietalent.com/en/jobs/p-669762/hermiston-seniorlead-front-end-developer-remote",
          "salary": null,
          "company": {
              "specialities": [
                  "Recrutement",
                  "Marketplace",
                  "Jobs",
                  "Talent match",
                  "Talent matching services",
                  "recruitment services ",
                  "Talent Magnet "
              ],
              "industries": [
                  "Software Development"
              ],
              "locations": [
                  {
                      "city": "Renens",
                      "state": "Vaud",
                      "country": "Switzerland"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/tietalent",
              "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQFEl92phgHiqQ/company-logo_400_400/company-logo_400_400/0/1704358607143/tietalent_logo?e=1757548800&v=beta&t=nCp85q83Wkrb5PdVK4v577cq_oiJwMq1zgCzRjnKgHI",
              "website": null,
              "name": "TieTalent",
              "employeeCount": 25,
              "followerCount": 84454,
              "description": "TieTalent is the career growth platform designed for tech professionals, connecting talents with top companies worldwide.\n\nBy joining our community, talents gain access to a complete overview of the job market and exclusive career resources. We offer two ways to find your next opportunity:\n\n✅ Let Job Opportunities Discover You – Create your profile, and our intelligent system matches you with job openings that align with your skills and career goals. Companies apply to you, and you decide which opportunities to explore.\n\n🔍 Explore External Job Listings – Discover a broad range of job openings from multiple sources. Think of TieTalent as the \"Kayak\" for jobs: we show you opportunities across various platforms, and when you show interest in an external listing, you’ll be redirected to apply directly through the respective site.\n\nFor companies, TieTalent provides a smart hiring platform that makes finding top tech talent fast and hassle-free. Our AI-powered system, combined with expert insights, connects businesses with 100K+ vetted professionals in IT, tech, AI, marketing, and sales—helping you hire the right talent quickly and efficiently.\n\nSince launching in October 2018, TieTalent has been trusted by hundreds of thousands of tech professionals and thousands of companies—from innovative startups to leading global enterprises.\n\n👉 Join us and be part of the future of tech recruitment.\n\n📜 Imprint & Terms & Conditions: https://tietalent.com/en/terms-and-conditions"
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 1,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0,
          "kpi_salary": 0.5,
          "kpi_company_size": 0.3,
          "kpi_company_popularity": 0.75,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 0.2,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 1,
          "final_score": 0.61,
          "tier": "Yellow"
      },
      {
          "id": "4259442455",
          "title": "Senior Ruby on Rails Developer | Full-Time, Permanent | 100% Remote Opportunity",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4259442455/",
          "postedDate": "2025-07-10T10:34:31.000Z",
          "expireAt": "2025-12-27T12:53:12.000Z",
          "descriptionText": "Integris Group is partnering with a top-tier client seeking an experienced Senior Ruby on Rails Developer for an immediate, full-time opportunity.\nIn this role, you’ll play a key part in driving the evolution of our client’s customer portal—enhancing existing functionality, envisioning innovative new features, and launching new projects aligned with their strategic roadmap.\nThis is an exciting opportunity for someone who is:Passionate about crafting exceptional user experiencesEager to apply their technical expertise in a greenfield environmentMotivated to be an early contributor to a growing team that will play a central role in our client’s long-term success\nTech Stack: Our clients current tools and technologies include:Ruby on Rails, PostgreSQL, Tailwind CSS, Hotwire, Svelte, Heroku, and Salesforce\nWhat You’ll Be Doing:Collaborate closely with the Product Manager and fellow engineers to shape and deliver the product roadmap.Own end-to-end feature development—from design through deployment and beyond—shipping frequently to gather actionable feedback.Help shape and scale the Engineering team, setting culture, best practices, and technical standards.Contribute across the full stack: backend, frontend, and DevOps\nWhat We’re Looking For:Deep experience with Ruby on Rails.Proficiency with component-based JavaScript frameworks (e.g., React, Svelte, or Vue)Solid understanding of cloud-native architecture, ideally on Heroku or similar platforms.Strong experience integrating with APIs.A passion for creating smooth, intuitive, and delightful user experiences.\nBonus Points For, NOT a must have:Experience with consumer-facing applications at scale (tens of thousands of users).Familiarity with Salesforce (development or APIs).Working with PDF/image data extraction tools.Interest or hands-on experimentation with Generative AI.",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": "https://www.linkedin.com/job-apply/4259442455",
          "applicants": 499,
          "views": 1254,
          "jobApplicationLimitReached": false,
          "applyMethod": null,
          "salary": "140,000 - 190,000 USD",
          "company": {
              "specialities": [],
              "industries": [
                  "IT Services and IT Consulting"
              ],
              "locations": [
                  {
                      "city": "Orlando",
                      "state": "Florida",
                      "country": "United States"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/integris-group",
              "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQE-6gFnyt8aDA/company-logo_400_400/company-logo_400_400/0/1630461911400?e=1757548800&v=beta&t=_AddU7YlB1VFDSoa72JoHWTg53Fz1ODlQaIEc7NRWyM",
              "website": null,
              "name": "Integris Group",
              "employeeCount": 165,
              "followerCount": 43520,
              "description": "Your Trusted Partner in IT Innovation\n\nIntegris Group empowers organizations to overcome complex IT and digital challenges with solutions tailored to their unique needs. Headquartered in Orlando, FL, our leadership team brings over 100 years of combined experience helping startups and Fortune 50 companies achieve their goals through innovative strategies and seamless execution.\n\nWe’re proud to be: \n\n➝ Recognized as a Great Place to Work: Ranked as a 2023/2024 “Great Place to Work,” reflecting our commitment to creating a thriving, inclusive workplace for our team.\n\n➝ Customer-Centric and Flexible: Every solution we design is driven by your success.\n\n➝ Globally Connected: With our \"Follow the Sun\" approach, we provide round-the-clock support to maximize productivity and efficiency. Nearshore center of excellence\n\n➝ Trusted Partners/World-Class Brand: Our 99% customer retention rate speaks volumes about the relationships we build."
          },
          "kpi_jd_quality": 0.8,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 1,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0,
          "kpi_salary": 0.8,
          "kpi_company_size": 0.5,
          "kpi_company_popularity": 0.6,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 0.6,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 1,
          "final_score": 0.65,
          "tier": "Yellow"
      },
      {
          "id": "4264307120",
          "title": "Technical Co-Founder",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4264307120/",
          "postedDate": "2025-07-10T08:47:29.000Z",
          "expireAt": "2026-01-06T08:47:29.000Z",
          "descriptionText": "Location: Remote (Canada/US preferred)Commitment: Full-time | Co-Founder Equity | Ongoing Interviews\nAbout Tochi ExchangeAt Tochi Exchange, we’re building what doesn’t exist yet: a modern real estate trading platform that makes property markets as fast, seamless, and transparent as capital and equity markets.We believe housing inefficiency isn’t a policy failure — it’s a technology gap. We’re a remote-first, technical-only firm solving real estate’s structural frictions with modern infrastructure and an AI-driven development culture. This is pure 0→1 — no legacy baggage, no templates — just first principles and bold execution.\nResponsibilitiesArchitect, build, and scale the core trading platform — secure workflows, liquidity rails, and real estate transaction orchestration.\nDesign, implement, and manage modern CI/CD pipelines, environments, and cloud instances to ensure robust deployments and high availability.\nIntegrate and maintain secure payments, KYC/AML, and third-party services (Plaid, Shippo, Stripe, etc.).\nLeverage Supabase’s full stack: Supabase: Auth, Realtime, Storage, Functions, Edge APIs, Postgres]\nUse and promote advanced AI tools (Cursor, Lovable, Claude Code, GPT-4o, etc.) in daily dev workflows to maximize speed and quality.\nBuild and lead a high-caliber engineering team — recruit top builders, mentor them, and design a culture that motivates and inspires people to tackle ambitious, long-horizon work.\nFoster a transparent, ownership-driven environment with zero politics — a place where builders do their best work.\nContribute actively to product vision, fundraising conversations, and investor due diligence.\nChampion best practices that balance rapid prototyping with long-term scalability — manage technical debt before it scales.\nQualificationsProven experience building and deploying secure, production-grade systems in modern stacks:\nTypeScript, GraphQL, Supabase (Auth, Storage, Realtime DB, Edge Functions, Postgres), Cloudflare Workers, or equivalents.\nDeep understanding of payments, KYC/AML, and secure transaction workflows.\nPractical experience designing and maintaining CI/CD pipelines, orchestrating cloud deployments, and optimizing instances for uptime, cost, and scalability.\nFluent daily use of top AI coding tools — mandatory.\nTrack record of building and leading technical teams, shaping culture, and creating environments that motivate ambitious builders.\nClear grasp of how to identify, prevent, and pay down technical debt before it becomes a drag.Hands-on, decisive, and comfortable balancing speed with system integrity.\nBackground in software engineering, data science, PropTech, finance, economics, or any relevant overlap.\nAligned with American dynamism — a belief that tech should solve real structural problems at scale.\nReady for a long-term mission — humble enough to navigate uncertainty for years, not months.\nBefore You ApplyRead our whitepaper at https://preview--tochi-exchange.lovable.app/whitepaper.pdf. We expect every applicant to understand the market, the problem we’re solving, and Tochi’s approach to unlocking liquidity in real estate.\n📄 Personal Essay RequirementAs part of your application, please submit a short personal essay (500–700 words) that helps us understand who you are beyond your resume. This is your chance to share your story, reflect on your values, and tell us what drives you to build things that matter.\nPrompt (Choose One):Share a personal experience that shaped who you are today. How did it influence your values, mindset, or approach to work?Reflect on a challenge or setback you’ve faced. How did you respond, and what did you learn?Talk about something you’re deeply passionate about. Why does it matter to you, and how does it show up in your life or work?\nWhitepaper Reflection:In addition to your chosen prompt, include a short section with any thoughts, questions, ideas, tangents, or suggestions you have after reading our whitepaper. We want to see how you think — what stands out to you, what you’d challenge, and what you’d build on.\nWhat Makes a Strong Essay:Authentic: Speak in your real voice — no corporate polish needed.Reflective: Go beyond telling a story — show what you learned and how you’ve grown.Personal: Focus on you — not what you think we want to hear.Well-structured: Tell a clear, thoughtful story — informal is fine, sloppy isn’t.\nWhy We Ask for This:The best teams aren’t built on credentials alone. They’re built on people who care deeply, think critically, and bring unique perspectives to hard problems. This essay helps us see how you’ll shape our culture — not just with your skills, but with your mind.\nThis post stays up. We’re always searching for our next Avengers-level builder. If you see the future as we do, please reach out to us here on LinkedIn or at contact@tochiexchange.com. Let’s fix housing markets at the foundation — with real technology, for real people.",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": null,
          "applicants": 1,
          "views": 22,
          "jobApplicationLimitReached": false,
          "applyMethod": null,
          "salary": null,
          "company": {
              "specialities": [],
              "industries": [
                  "Software Development"
              ],
              "locations": [
                  {
                      "city": null,
                      "state": null,
                      "country": "United States"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/tochi-exchange",
              "logo": "https://media.licdn.com/dms/image/v2/D560BAQEf-nZaqpZ0Rw/company-logo_400_400/B56ZfqdxN6GoAg-/0/1751985362163?e=1757548800&v=beta&t=dKbdF8GHJvgm4Zm3AmmcTt6bv5k-XfiusS-_ssC_DRU",
              "website": null,
              "name": "Tochi Exchange",
              "employeeCount": null,
              "followerCount": 1,
              "description": null
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 1,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0,
          "kpi_salary": 0.5,
          "kpi_company_size": 0.4,
          "kpi_company_popularity": 0.3,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 0.2,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0.66,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 0.5,
          "final_score": 0.6,
          "tier": "Yellow"
      },
      {
          "id": "4236276611",
          "title": "Sr. Fullstack Engineer - Messaging Platform",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4236276611/",
          "postedDate": "2025-07-10T09:11:47.000Z",
          "expireAt": "2025-08-26T00:57:13.000Z",
          "descriptionText": "Yahoo serves as a trusted guide for hundreds of millions of people globally, helping them achieve their goals online through our portfolio of iconic products. For advertisers, Yahoo Advertising offers omnichannel solutions and powerful data to engage with our brands and deliver results.\n\nIt takes powerful technology to connect our brands and partners with an audience of nearly 900 million. Whether you’re looking to write mobile app code, engineer the servers behind our massive ad tech stacks, or develop algorithms to help us process trillions of data points a day, what you do here will have a huge impact on our business—and the world. Want in?\n\nThe Messaging Platforms team is responsible for building and maintaining the platforms, services, and pipelines which enable Yahoo to target the right user with the right notification at the right time. We send billions of push notifications a day through our platform Rivendell. Our data pipelines enable the delivery of large scale newsletters. We leverage cutting edge technologies to deliver highly impactful projects enabling Yahoo to compete on a global scale.\n\nResponsibilities\n\nThis job will focus on backend, but there will be periods where we need to enhance our 2 user-facing applications written in React and Angular. You will also work on their Python and Java backends as well as our core platforms which are mainly written in Java. You will be a team leader, looking to ensure best practices are followed and ensuring junior developers thrive through a combination of code reviews and direct feedback. You will look to expand the platform by understanding business objectives and requirements.\n\nYou are a self-driven and motivated individual that wants to make an impact. You are a free thinker, have a hunger to learn, willing to try out new tools and technologies and willing to look for the best and most practical solution to any given problem (rather than the quickest or easiest). You take on challenges head on and work well under pressure. No task is too big or small for you and you treat everything with equal merit. You are a good team player and thrive as part of a team of equally talented and motivated individuals. You are a strong communicator.\n\nWork on development initiatives as part of a scrum team on sprint cycles.Closely interact with our stakeholders (Product Owners/Managers, Business Analysts, others) for clarity on sprint items and for verification of developed solutions.Participate in team activities such as sprint grooming sessions, project or product discussions, brown bags as well as the occasional team outing.Follow appropriate coding standards and best practices as applicable.Document your work well.Participate in code reviews for your peers.Collaborate with your peers to find solutions to complex problems. Share knowledge with your peers and also learn from them as required.Work on operational and production support for the applications we build and maintain.Work towards quarterly team and organizational goals that should be result oriented and measurable.\n\nMinimum Qualifications:\n\n6+ years of experience in Software EngineeringBachelors or Masters degree in Computer Science or related areaExperience in Web design, UI designFamiliarity with Front-end frameworks/libraries (React, Angular)Coding experience in HTML, CSS, JavascriptThorough understanding of object oriented programmingThorough understanding and experience with relational and non-relational databases.Good analytical, problem solving and debugging skills.\n\nPreferred:\n\nExperience in Javascript using React and GraphQLExperience in Python or Java and willingness to learnExperience with Cloud Providers (AWS, GCP)\n\nThe material job duties and responsibilities of this role include those listed above as well as adhering to Yahoo policies; exercising sound judgment; working effectively, safely and inclusively with others; exhibiting trustworthiness and meeting expectations; and safeguarding business operations and brand integrity.\n\nAt Yahoo, we offer flexible hybrid work options that our employees love! While most roles don’t require regular office attendance, you may occasionally be asked to attend in-person events or team sessions. You’ll always get notice to make arrangements. Your recruiter will let you know if a specific job requires regular attendance at a Yahoo office or facility. If you have any questions about how this applies to the role, just ask the recruiter!\n\nYahoo is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Yahoo will consider for employment qualified applicants with criminal histories in a manner consistent with applicable law. Yahoo is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. If you need accessibility assistance and/or a reasonable accommodation due to a disability, please submit a request via the Accommodation Request Form (www.yahooinc.com/careers/contact-us.html) or call +1.866.772.3182. Requests and calls received for non-disability related issues, such as following up on an application, will not receive a response.\n\nWe believe that a diverse and inclusive workplace strengthens Yahoo and deepens our relationships. When you support everyone to be their best selves, they spark discovery, innovation and creativity. Among other efforts, our 11 employee resource groups (ERGs) enhance a culture of belonging with programs, events and fellowship that help educate, support and create a workplace where all feel welcome.\n\nThe compensation for this position ranges from $128,250.00 - $266,875.00/yr and will vary depending on factors such as your location, skills and experience.The compensation package may also include incentive compensation opportunities in the form of discretionary annual bonus or commissions. Our comprehensive benefits include healthcare, a great 401k, backup childcare, education stipends and much (much) more.\n\nCurrently work for Yahoo? Please apply on our internal career site.",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": null,
          "applicants": 236,
          "views": 619,
          "jobApplicationLimitReached": false,
          "applyMethod": "https://ouryahoo.wd5.myworkdayjobs.com/en-US/careers/job/United-States-of-America/Sr-Fullstack-Engineer---Messaging-Platform_JR0026008?source=LinkedIn",
          "salary": "128,250 - 266,875 USD",
          "company": {
              "specialities": [
                  "innovation",
                  "internet",
                  "technology",
                  "advertising",
                  "media",
                  "consumer services",
                  "search",
                  "user experience",
                  "seo",
                  "online advertising",
                  "internet marketing"
              ],
              "industries": [
                  "Software Development"
              ],
              "locations": [
                  {
                      "city": "New York City",
                      "state": "New York",
                      "country": "United States"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/yahoo",
              "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQHZRIvlF1NvZA/company-logo_400_400/company-logo_400_400/0/1734629033465/yahoo_logo?e=1757548800&v=beta&t=H8iJd1jykBFze3ydTYEaX1hv-XIc0CQLo7KCUV4_kmc",
              "website": null,
              "name": "Yahoo",
              "employeeCount": 10413,
              "followerCount": 736299,
              "description": "Yahoo serves as a trusted guide for hundreds of millions of people globally, helping them achieve their goals online through our portfolio of iconic products. To learn more about Yahoo, please visit yahooinc.com.\n"
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 0.2,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0.33,
          "kpi_salary": 0.8,
          "kpi_company_size": 1,
          "kpi_company_popularity": 1,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 0.4,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 0.2,
          "final_score": 0.62,
          "tier": "Yellow"
      },
      {
          "id": "4263748384",
          "title": "AI Prompt Engineer",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4263748384/",
          "postedDate": "2025-07-09T22:06:54.000Z",
          "expireAt": "2025-08-08T22:06:54.000Z",
          "descriptionText": "We are looking for an AI Prompt Engineer for a State client based out of NY.This is a long term role.\nKey Responsibilities:Design, test, and refine prompts for various use cases, ensuring high-quality and consistent outputs from large language models (e.g., GPT, Claude, Gemini).Analyze AI outputs to identify failure modes and develop strategies to mitigate them via prompt engineering, chaining, or other techniques.Develop and maintain a library of optimized prompts for different tasks and domains.Collaborate with engineering and product teams to integrate prompt solutions into user-facing applications and workflows.Experiment with advanced prompt strategies, such as zero-shot, few-shot, chain-of-thought, retrieval-augmented generation (RAG), and system messages.Conduct A/B tests and user studies to evaluate prompt effectiveness.Document prompt development processes, best practices, and guidelines to enable scaling of prompt engineering work.Stay up to date with the latest research and trends in generative AI, large language models, and prompt engineering.Required Qualifications:Bachelor’s degree in Computer Science, Linguistics, AI, Data Science, Human-Computer Interaction, or a related field (or equivalent practical experience).Demonstrated experience with prompt engineering for large language models.Strong understanding of natural language processing (NLP) concepts and LLM behavior.Excellent analytical and problem-solving skills with attention to detail.Ability to write clear, effective prompts for diverse use cases.Familiarity with tools and APIs for interacting with LLMs (e.g., OpenAI, Anthropic, Google Vertex AI).Experience with Python or another scripting language.Strong communication skills and ability to collaborate cross-functionally.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, or national origin.",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": "https://www.linkedin.com/job-apply/4263748384",
          "applicants": 286,
          "views": 591,
          "jobApplicationLimitReached": false,
          "applyMethod": null,
          "salary": null,
          "company": {
              "specialities": [
                  "IT Services",
                  "Application Design",
                  "Systems Management",
                  "Staffing",
                  "Software Development",
                  "Systems Integration",
                  "Secure Credentialing",
                  "Quality Assurence",
                  "Big Data",
                  "Cloud Solutions",
                  "Municipal ID Solutions",
                  "Networking Services",
                  "Data",
                  "Business Intelligence",
                  "Analytics",
                  "IT Solutions",
                  "Application Development",
                  "CRM",
                  "E-Commerce ",
                  "Enterprise Resource Planning",
                  "Permanent Staffing",
                  "Temporary Staffing",
                  "Data Science",
                  "Identity Management",
                  "Project Management",
                  "Program Management",
                  "Case Management",
                  "Content Management Systems",
                  "Customer Relationship Management"
              ],
              "industries": [
                  "IT Services and IT Consulting"
              ],
              "locations": [
                  {
                      "city": "Iselin",
                      "state": "New Jersey",
                      "country": "United States"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/prutechus",
              "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQHWazKUksmBvw/company-logo_400_400/company-logo_400_400/0/1695997523505/prutechus_logo?e=1757548800&v=beta&t=Y625hw5oHRGEoIEAkJWPY6_dxYNFoK-HA_jtiD9ocPk",
              "website": null,
              "name": "PruTech Solutions, Inc.",
              "employeeCount": 356,
              "followerCount": 29070,
              "description": "PruTech Solutions Inc. (PruTech) is an established Information Technology (IT) and business support services organization with extensive experience in successfully partnering with private and public sector organizations. For over 25 years, by employing industry best practices and developing customized solutions, our clients have benefited from PruTech’s implementation of innovative technologies and ever-evolving IT services. \n\n          PruTech offers a full-range of customized services, including: \n\n          ■     Customized Application Development \n          ■     Legacy Systems Management and Support \n          ■     IT Service Management (ITSM) \n          ■     Business Solutions Consulting \n          ■     Program/Project Management \n          ■     Business Process Implementation \n          ■     Managed Service Initiatives \n          ■     IT Professional Services\n \nOur enterprise-level solutions have been deployed across diverse industries, including private-sector companies in the area of Finance, Pharmaceutical, Healthcare and Retail as well as for the public-sector, government agencies at the federal, state, and local levels. We have helped mid- to large-size clients attain their goals amid an accelerating growth in new technologies through the implementation of up-to-date, end-to-end, enterprise-wide IT solutions.\n \nWith such a comprehensive and diverse portfolio of IT services, PruTech has a successful history of identifying technology trends and enabling our clients to stay current, navigate new technologies, and embrace innovation with confidence.\n\n          Additional Information:\n\nContact us for a free consultation for all your IT solutions needs.\n          ■     Call:    (732) 404 1600\n          ■     Email:    info@prutech.com\n\n"
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 0.5,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 1,
          "kpi_salary": 0.5,
          "kpi_company_size": 0.6,
          "kpi_company_popularity": 0.6,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 0.4,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 1,
          "final_score": 0.67,
          "tier": "Yellow"
      },
      {
          "id": "4261608515",
          "title": "UX/UI Designers & Developers",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4261608515/",
          "postedDate": "2025-07-10T00:16:13.000Z",
          "expireAt": "2025-08-09T00:16:13.000Z",
          "descriptionText": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, Omm IT Solutions, is seeking the following. Apply via Dice today!\n\nPlease Note: \n\n100% remote but the candidate must be from NY or nearby cities as occasional visits may be required at critical project milestones Work Hours Full time 40 hrs a week.\n\nResponsibilities:\n\nLeads the effort to define, plan, and conduct user research throughout the SDLC (beginning in the Discovery phase) and to create research guides and conduct iterative user research. Outputs from the discovery phase will include journey maps, personas, and other artifacts that will inform the design and development phases. The UX Designer will also create prototypes using Adobe XD, Sketch, Invision, or similar standard UX/UI software to create iterative application flows in response to the ongoing user testing. UI Developer can translate creative software design concepts and ideas into reality using front end technologies. \n\nRequirements\n\nKey Requirements:\n\nExpertise in conducting user research and producing related deliverables including but not limited to personas, journey maps, interview guides, mind maps, and research finding documents.Expertise in using standard UX/UI software such as Sketch, InVision, and Adobe XD to create intuitive application prototypes driven by best practices around Human-Centered Design and in compliance to WCAG 2.0.Expertise in using front-end technologies such as HTML5, CSS3, and JavaScript to create responsive, browser agnostic prototypes. \n\nExperience:\n\nMinimum 8+ yearsCertifications: Any relevant certifications would be preferredMust be proficient in Technologies: HTML5, CSS3, and JavaScript. Sketch, InVision, and Adobe XD, REACT, ANGULAR\n\nEducation:\n\nGraduate or above",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": null,
          "applicants": 4,
          "views": 25,
          "jobApplicationLimitReached": false,
          "applyMethod": "https://click.appcast.io/t/ytbGJeRnjVmFoT3OxZ7-NIrdBHu15zMt2DuR9TltmVM=",
          "salary": null,
          "company": {
              "specialities": [],
              "industries": [
                  "Software Development"
              ],
              "locations": [],
              "linkedinUrl": "https://www.linkedin.com/company/jobs-via-dice",
              "logo": "https://media.licdn.com/dms/image/v2/D560BAQFwOT1y-MRTFQ/company-logo_400_400/B56ZVEKZkcHsAY-/0/1740605332130/jobs_via_dice_logo?e=1757548800&v=beta&t=05YBF1qiLGIEAs-I6J8MxBWFoE_rvaioKS7GrwolE_I",
              "website": null,
              "name": "Jobs via Dice",
              "employeeCount": 10,
              "followerCount": 50045,
              "description": "Welcome to Jobs via Dice, the go-to destination for discovering the tech jobs you want.\n\nThis page is dedicated to sharing job opportunities with tech professionals at every stage of their careers. When you see a job posted by Jobs via Dice, it’s a job for one of our many clients seeking to hire tech professionals like you.\n\nAt Dice, we understand that your career in technology is more than just a job; it’s a journey of growth, innovation and continuous learning. Stay connected with us to explore the latest job opportunities, industry trends and career tips tailored for tech professionals. Your future in tech starts here.\n\nWhat You’ll Find on Dice.com:\n\nTailored Tech Opportunities - Connect with the right tech companies and roles that match your skills and ambitions. Whether you're looking to land your first job or elevate your career, Dice is here to help.\n\nCareer Resources - Utilize our tools to build your skills, enhance your visibility, and get noticed by top employers.\n\nEasy Apply - Find and apply to your perfect tech role in just a few clicks with our Easy Apply feature. Simplify your job search and get hired faster.\n\nIndustry Insights - Stay ahead with our expert career advice and industry insights. From resume tips to interview prep, we provide the resources you need to succeed.\n\nEmployer Profiles - Get a firsthand look at a company’s culture to make informed decisions about where you want to work.\n\nJoin the community of tech professionals who trust Dice to help them find and apply to their next job in tech.\n\nTo follow our company page on LinkedIn, visit: https://www.linkedin.com/company/dice\n"
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 1,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0,
          "kpi_salary": 0.5,
          "kpi_company_size": 0.2,
          "kpi_company_popularity": 0.75,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 0.2,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 1,
          "final_score": 0.61,
          "tier": "Yellow"
      },
      {
          "id": "4263719846",
          "title": "Usability Tester",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4263719846/",
          "postedDate": "2025-07-09T18:12:05.000Z",
          "expireAt": "2025-08-08T18:12:05.000Z",
          "descriptionText": "Experience with usability testing, functional, regression, and end-to-end testing.Looking for proficiency in accessibility testing with JAWS, adhering to ADA, Section 508, and WCAG 2.0 compliance standards.Two years of experience testing with the Salesforce platform.",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": "https://www.linkedin.com/job-apply/4263719846",
          "applicants": 104,
          "views": 342,
          "jobApplicationLimitReached": false,
          "applyMethod": null,
          "salary": null,
          "company": {
              "specialities": [],
              "industries": [],
              "locations": [],
              "linkedinUrl": null,
              "logo": null,
              "website": null,
              "name": null,
              "employeeCount": null,
              "followerCount": null,
              "description": null
          },
          "kpi_jd_quality": 0.4,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 0.5,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0,
          "kpi_salary": 0.5,
          "kpi_company_size": 0.4,
          "kpi_company_popularity": 0.4,
          "kpi_industry_match": 0,
          "kpi_job_popularity": 0.4,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 0.4,
          "kpi_experience_threshold": 1,
          "final_score": 0.47,
          "tier": "Red"
      },
      {
          "id": "4263755137",
          "title": "Tech Product Designer (UX/UI Designer)",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4263755137/",
          "postedDate": "2025-07-09T22:41:19.000Z",
          "expireAt": "2025-08-08T22:41:19.000Z",
          "descriptionText": "Description\n\nAbout Us:\n\nAt Revive, we’re building exceptional products that meet the needs of our users. As a rapidly growing team, we are restructuring our design processes and scaling our design efforts to work closely with our expanding development team. We’re looking for a UX/UI Designer with experience in user research, usability, and data-driven decisions to join our team and help us build intuitive, user-centered designs. This is a unique opportunity to influence the design direction of a fast-moving company while collaborating with a passionate team of product managers, engineers, and designers. If you thrive in an environment where you can both design great user experiences and conduct research to improve them, this is the role for you.\n\nJob Description\n\nThe Tech Product Designer (UX/UI Designer) balances user-centered research and intuitive, visually polished interface design. This role flexes between UX research and UI design execution based on project needs and works closely with product and engineering partners to ground decisions in data and user feedback. The Product Designer will contribute to design system development and collaborate across teams to deliver thoughtful, scalable, and effective product experiences.\n\nThis is a remote position with travel expected approximately once per quarter for in-person collaboration.\n\nDuties\n\nShift fluidly between UX research and UI design based on project needs, contributing effectively to all phases of the product development lifecycle.Conduct user interviews, usability tests, and surveys to gather actionable insights that inform design decisions.Create high-quality wireframes, prototypes, and final UI designs that are visually appealing, intuitive, and user-centered.Collaborate with product managers, engineers, and other stakeholders to ensure designs meet business goals and user needs.Use user feedback and analytics to iterate on designs and improve the overall user experience.Contribute to and maintain a design system that supports consistency and scalability across the product.Actively participate in agile development processes and team collaboration sessionsPerform additional duties as assigned\n\nWhat We Offer\n\nComprehensive benefits package including health, dental, and vision insurance.Flexible work hours and remote work options.Opportunities for professional growth and development.A collaborative and supportive team environment.\n\nRequirements\n\n3-5 years of experience in UX/UI design, with demonstrated strength in both user research and visual design.Strong ability to conduct user research, including interviews, usability testing, and surveys, and translate findings into actionable insights.Proficient in Figma; experience with design systems and component libraries.Strong communication and teamwork skills, with experience working closely with stakeholders and engineering teams in agile environments.Ability to leverage analytics and user feedback to make informed design decisions and iterate solutions.Creative in solving design challenges, with an understanding of how to balance user needs, business goals, and technical constraints.Experience working with or contributing to a design system to maintain consistency and scalability across platforms.A strong portfolio that demonstrates both UI design and UX research skills, with clear examples of user-centered design solutionsExperience with JiraExperience with FigJam, Miro or similar collaboration toolsExperience in agile environments and working closely with development teams to iterate on designsFamiliarity with accessibility standards and inclusive design practicesKnowledge of analytics tools (e.g., Hotjar and Mixpanel) to inform design decisions (preferred).",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": null,
          "applicants": 109,
          "views": 261,
          "jobApplicationLimitReached": false,
          "applyMethod": "https://dc1prodrecruiting.paylocity.com/Recruiting/Jobs/Details/3401183/REVIVEHEALTH?source=LinkedIn_Feed",
          "salary": null,
          "company": {
              "specialities": [],
              "industries": [
                  "Government Administration"
              ],
              "locations": [
                  {
                      "city": "Ponte Vedra Beach",
                      "state": "Florida",
                      "country": "United States"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/revive-healthcare",
              "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQHbOVnmbPiCZQ/company-logo_400_400/company-logo_400_400/0/1719603298102/revive_healthcare_logo?e=1757548800&v=beta&t=EukggckjdcWca_EUIq_QjOtstmVO0TbVrVxU5f57Ouc",
              "website": null,
              "name": "Revive",
              "employeeCount": 129,
              "followerCount": 8359,
              "description": "Tired of complex, underused healthcare benefits? Revive changes the game.\n\nWe offer a standalone virtual care clinic that sits outside traditional medical plans, giving employees seamless access to primary care, mental health counseling, pharmacy, and weight health support. It’s healthcare that’s easy to navigate, drives real engagement, and saves you money.\n\nRevive isn’t just a benefits package—it’s the future of whole-person care for companies ready to lead. Are you in?"
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 0.5,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0,
          "kpi_salary": 0.5,
          "kpi_company_size": 0.5,
          "kpi_company_popularity": 0.5,
          "kpi_industry_match": 0,
          "kpi_job_popularity": 0.2,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 1,
          "final_score": 0.55,
          "tier": "Yellow"
      },
      {
          "id": "4264049503",
          "title": "Member Experience Architect",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4264049503/",
          "postedDate": "2025-07-10T05:35:39.000Z",
          "expireAt": "2025-08-09T05:19:10.000Z",
          "descriptionText": "Description\n\nAt Oura, our mission is to empower every person to own their inner potential. With our award-winning Oura Ring and app, we help over 2.5 million people turn insights about sleep, activity, and readiness into healthier, more balanced lives. We believe that starts from within — by creating a culture where our team feels supported, included, and inspired to do their best work. Our values guide how we show up for each other and our community every day.\n\nAs the CX Strategist reporting to the Head of CX Strategy & Program Management, you will be a key driver in shaping a company's customer experience. You will play a vital role in understanding customer needs, developing effective strategies, and ensuring that the customer is at the heart of everything the member experience team does.\n\nWhat you will do:\n\nStrategic Planning and Execution - Craft comprehensive strategic plans designed to elevate the overall customer experience. Implement these plans meticulously, ensuring alignment with organizational goals and customer needs.\n\nData Analysis and Improvement - Scrutinize customer feedback and data with meticulous attention to detail. Identify key areas where improvements can be made to the customer journey. Develop and implement targeted solutions to address these identified areas, fostering a continually improving customer experience.\n\nCustomer Journey Mapping - Create frameworks and visualizations of the customer journey to identify touchpoints, understand interactions, and pinpoint areas for optimization.\n\nIndustry Research and Trend Analysis - Conduct in-depth research on industry best practices and emerging trends in the field of customer experience. Stay informed about the latest advancements and integrate relevant knowledge into CX strategies and initiatives. Follow the competition and customers, assessing opportunities and threats, and utilizing external data points to influence plans for differentiation.\n\nPerformance Monitoring and Reporting - Establish and maintain a robust system for tracking CX performance metrics and key performance indicators (KPIs). Generate detailed reports on CX performance, providing valuable insights into areas of success and those requiring further attention.\n\nCross-Functional Collaboration - Actively collaborate with diverse cross-functional teams, including but not limited to, product, engineering, and marketing departments. Work in synergy with these teams to integrate customer experience initiatives seamlessly into the broader organizational framework.\n\nDocumentation and Reporting - Create and diligently maintain comprehensive project documentation. This includes, but is not limited to, project plans, detailed timelines, and regular, up-to-date status reports. Ensure all project-related information is accurately recorded and readily accessible.\n\nDrive customer-centricity - Promote a customer-focused culture within the organization by educating teams on CX principles and best practices.\n\nRisk Management - Proactively identify potential risks that could impede the progress or success of CX projects. Develop and implement mitigation strategies to address these risks, ensuring projects remain on track and potential issues are minimized.\n\nRequirements\n\nWe would love to have you on our team if you have:\n\nStrong ability to analyze data, identify trends, and make data-driven decisions related to customer experience.10+ years of experience in strategy or customer experience, with a proven track record of driving strategic CX initiatives.Demonstrated understanding of financial concepts, investment and ROI analysis, budgeting, and forecasting and modeling techniques .Ability to manage projects, track progress, and ensure deliverables are met on time and within budget.Proven leadership or contribution to executive decision making and logical cascade to managing projects and CX initiatives.Lead CX strategy sessions, getting executive buy-in and addressing concernsExcellent problem-solving and analytical skills related to customer experience.Strong communication and interpersonal skills.Experience with project management tools (e.g., Google Sheets, project management software).Strong customer service orientation.\n\nBenefits\n\nAt Oura, we care about you and your well-being. Everyone here at Oura has a ring of their own and we are continually looking to improve employee health.\n\nWhat we offer:\n\nCompetitive salary and equity packagesHealth, dental, vision insurance, and mental health resourcesAn Oura Ring of your own plus employee discounts for friends & family20 days of paid time off plus 13 paid holidays plus 8 days of flexible wellness time offPaid sick leave and parental leave\n\nOura takes a market-based approach to pay, which may vary depending on your location. US locations are categorized into tiers based on a cost of labor index for that geographic area. While most offers will be closer to the starting range, successful candidates' pay will be determined based on job-related skills, experience, qualifications, work location, internal peer equity, and market conditions. These ranges may be modified in the future.\n\nRegion 1: $125,000-$156,000Region 2: $109,000-$136,000Region 3: $104,000-$130,000\n\nA recruiter can determine your zones/tiers based on your US location.\n\nWe are not considering candidates residing in the following states: Alaska (AK), Arkansas (AR), Delaware (DE), Iowa (IA), Mississippi (MS), Missouri (MO), Nebraska (NE), South Dakota (SD), Vermont (VT), West Virginia (WV), and Wisconsin (WI)\n\nOura is proud to be an equal opportunity workplace. We celebrate diversity and are committed to creating an inclusive environment for all employees. Individuals seeking employment at Oura are considered without regard to age, ancestry, color, gender (including pregnancy, childbirth, or related medical conditions), gender identity or expression, genetic information, marital status, medical condition, mental or physical disability, national origin, protected family care or medical leave status, race, religion (including beliefs and practices or the absence thereof), sexual orientation, military or veteran status, or any other characteristic protected by federal, state, or local laws. We will not tolerate discrimination or harassment based on any of these characteristics.\n\nWe will work to ensure individuals with disabilities are provided reasonable accommodation to participate in the interview process, to perform essential job functions, and to receive other benefits and privileges of employment.\n\nDisclaimer: Beware of fake job offers!\n\nWe’ve been alerted to scammers posing as ŌURA recruiters, especially for remote roles. Please note:\n\nOur jobs are listed only on the ŌURA Careers page and trusted job boards.We will never ask for personal information like ID or payment for equipment upfront.Official offers are sent through Docusign after a verbal offer, not via text or email.\n\nStay cautious and protect your personal details.\n\nTo all recruitment agencies: Oura does not accept agency resumes. Please do not forward resumes to our jobs alias, Oura employees, or any other organization's location. Oura is not responsible for any fees related to unsolicited resumes.",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": null,
          "applicants": 2,
          "views": 15,
          "jobApplicationLimitReached": false,
          "applyMethod": "https://apply.workable.com/oura-health-ltd/j/6F55376A15?utm_source=linkedin.com",
          "salary": null,
          "company": {
              "specialities": [
                  "Consumer electronics",
                  "Health technology",
                  "Wearable technology",
                  "Sleep monitoring",
                  "Software development"
              ],
              "industries": [
                  "Wellness and Fitness Services"
              ],
              "locations": [
                  {
                      "city": "San Francisco",
                      "state": "California",
                      "country": "United States"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/oura",
              "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQG0D1ASfYp-xQ/company-logo_400_400/company-logo_400_400/0/1630525020003/oura_logo?e=1757548800&v=beta&t=iIZ2RPKmLaHBMSVD7KDP66cGNG6MOOJP46EpINut7ug",
              "website": null,
              "name": "ŌURA",
              "employeeCount": 941,
              "followerCount": 162633,
              "description": "Oura is an award-winning and fast-growing startup that helps people track all stages of sleep and activity using the Oura Ring and connected app. By providing daily feedback and practical steps to inspire healthy lifestyles, we've helped hundreds of thousands of people improve their sleep, understand their bodies, and transform their health. We’re on a mission to empower every person to own their inner potential, and we’re seeking talented individuals to join us on our journey.\n\nJOIN THE OURA TEAM\n\nOura is full of skilled experts and we’re known to share a good laugh every now and then. We always strive to learn more and dig deeper into our research and analytics, to stay engaged and creative in everything we do. We respect our partners, privacy and the scientific method.\n\nWe are a multi-disciplinary team of over 100 experts in hardware engineering, software development, machine learning, bioscience, sleep, industrial and UX design, production, marketing and customer experience.\n\nOura Health Ltd.’s HQ and major manufacturing facilities are located in Oulu, Finland. Other locations include Helsinki, San Diego, and San Francisco."
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 0.2,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0.33,
          "kpi_salary": 0.5,
          "kpi_company_size": 0.7,
          "kpi_company_popularity": 0.9,
          "kpi_industry_match": 0,
          "kpi_job_popularity": 0.2,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 1,
          "final_score": 0.6,
          "tier": "Yellow"
      },
      {
          "id": "4214543639",
          "title": "Senior/Staff Product Manager, Shopping",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4214543639/",
          "postedDate": "2025-07-09T17:46:57.000Z",
          "expireAt": "2025-10-19T09:28:09.000Z",
          "descriptionText": "Join Our Journey at Engine\n\nAt Engine, we're revolutionizing work travel. Our modern travel platform isn't just about booking trips; it's about transforming how businesses and their teams experience travel. From seamless booking options with top airlines, hotels, and car rental providers to single-invoice billing and flexible trip modifications, we make travel not only easier to manage but also enjoyable. Backed by powerhouse investors like Telescope Partners, Blackstone, Elefund, and Permira, we're growing fast—and we want you to be part of it.\n\nIdeal candidates are based in San Francisco or New York, and are willing to work a hybrid 3 days a week schedule in office. \n\nJoin Our Journey at Engine\n\nAt Engine, we're revolutionizing work travel. Our modern travel platform isn't just about booking trips; it's about transforming how businesses and their teams experience travel. From seamless booking options with top airlines, hotels, and car rental providers to single-invoice billing and flexible trip modifications, we make travel not only easier to manage but also enjoyable. Backed by powerhouse investors like Telescope Partners, Blackstone, Elefund, and Permira, we're growing fast—and we want you to be part of it.\n\nYour Mission:\n\nAt Engine, you'll be at the heart of innovation, pushing the boundaries of what's possible in the business travel space. We're looking for a passionate product manager to drive transformation and deliver seamless shopping and booking experiences that make a measurable impact on our customers and business.\n\nWhat You'll Do\n\nDefine and Drive Product Strategy\n\nShape a compelling product vision for the search and shop booking journey with flights, hotels, or rental cars.Balance user-centric design with business impact, applying modern product techniques and leveraging emerging technologies like AI for personalized recommendations.\n\nCollaborate Across Functions\n\nWork closely with engineers, designers, data teams, and business stakeholders to define and deliver features that improve discovery, selection, and booking.Foster inclusive team discussions and champion shared goals across multiple workstreams.\n\nDeliver Impactful Solutions\n\nLead the design and rollout of scalable search and shop features that drive conversion, build user confidence, and improve the overall shopping journey.\n\nUse Data to Inform Decisions\n\nCombine customer research, behavioral insights, and experimentation to guide decision-making and optimize outcomes.Run experiments and continuously test and iterate to ensure our solutions are delivering maximum value.\n\nCommunicate with Clarity\n\nTranslate complex ideas into clear, actionable plans.Keep teams and stakeholders aligned by telling compelling stories around the \"why\" behind product priorities and trade-offs.\n\nWhat You'll Bring to Engine:\n\nExperience: 5+ years in product management, ideally with experience in travel tech, marketplaces, or booking platforms. Bonus points for experience within the travel space, but not required.Collaboration: Strong track record of cross-functional collaboration and ability to influence across teams and functions.User-Centered Thinking: Deep empathy for users, with a solid understanding of UX principles and the ability to translate customer needs into intuitive solutions.Analytical Approach: Experience using data, experimentation, and A/B testing to validate hypotheses and inform roadmap decisions.\n\nThe Engine Edge: Perks & Compensation\n\nWe believe in rewarding great work with great benefits:\n\nCompensation: Competitive base pay tied to role and experience, with opportunities for bonuses, commissions, and equity.Benefits: Check out our full list at engine.com/culture.\n\nEnvironments for Success: Different roles have different needs in terms of the environments that drive success which is why we have a hybrid-hub model. Whether you are in one of our amazing offices or fully remote, we'll make sure you have what you need to succeed.\n\nReady to Build the Future of Work Travel?\n\nJoin us on our mission to transform how work travel works—for businesses, for travelers, and for the industry. Apply now and let's make travel simpler, smarter, and more enjoyable—together.\n\nCompensation\n\nOur compensation packages are based on several factors, including your experience and expertise. In addition to a competitive base salary, total compensation may include equity and/or variable pay (OTE). Your recruiter will share your complete compensation package as you move through the process.\n\nBase Pay Range\n\n$180,000—$220,000 USD\n\nThe Engine Edge: Perks & Compensation\n\nWe believe in rewarding great work with great benefits:\n\nCompensation: Competitive base pay tied to role and experience, with opportunities for bonuses, commissions, and equity.Benefits: Check out our full list at engine.com/culture.Environments for Success: Different roles have different needs in terms of the environments that drive success which is why we have a hybrid-hub model. Whether you are in one of our amazing offices or fully remote, we'll make sure you have what you need to succeed.\n\nPerks and benefits may vary based on employment type, location, and more.\n\nReady to Build the Future of Work Travel?\n\nJoin us on our mission to transform how work travel works—for businesses, for travelers, and for the industry. Apply now and let's make travel simpler, smarter, and more enjoyable—together.",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": null,
          "applicants": 393,
          "views": 1919,
          "jobApplicationLimitReached": false,
          "applyMethod": "https://grnh.se/e9b546a33us?source=LinkedIn",
          "salary": "180,000 - 220,000 USD",
          "company": {
              "specialities": [
                  "travel management",
                  "business travel",
                  "corporate travel",
                  "SMB",
                  "enterprise",
                  "travel tech",
                  "software",
                  "members only",
                  "travel",
                  "software"
              ],
              "industries": [
                  "Software Development"
              ],
              "locations": [],
              "linkedinUrl": "https://www.linkedin.com/company/engine",
              "logo": "https://media.licdn.com/dms/image/v2/D560BAQH-JF-IkmDBMA/company-logo_400_400/company-logo_400_400/0/1726693983302/engine_logo?e=1757548800&v=beta&t=Q9qfIUD0b1DdPhP9MP_sCTYGeDoQ0jjpo8xSCHcNgvk",
              "website": null,
              "name": "Engine",
              "employeeCount": 909,
              "followerCount": 25160,
              "description": "Engine is the modern travel platform for booking and managing work trips. It saves businesses time and money through an intuitive travel network that connects to nearly every hotel, airline, and car rental company in the U.S. It offers single invoice billing, the flexibility to modify trips at any time without sunk costs, and a unified view of all company travel and spend. Customers rely on Engine to not only make travel easier to manage, but to make it enjoyable for everyone involved. The company is backed by Telescope Partners, Blackstone, Elefund and Permira. Learn more at www.engine.com."
          },
          "kpi_jd_quality": 0.8,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 1,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0,
          "kpi_salary": 1,
          "kpi_company_size": 0.7,
          "kpi_company_popularity": 0.6,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 0.6,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 1,
          "final_score": 0.68,
          "tier": "Yellow"
      },
      {
          "id": "4264066869",
          "title": "MLOps Engineer | Python | Machine Learning | GCP | Kubernetes | CI/CD | Remote, UK",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4264066869/",
          "postedDate": "2025-07-10T06:44:17.000Z",
          "expireAt": "2025-09-08T06:44:10.000Z",
          "descriptionText": "MLOps Engineer | Python | Machine Learning | GCP | Kubernetes | CI/CD | Remote, UK\nAbout UsWe are an early-stage biotechnology company using live cell imaging and artificial intelligence to predict stem cell behavior. Our goal is to improve the manufacturing of human cells for research and therapeutic use by enabling a deeper understanding of cell differentiation. Founded in 2022 as a spin-out from a leading UK research institution, we are backed by prominent venture capital firms with experience investing in AI, life sciences, and deep tech startups.\nWhat We’re BuildingAt the core of our technology is a proprietary AI-powered SaaS platform that enables scientists to visualize, track, and predict cell differentiation in real-time. Designed to support high-throughput experiments, the platform integrates microscopy, computer vision, cloud infrastructure, and machine learning to accelerate advancements in cell biology and biomanufacturing.\nWe are currently seeking a DevOps / MLOps Engineer to help scale our cloud infrastructure and machine learning workflows as part of our growing technical team.\nKey ResponsibilitiesDevelop and maintain infrastructure for our SaaS platform that delivers AI-driven computer vision tools to researchers and scientists.Collaborate with a multidisciplinary team of machine learning engineers, data scientists, software developers, and biologists.Build and support GPU-accelerated environments for training and real-time inference of deep learning models.Deploy and manage ML pipelines using tools like Docker, Kubernetes, and frameworks such as Kubeflow or Ray.Create and document APIs that enable internal and external users to access data and model outputs.Implement secure authentication and authorization systems for platform users.Maintain and improve our cloud platform’s reliability, security, and compliance (e.g., GDPR, HIPAA readiness).Automate testing, training, and deployment of models through robust CI/CD pipelines.Monitor and troubleshoot performance issues across data and inference workflows in production.\nWhat We’re Looking For5+ years of experience in DevOps, MLOps, SRE, or Data Engineering roles.Strong proficiency with public cloud platforms (e.g., GCP, AWS, or Azure), with preference for GCP.Expertise in Terraform and infrastructure-as-code practices.Solid experience deploying workloads with Kubernetes, including cluster and node management.Familiarity with ML workload orchestration using Docker, Kubeflow, Ray, or similar tools.Skilled in Python and comfortable working with SQL and data processing tools.Understanding of the machine learning lifecycle from data ingestion to inference.Experience handling large-scale datasets and optimizing data pipelines.Strong communication skills and the ability to clearly document complex systems.A self-driven mindset and interest in staying current with trends in cloud, data, and ML tools.Experience leading infrastructure efforts in greenfield or early-stage environments.\nNice to HaveExperience working on SaaS platforms in biotech, healthcare, or life sciences.Experience with real-time ML inference and production monitoring.Familiarity with computer vision models and workflows.Understanding of data privacy regulations and scientific data formats (e.g., TIFF, OME-TIFF).Background working in early-stage startups (seed or Series A).\nWhat We OfferCompetitive salary and benefits.Growth opportunities and professional development.A collaborative, forward-thinking environment at the intersection of AI and biotechnology.A meaningful mission with the potential to impact healthcare through innovation in science and technology.\nWhy Join UsYou'll be part of a rapidly growing, interdisciplinary team working on complex challenges in AI and biology. Your contributions will shape the technical foundation of our product and accelerate both scientific discovery and therapeutic development. This is an opportunity to make a tangible impact during a pivotal stage of growth.\nMLOps Engineer | Python | Machine Learning | GCP | Kubernetes | CI/CD | Remote, UK",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": "https://www.linkedin.com/job-apply/4264066869",
          "applicants": 8,
          "views": 31,
          "jobApplicationLimitReached": false,
          "applyMethod": null,
          "salary": null,
          "company": {
              "specialities": [],
              "industries": [
                  "Staffing and Recruiting"
              ],
              "locations": [
                  {
                      "city": "London",
                      "state": "England",
                      "country": "UK"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/enigma-rec",
              "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQFEqpNFpIoqsQ/company-logo_400_400/company-logo_400_400/0/1713259859209/enigma_rec_logo?e=1757548800&v=beta&t=hA-rTSEiTyNP7WHy5312aK_LILaaM0yivxQOCnplSKc",
              "website": null,
              "name": "Enigma",
              "employeeCount": 24,
              "followerCount": 35762,
              "description": "Here at Enigma, we specialize in Generative AI recruitment, specifically focused on Machine Learning and Software Engineering disciplines. With a combined experience of 20+ years, we understand the intricacies of finding the perfect role as well as the right talent for your team.\n\nBut what sets Enigma apart? Our consultative approach. We don't just match candidates with job openings; we guide candidates, founders, and hiring managers through the recruitment process. Our value-added services go beyond traditional recruitment efforts, offering services such as recruitment process structuring, salary benchmarking, share allocation, CV reviews and so much more.\n\nWe're more than recruiters – we're partners in your success journey. Our mission is not only to connect you with exceptional talent and companies but also to support your growth and success every step of the way. We're committed to your success. Let us partner with you to connect you with people and companies alike, that will drive growth and innovation for years to come."
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 0.2,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0,
          "kpi_salary": 0.5,
          "kpi_company_size": 0.3,
          "kpi_company_popularity": 0.6,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 0.2,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 1,
          "final_score": 0.55,
          "tier": "Yellow"
      },
      {
          "id": "4264830741",
          "title": "Cloud Platform Engineer - AWS",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4264830741/",
          "postedDate": "2025-07-10T09:08:00.000Z",
          "expireAt": "2025-08-09T09:07:27.000Z",
          "descriptionText": "This is a remote position.\n\nCloud Platform Engineer - AWS\n\nFully remote within the UK\n\n£60,000 - £75,000\n\nAre you ready to revolutionise the financial services sector?\n\nCloud Platform Engineer - AWS Connect & AI Specialist\n\nOur client, a forward thinking Fintech innovator, is pushing the boundaries with their cutting-edge CRM platform that's transforming how financial services operate! They're on a mission to deliver game-changing features to both residential and commercial customers, and they need YOUR expertise to make it happen!\n\nAs an experienced AWS Cloud Platform Engineer, you'll be at the heart of innovation, architecting and optimising the cloud infrastructure that powers their proprietary CRM platform. This isn't just a job – it's your chance to make a significant impact in a fast-paced, forward-thinking organisation that's redefining what's possible in Fintech!\n\nYour Exciting Mission:\n\nDesign and implement groundbreaking AWS cloud platform services that fuel product development and feature expansion Develop and maintain robust PHP-based solutions integrated with AWS cloud services Master AWS Kinesis for real-time data streaming and processing across multiple internal projects Configure and manage AWS Connect contact centre solutions to enhance customer communication capabilities Leverage cutting-edge AI technologies including Amazon SageMaker and Bedrock to build intelligent solutions Transform routine tasks through automation, dramatically improving system efficiency Optimise AWS cloud infrastructure to deliver unmatched performance, scalability, and security Leverage advanced monitoring tools including Grafana, CloudWatch, and DataDog to ensure peak system performance Troubleshoot complex cloud platform challenges across development, testing, and production environments Implement fortress-like security practices across all AWS infrastructure and services Collaborate with brilliant development teams to build robust, high-performance cloud environments Drive innovation by staying ahead of emerging AWS technologies and AI solutions \n\nRequirements\n\nEssential:\n\nExtensive PHP coding experience with cloud integration capabilities Advanced AWS Kinesis experience for real-time data processing and streaming Expert-level AWS Connect experience for contact centre solutions and customer communication workflows Commercial AI experience using Amazon SageMaker, Bedrock, and industry-leading LLMs (OpenAI, Anthropic, Google) \n\nAdditional Requirements:\n\n3+ years of hands-on experience as a Cloud Platform Engineer, DevOps Engineer or in a related role Unix operating system administration Experience with CI/CD tools such as GitLab, Jenkins, CircleCI etc Proficiency with containerisation technologies specifically Docker, Amazon ECS and ECR AWS cloud platforms including services such as EC2, ECS, RDS, S3, SQS, OpenSearch, ElastiCache Extensive relational database knowledge (e.g. MySQL, MariaDB, PostgreSQL), as well as NoSQL databases (e.g. MongoDB, DynamoDB Experience with search (e.g. Elasticsearch) and caching (e.g. Redis) technologies Knowledge of infrastructure as code (IaC) using tools such as Terraform Strong understanding of networking (VPCs, SGs etc), firewalls, VPN, and DNS Familiarity with monitoring tools such as Sentry, Grafana, Prometheus and CloudWatch Experience with version control systems (e.g. GitLab) and best practices for branching, merging, and versioning Coding experience with Python, Javascript, Bash and Node.js \n\nBonus Points For:\n\nAWS certifications (AWS Certified Solutions Architect, DevOps Engineer, AI Practitioner etc) Experience with automated testing and code quality tools Knowledge of Google Cloud Platform and related services Advanced AWS Connect certifications and Kinesis integration expertise Experience with contact centre analytics and reporting tools API management experience with AWS API Gateway Experience with additional AI services and machine learning workflows \n\nBenefits\n\nCompetitive salary that rewards your exceptional skills Comprehensive pension plan for your future Bupa healthcare coverage for your wellbeing Access to a premium flexible benefits platform True work-life balance with remote working opportunities across the UK Be part of a revolutionary Fintech company that's leading innovation in AI and cloud technology Collaborative, progressive environment focused on your growth and development Clear pathways for career advancement and AWS certifications Opportunity to work with cutting-edge AI technologies and real-time data processing \n\nDon't just find a job – launch an exciting career with a company that's redefining what's possible in Fintech!\n\nApply today and become part of my clients extraordinary journey\n\nApplicants must have eligibility to work within the UK without restrictions\n\n",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": "https://www.linkedin.com/job-apply/4264830741",
          "applicants": 24,
          "views": 109,
          "jobApplicationLimitReached": false,
          "applyMethod": "https://recruit.zoho.eu/recruit/ViewJob.na?digest=m5sopuWp1.Gw8TuYvkedF9ZcAm9wmskAlFIetGYnCyA-&embedsource=LinkedIn%2BLimited%2BListings",
          "salary": null,
          "company": {
              "specialities": [
                  "Recruitment",
                  "Consultancy",
                  "Coaching",
                  "Sourcing",
                  "Head Hunting",
                  "Technology Recruitment",
                  "Sales"
              ],
              "industries": [
                  "Staffing and Recruiting"
              ],
              "locations": [
                  {
                      "city": "Bournemouth",
                      "state": "England",
                      "country": "UK"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/mywork-agency",
              "logo": "https://media.licdn.com/dms/image/v2/C560BAQFZjcNzQffDPw/company-logo_400_400/company-logo_400_400/0/1630587673126?e=1757548800&v=beta&t=3N0o6ceFQDZ_8njsnM5CA48ZRcfcm-efMsggzbl3hUM",
              "website": null,
              "name": "mywork",
              "employeeCount": 58,
              "followerCount": 10604,
              "description": "Passionate about people and technology, aligning talented professionals with great opportunities and clients.\n\nmywork is a specialist Technology Recruitment agency that speaks your language and understands your industry. \n\nmywork has a proven track record of successfully placing talented professionals nationally and internationally, from our Dorset based office.\n\nWe are continuously sourcing and connecting with passive and active candidates.\n\nWith the 10 years specialist sector knowledge, regional experience and the motivation to deliver on your requirements. The specialisms we cover represent some of the most exciting areas of employment growth.\n\nDigital, Marketing, Data, AI, and E-commerce\nNot for profit\nMedical / Pharma\nIT and Telecoms\nFinancial Services, FinTech\nLuxury Retail\nFMCG\nBusiness Support and HR\n\nmywork will work with you as your advisor, coach, consultant and business partner, to get you where you want to be.\n\nwww.instagram.com/mywork.agency/"
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 0.2,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0,
          "kpi_salary": 0.5,
          "kpi_company_size": 0.5,
          "kpi_company_popularity": 0.6,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 0.2,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 1,
          "final_score": 0.56,
          "tier": "Yellow"
      },
      {
          "id": "4229018052",
          "title": "Lead DevOps Engineer – Azure | SaaS",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4229018052/",
          "postedDate": "2025-07-10T09:57:19.000Z",
          "expireAt": "2025-11-11T17:26:48.000Z",
          "descriptionText": "About the CompanyWe're partnering with a leading SaaS provider to find a Lead DevOps Engineer who will play a pivotal role in enhancing and scaling their Azure-based infrastructure.\nAbout the RoleThis permanent position offers up to £100,000 plus bonus\nResponsibilitiesDesign and optimise Azure cloud infrastructure to ensure scalability, performance, and reliability.Implement and manage Infrastructure as Code (IaC) using Terraform, streamlining deployment processes.Collaborate with software engineering teams to foster a robust DevOps culture and enhance CI/CD pipelines.Develop automation scripts and tools using Python to improve operational efficiency.Ensure adherence to best practices in security, compliance, and system monitoring.\nQualificationsExtensive experience with Microsoft Azure in a senior or lead DevOps capacity.Proficient in Terraform for infrastructure automation.Strong scripting skills in Python.Demonstrated success in implementing and managing CI/CD pipelines.Excellent communication skills and a collaborative mindset.\nRequired SkillsMicrosoft AzureTerraformPythonCI/CD pipelinesCommunication skills\nPreferred SkillsExperience in a SaaS environmentKnowledge of security best practices\nPay range and compensation packageCompetitive salary up to £100,000 per annum. Performance-based bonus structure. Comprehensive benefits package, including private healthcare and pension contributions.\nPlease apply to find out more!",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": "https://www.linkedin.com/job-apply/4229018052",
          "applicants": 275,
          "views": 736,
          "jobApplicationLimitReached": false,
          "applyMethod": null,
          "salary": "85,000 - 100,000 GBP",
          "company": {
              "specialities": [],
              "industries": [
                  "Software Development"
              ],
              "locations": [
                  {
                      "city": "London",
                      "state": "England",
                      "country": "UK"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/opensource-recruitment",
              "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQHOGyImDWBd8g/company-logo_400_400/B4DZbU5A49G0AY-/0/1747328438189/opensource_recruitment_logo?e=1757548800&v=beta&t=UWTySuiDgS9SHeH18feqvPN98cuwciB_Ju_ZfOYk7GE",
              "website": null,
              "name": "OpenSource",
              "employeeCount": 42,
              "followerCount": 20217,
              "description": "We’re a founder-led recruitment partner that does things differently.\n\nOpenSource was built by people who’ve sat on both sides of the hiring table — George, a former software developer, and Harry, a seasoned recruiter with a decade of experience scaling teams for VC-backed startups and high-growth scale-ups.\n\nOur approach\n• We embed seamlessly and scale with your team\n• Every candidate is technically screened by us\n• Stronger hires in less time\n\nWays to partner\n• Contingent – Pay only when you hire\n• Retained – Dedicated support with upfront commitment\n• RPO – Fully embedded for high-volume, strategic hiring\n\nWe specialise in hiring across the full product and engineering lifecycle — including backend, frontend, DevOps, data, AI, and leadership roles.\n\nPlease get in touch on Linkedin or email george@open-source.io."
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 1,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0,
          "kpi_salary": 0.4,
          "kpi_company_size": 0.3,
          "kpi_company_popularity": 0.6,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 0.4,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 1,
          "final_score": 0.61,
          "tier": "Yellow"
      },
      {
          "id": "4264840096",
          "title": "Data Software Engineer Python PySpark",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4264840096/",
          "postedDate": "2025-07-10T09:47:12.000Z",
          "expireAt": "2025-08-09T09:46:32.000Z",
          "descriptionText": "Data Software Engineer (Python PySpark) Remote UK to £95k\nAre you a data savvy Software Engineer with strong Python coding skills?\nYou could be progressing your career in a senior, hands-on Data Software Engineer role as part of a friendly and supportive international team at a growing and hugely successful European car insurance tech company as they expand their UK presence; their platform enables an insurance quote to be made to the consumer within 60 seconds, using just 4 clicks.\nAs a Data Software Engineer within the Claims team you will help shape the architecture of data products, building reusable technology that enables teams to ingest, store, transform and serve their own data products. You'll take a lead in data transformation, setting up best practices in areas like Data modelling, performance optimisation and Data Governance to ensure that the data used within the business is consistent, available and reliable.\nYou will be supported with continual learning and self development opportunities and will be encouraged to contribute to testing open source tools and engaging in community building activities such as meet-ups, keeping up to date with new and emerging technologies and methods.\nLocation / WFH: You can work from home on a full time basis from anywhere in the UK or work a hybrid model from the London office depending on your location / preferences.\nAbout you:You are degree educated in a relevant discipline, e.g. Computer Science, MathematicsYou have a software engineering background with advanced Python and PySpark coding skillsYou have experience in batch, distributed data processing and near real-time streaming data pipelines with technologies such as KafkaYou have experience of Big Data Analytics platform integration with AWSYou have a strong understanding of RDBMS, Data Warehousing, Data Modelling, SQL (Redshift, PostgreSQL) and NoSQL databasesYou have a good appreciation of software engineering best practices, DevOps, CI/CD, IaCYou have excellent communication skills\nWhat's in it for you:As a Data Software Engineer (Python Spark AWS) you will earn a competitive package:Up to £95,000 salaryRemote working including flexible working hoursWorkplace nursery schemeEnhanced maternity package25 days holiday plus ability to buy or sell 5 days p/year + extra \"duvet day\"Pension, Private Medical and Dental Insurance, Life Assurance, Employee Assistance ProgrammeWeekly Yoga and monthly Acupuncture sessions, Headspace membershipDiverse, inclusive team environment with a range of support networksA range of other perks including Perkbox, cycle to work, season ticket loan\nApply now to find out more about this Data Software Engineer (Python Spark AWS) opportunity.\nRef: PR/100084/A/KS/100725",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": null,
          "applicants": 15,
          "views": 58,
          "jobApplicationLimitReached": false,
          "applyMethod": null,
          "salary": "80,000 - 95,000 GBP",
          "company": {
              "specialities": [
                  "IT Recruitment",
                  "Development Manager Jobs",
                  "Technical Support Jobs",
                  "Executive Search",
                  "Software Engineer Jobs C++ C# .Net Java",
                  "Headhunt",
                  "Open Source Technologies",
                  "QA Testing Jobs",
                  "Technical Jobs in Banking / Finance",
                  "Start-up Opportunities",
                  "Software House vacancies"
              ],
              "industries": [
                  "Staffing and Recruiting"
              ],
              "locations": [
                  {
                      "city": "London",
                      "state": "England",
                      "country": "UK"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/client-server",
              "logo": "https://media.licdn.com/dms/image/v2/C560BAQE_8pRTMzWPZA/company-logo_400_400/company-logo_400_400/0/1630582373092/client_server_logo?e=1757548800&v=beta&t=yJ-oif6YyhZ82w8AZpdocMIW3zAKAo1ljjBUEK4bVbE",
              "website": null,
              "name": "Client Server",
              "employeeCount": 127,
              "followerCount": 164443,
              "description": "At Client Server, we are driven by technology and powered by people. \n\nWe are a leading technology recruitment consultancy, specialising in a vast range of technology roles in London, the UK, Europe, and the USA.\n\nOur focus is finding exceptional candidates for exceptional organisations. These include technology leaders, innovative start-ups, hedge funds, banks and consultancies. "
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 0.2,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0,
          "kpi_salary": 0.4,
          "kpi_company_size": 0.5,
          "kpi_company_popularity": 0.9,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 0.2,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 1,
          "final_score": 0.58,
          "tier": "Yellow"
      },
      {
          "id": "4264727579",
          "title": "Junior QA Automation Engineer",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4264727579/",
          "postedDate": "2025-07-09T12:57:10.000Z",
          "expireAt": "2025-08-08T12:57:00.000Z",
          "descriptionText": "Position: Junior QA Automation Engineer\n\nLocation: UK Remote\n\nReports to: Head of Development\n\nAbout Us\n\nAt Happydance, we’re redefining HR technology through innovative, user-centric digital solutions. We believe in delivering exceptional experiences to our clients, and quality assurance is at the heart of everything we do. Join our team as a Junior QA Automation Engineer and play a critical role in ensuring the delivery of high-quality, scalable, and reliable software solutions.\n\nRole Overview\n\nAs a Junior QA Automation Engineer, you will be responsible for designing, implementing, and maintaining automated test frameworks and scripts to ensure the quality and functionality of our products. Working closely with development and product teams, you will help define and uphold quality standards, troubleshoot issues, and drive continuous improvement in our testing processes.\n\nKey Responsibilities\n\nTest Automation:\n\nDesign, develop, and maintain automated test frameworks and scripts for functional, regression, and performance testing. Implement and execute automated tests to identify bugs and ensure product quality. Continuously optimize automation frameworks to improve efficiency and scalability. \n\nQuality Assurance:\n\nCollaborate with development and product teams to understand requirements and define test strategies. Identify and document test cases, scenarios, and test data for automation. Perform root cause analysis on defects and work with developers to resolve issues. Maintain comprehensive test documentation, including test plans, reports, and results. \n\nContinuous Integration and Delivery (CI/CD):\n\nIntegrate automated tests into CI/CD pipelines to enable continuous testing and deployment. Monitor test results in CI/CD environments and provide timely feedback to stakeholders. \n\nProcess Improvement:\n\nAdvocate for quality best practices across the organization. Stay updated on industry trends and emerging technologies in QA and test automation. Proactively identify areas for process improvement and implement innovative solutions. From time to time, you may be required to work flexibly to accommodate our valued US-based customers, ensuring our global commitment to exceptional service. \n\nQualifications & Skills\n\nThe Must-Haves:\n\nProven experience in QA automation, with expertise in designing and implementing test frameworks. Proficiency in programming languages such as Java, Python, or JavaScript for test automation. Strong experience with automation tools like Selenium, Cypress, Appium, or similar. Familiarity with API testing tools such as Postman or RestAssured. Knowledge of CI/CD tools (e.g., Jenkins, GitHub Actions, Azure DevOps) and version control systems (e.g., Git). Solid understanding of software testing principles, methodologies, and best practices. Excellent problem-solving skills and attention to detail. Strong communication and collaboration skills. \n\nThe Nice-to-Haves\n\nExperience in performance testing tools like JMeter or LoadRunner. Familiarity with cloud environments (e.g., AWS, Azure) and containerization tools (e.g., Docker, Kubernetes). Knowledge of security testing and tools. ISTQB or equivalent certification. \n\nWhy Join Us?\n\nImpactful Work: Contribute to delivering high-quality software solutions that make a difference. Collaborative Culture: Work with a supportive team that values innovation and excellence. Professional Growth: Access opportunities for training, mentorship, and career advancement. Flexible Work: Benefit from competitive compensation, bonus opportunities, and remote working arrangements. \n\nOur Core Values \n\nWe See you. (The one about empathy) We not only understand, but we feel what customers and candidates are experiencing We take care. (The one about Thoughtfulness) We use deep understanding to take careful, intentional action that improves experiences. We’ve got this. (The one about collaboration We have complete trust in each other’s unique skills and know we will succeed as a team when we work together. We’re all in. (The one about focus) We’re obsessed with experiences that move people, and we use this discipline to stay aligned with our mission: to deliver the best possible candidate and customer experience. We make it happen. (The one about action) We’re never static. Our expertise, solutions and service are constantly evolving, and we’re always innovating to deliver competitive advantage \n\nApply Now\n\nIf you’re a skilled Junior QA Automation Engineer with a passion for quality and innovation, we’d love to hear from you. Join Happydance and help us deliver exceptional digital experiences to our clients and users.",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": null,
          "applicants": 78,
          "views": 271,
          "jobApplicationLimitReached": false,
          "applyMethod": "https://apply.jobadder.com/eu3/1618/623514/idlf2cifrivujjyrvyljccuthe",
          "salary": null,
          "company": {
              "specialities": [
                  "SEO",
                  "CMS",
                  "recruitment",
                  "job search",
                  "career",
                  "create a website",
                  "responsive web design",
                  "happydance",
                  "website",
                  "website templates",
                  "socialtools",
                  "mobile",
                  "enterprise",
                  "careers",
                  "online business",
                  "hiring",
                  "employer",
                  "employer brand",
                  "partnership",
                  "content creation",
                  "careers sites",
                  "Quick apply",
                  "analytics dashboard",
                  "mid-market",
                  "AI",
                  "internal mobility"
              ],
              "industries": [
                  "Software Development"
              ],
              "locations": [
                  {
                      "city": "Liverpool",
                      "state": "England",
                      "country": "UK"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/happydance-love",
              "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQFCFSH2ctqf1Q/company-logo_400_400/B4EZT_J0pVGYAY-/0/1739447552940/happydance_love_logo?e=1757548800&v=beta&t=USxVmHhEdF-9f8IWHQc-Q6WVxqkqbA5HMdqrYqkOJBg",
              "website": null,
              "name": "Happydance Careers Websites",
              "employeeCount": 41,
              "followerCount": 1524,
              "description": "Happydance is a HR-tech Saas platform that configures tailored careers websites for mid-market and enterprise companies. Built by experts in employer branding and candidate experience, our platform combines world-class performance, flexibility and reliability to engage high-quality candidates and drive conversions. Unlike one-size-fits-all solutions, Happydance integrates seamlessly with your tech stack, providing the actionable insights and in-built tools you need to optimize every step of the hiring journey. From dynamic storytelling to advanced analytics, every feature is designed to forge meaningful connections between candidates and employers. Our concierge-level service provides a seamless, stress-free experience every step of the way—from design to implementation—ensuring your careers website works flawlessly and exceeds expectations. We constantly develop our platform, release new features, and expand our services, delivering continual improvements that keep your careers website at the forefront of innovation. With Happydance, you don’t just deliver a careers website—you create experiences that move people, inspire talent, and drive hiring success."
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 0.2,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0.33,
          "kpi_salary": 0.5,
          "kpi_company_size": 0.3,
          "kpi_company_popularity": 0.5,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 0.2,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 0.2,
          "final_score": 0.51,
          "tier": "Yellow"
      },
      {
          "id": "4263381170",
          "title": "Salesforce QA Tester",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4263381170/",
          "postedDate": "2025-07-09T13:55:21.000Z",
          "expireAt": "2025-08-08T13:55:20.000Z",
          "descriptionText": "Salesforce QA Tester | Remote | £40,000 - £50,000\nI'm working with an innovative company seeking a Salesforce QA Tester to join their team. This company is at the forefront of a significant transformation, providing you with a unique opportunity to influence a greenfield project from its inception.\nAlthough they have offices in the Midlands, they offer a fully remote working arrangement, fostering a flexible and supportive work environment. This company is characterised by its small, friendly atmosphere where collaboration and personal growth are highly valued. Their ongoing projects are not just transformative for the business but also offer significant learning and development opportunities for their employees.\nAs a Salesforce QA Tester here, you will play a pivotal role in ensuring the quality and reliability of Salesforce implementations, with a strong focus on telephony integrations and Salesforce CPQ. You’ll work closely with developers, business analysts, and release managers to validate complex configurations and ensure seamless user experiences.\nKey Responsibilities:Test and validate Salesforce CPQ configurations and telephony integrations.Collaborate with developers and stakeholders to ensure accurate implementation of pricing, quoting, and call-handling workflows.Identify and troubleshoot issues across the Salesforce platform, including CPQ logic and telephony flows.Support end-to-end testing cycles and contribute to continuous improvement of QA processes.\nIdeal Candidate:Proven experience testing Salesforce CPQ and/or telephony solutions (e.g., Amazon Connect, Genesys, Twilio).Strong understanding of Salesforce data models, quoting processes, and call routing logic.Familiarity with Git and CI/CD tools is a plus.Excellent problem-solving skills and attention to detail.Open to candidates from various backgrounds who are eager to grow in a QA role with a focus on CPQ and telephony.\nSound interesting? Click APPLY to find out more or get in touch at kim.ocallaghan@opusrs.com",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": "https://www.linkedin.com/job-apply/4263381170",
          "applicants": 115,
          "views": 372,
          "jobApplicationLimitReached": false,
          "applyMethod": null,
          "salary": "40,000 - 50,000 GBP",
          "company": {
              "specialities": [
                  "Recruitment Consultants",
                  "Temporary and permanent",
                  "tech recruitment",
                  "technology",
                  "employment",
                  "tech jobs",
                  "IT recruitment",
                  "recruitment",
                  "tech job",
                  "recruiters",
                  "Engineering ",
                  "Oil & Gas"
              ],
              "industries": [
                  "Staffing and Recruiting"
              ],
              "locations": [
                  {
                      "city": "Bristol",
                      "state": "England",
                      "country": "UK"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/opus-recruitment-solutions",
              "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQGOdHzm8-upKw/company-logo_400_400/B4EZfGnn0nHcAg-/0/1751383965541/opus_recruitment_solutions_logo?e=1757548800&v=beta&t=IjVhKXB94LcuO6PNixWUvCHwYWwRccNBT3nKrSd--U0",
              "website": null,
              "name": "Opus Recruitment Solutions",
              "employeeCount": 222,
              "followerCount": 605991,
              "description": "When it comes to technology talent, Opus Recruitment Solutions are the specialists. We provide the skills needed most to markets at the forefront of change, evolving with the ever-changing needs of our clients to propel their people strategy and build world-class teams to power the future. \n\nWith a global reach, diverse networks and an established market reputation, we are the partner of choice for organisations looking for flexible and trusted technology talent solutions to achieve long-term success.\n\nOur clients work across the private, public and third sectors, but all have one thing in common: they are at the cutting edge of their field and they need a talent partner with the vision, reach and capabilities to get them there. \n\nRoles we recruit for include: \nDigital & Design\nBack End Development\nProject Services\nSAP\nInfrastructure\nCore Technology\nMechanical / Electrical Engineering\nEmbedded / Electronics Engineering\nSenior Appointments – Engineering\n"
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 0.5,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0,
          "kpi_salary": 0.2,
          "kpi_company_size": 0.6,
          "kpi_company_popularity": 1,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 0.4,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0.33,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 0.5,
          "final_score": 0.6,
          "tier": "Yellow"
      },
      {
          "id": "4165422920",
          "title": "Service Designer Consultant (SC Cleared)",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4165422920/",
          "postedDate": "2025-07-10T08:25:33.000Z",
          "expireAt": "2026-04-22T11:55:45.000Z",
          "descriptionText": "My client is a global leading Digital Consultancy specialising in Cloud Adoption, Digital Architecture/Transformation & NextGen AI Solutions, with offices in London, Manchester and Glasgow providing a flexi working model (option of remote or hybrid + ad hoc client site travel)\nThey are looking for a permanent Service Designer Consultant to join a rapidly growly team, working across multiple Digital Transformation projects within Government, Finance, Retail & Energy sectors.\nWe have a top end budget of £55k + full benefits + fully remote (with ad hoc client site travel)\nPrimary skills and experience required:Must hold active SC ClearanceProven experience working across a service design process, autonomously with minimal supportAbility to create service design artefacts and outputs, such as current and future-state user journeys, personas, service concepts, service blueprints and other artefactsClient readiness’, with experience facilitating workshops, design sprints, ideation sessions or similarAbility to visualise complex services in an easy-to-understand format for varying audiencesAbility to adopt a curious and inquisitive mindset – with a passion for asking ‘why’Ability to critically break down complex problems in a fast-paced environment, with a knack for storytellingStrong understanding and experience of working in an agile (scrum) environment in a cross-functional team including but not limited to user researchers, UX/UI designers, business analysts, product owners, delivery managers and developersStrong stakeholder Management experiencePresales experience would be advantageous; including bidding, RFP's, Demos & Presentations",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": "https://www.linkedin.com/job-apply/4165422920",
          "applicants": 91,
          "views": 721,
          "jobApplicationLimitReached": false,
          "applyMethod": null,
          "salary": "55,000 - 55,000 GBP",
          "company": {
              "specialities": [
                  "Contract Recruitment",
                  "Permanent Recruitment",
                  "Search & Selection",
                  "Scala",
                  "JavaScript",
                  "Java",
                  "iOS",
                  "Android",
                  "Product Management",
                  "User Research",
                  "UX Design",
                  "Digital",
                  "Big Data",
                  "C-Suite Appointments",
                  "SAP",
                  "Salesforce",
                  "Digital Content Design / Copywriting",
                  "Go",
                  "Data Science",
                  "Data Analytics",
                  ".NET",
                  "DevOps Engineering",
                  "Digital Workplace",
                  "Talent Acquisition"
              ],
              "industries": [
                  "Business Consulting and Services"
              ],
              "locations": [
                  {
                      "city": "London",
                      "state": "England",
                      "country": "UK"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/stealth-it-consulting",
              "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQGlkFIb9PMVFQ/company-logo_400_400/company-logo_400_400/0/1732137849836/stealth_it_consulting_logo?e=1757548800&v=beta&t=RTq1L1_ES0INgUvpLUlWMWooqMyuwX3mwBXX04doA5Y",
              "website": null,
              "name": "Stealth iT Consulting",
              "employeeCount": 17,
              "followerCount": 43486,
              "description": "We are a Digital, Data and Cloud technology consultancy, specialising in delivering solutions to clients across financial services, government, management consulting/outsourcing, media and broadcasting. Our extensive experience allows us to provide a specialised, individually tailored service backed by consultants that have industry specific knowledge to better understand your needs. Our expertise are complemented by the use of leading-edge technologies.\n\nWe work with some of the UK’s leading companies, as well as being retained by some of the largest global brands. Being independently owned, we are able to offer a flexible and highly dynamic service with a strong emphasis on the delivery of robust solutions in a professional and customer focused approach.\n\nWe specialise in providing solutions with the following disciplines:\n\n- DevOps Consulting – Platform Engineering / SRE / DevSecOps / Cloud Eco\n- Cloud Platform Architecture - Azure / AWS / GCP / Oracle\n- Software Development - Scala / Java / JavaScript / .NET / Fullstack\n- Solution Architecture – Digital / Apps / Integration / Infrastructure / Data\n- Transformation & Change – Programme / Portfolio / Project Managers\n- Digital & Modern Workplace Consulting - M365 / Power Platform / G-Suite \n- Agile Consulting - Product Owners / Agile Coaches / Scrum Masters / BAs\n- UX / UCD Specialists - UXs / URs / Service Designers / Content Designers\n- Cyber Security Specialists - Architects / Analysts / Threat Intelligence\n- Data Science & Data Analytics Specialists – BI / AI / ML\n- SAP - Functional / Technical Consulting\n- Salesforce – Functional / Technical Consulting\n- Testing – Automation / Manual / Accessibility / Integration\n- Mobile Apps - iOS Developers / Android Developers"
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 1,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 1,
          "kpi_salary": 0.2,
          "kpi_company_size": 0.3,
          "kpi_company_popularity": 0.6,
          "kpi_industry_match": 0,
          "kpi_job_popularity": 0.4,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 0.5,
          "final_score": 0.61,
          "tier": "Yellow"
      },
      {
          "id": "4254353475",
          "title": "UX Designer Consultant (SC Eligible)",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4254353475/",
          "postedDate": "2025-07-10T08:29:34.000Z",
          "expireAt": "2025-11-22T15:10:27.000Z",
          "descriptionText": "My client is a global leading Digital Consultancy specialising in Cloud Adoption, Digital Architecture/Transformation & NextGen AI Solutions, with offices in London, Manchester and Glasgow providing a remote first policy + ad hoc client site visits when required (on average 1-2 visits per month, but can be more/less).\nThey are looking for a permanent User Experience/UX Designer Consultant to join a rapidly growing team, working across multiple Digital Transformation projects within Government, Finance, Retail & Energy sectors and we have a top end budget of £55000 + full bens available.\nPrimary skills and experience required:Must be eligible for SC ClearanceGrounding in user-centred design, from concept to final delivery.Ability to build prototypes using code to create dynamic prototypes using HTML, CSS and JavaScript.Experience using a range of design tools such as Figma, Sketch, Adobe XD, Invision Studio, Axure etc - Figma is a must, the others are seen as more of a nice to haveAbility to present designs and justify decisions you’ve made using an evidence-based approach.Proven Stakeholder Management and Client Engagement experienceProven ability to create high-quality, compelling design concepts and artefacts such as personas, service maps and wireframes.Experienced in rapid paper and digital prototyping.Any experience working with GDS Prototyping Toolkit would also be highly advantageous, but not a must- have requirement",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": "https://www.linkedin.com/job-apply/4254353475",
          "applicants": 93,
          "views": 431,
          "jobApplicationLimitReached": false,
          "applyMethod": null,
          "salary": "55,000 - 55,000 GBP",
          "company": {
              "specialities": [
                  "Contract Recruitment",
                  "Permanent Recruitment",
                  "Search & Selection",
                  "Scala",
                  "JavaScript",
                  "Java",
                  "iOS",
                  "Android",
                  "Product Management",
                  "User Research",
                  "UX Design",
                  "Digital",
                  "Big Data",
                  "C-Suite Appointments",
                  "SAP",
                  "Salesforce",
                  "Digital Content Design / Copywriting",
                  "Go",
                  "Data Science",
                  "Data Analytics",
                  ".NET",
                  "DevOps Engineering",
                  "Digital Workplace",
                  "Talent Acquisition"
              ],
              "industries": [
                  "Business Consulting and Services"
              ],
              "locations": [
                  {
                      "city": "London",
                      "state": "England",
                      "country": "UK"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/stealth-it-consulting",
              "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQGlkFIb9PMVFQ/company-logo_400_400/company-logo_400_400/0/1732137849836/stealth_it_consulting_logo?e=1757548800&v=beta&t=RTq1L1_ES0INgUvpLUlWMWooqMyuwX3mwBXX04doA5Y",
              "website": null,
              "name": "Stealth iT Consulting",
              "employeeCount": 17,
              "followerCount": 43486,
              "description": "We are a Digital, Data and Cloud technology consultancy, specialising in delivering solutions to clients across financial services, government, management consulting/outsourcing, media and broadcasting. Our extensive experience allows us to provide a specialised, individually tailored service backed by consultants that have industry specific knowledge to better understand your needs. Our expertise are complemented by the use of leading-edge technologies.\n\nWe work with some of the UK’s leading companies, as well as being retained by some of the largest global brands. Being independently owned, we are able to offer a flexible and highly dynamic service with a strong emphasis on the delivery of robust solutions in a professional and customer focused approach.\n\nWe specialise in providing solutions with the following disciplines:\n\n- DevOps Consulting – Platform Engineering / SRE / DevSecOps / Cloud Eco\n- Cloud Platform Architecture - Azure / AWS / GCP / Oracle\n- Software Development - Scala / Java / JavaScript / .NET / Fullstack\n- Solution Architecture – Digital / Apps / Integration / Infrastructure / Data\n- Transformation & Change – Programme / Portfolio / Project Managers\n- Digital & Modern Workplace Consulting - M365 / Power Platform / G-Suite \n- Agile Consulting - Product Owners / Agile Coaches / Scrum Masters / BAs\n- UX / UCD Specialists - UXs / URs / Service Designers / Content Designers\n- Cyber Security Specialists - Architects / Analysts / Threat Intelligence\n- Data Science & Data Analytics Specialists – BI / AI / ML\n- SAP - Functional / Technical Consulting\n- Salesforce – Functional / Technical Consulting\n- Testing – Automation / Manual / Accessibility / Integration\n- Mobile Apps - iOS Developers / Android Developers"
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 1,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 1,
          "kpi_salary": 0.2,
          "kpi_company_size": 0.3,
          "kpi_company_popularity": 0.6,
          "kpi_industry_match": 0,
          "kpi_job_popularity": 0.4,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 0.5,
          "final_score": 0.61,
          "tier": "Yellow"
      },
      {
          "id": "4260103326",
          "title": "Lead Industrial Product Designer [349]",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4260103326/",
          "postedDate": "2025-07-10T10:28:22.000Z",
          "expireAt": "2025-12-30T10:51:30.000Z",
          "descriptionText": "About the Company:Manta Sleep - was founded in 2016, and their team specializes in creating innovative sleep accessories designed to enhance sleep quality. Their flagship products include a variety of sleep masks and sleep accessories, all engineered to provide perfect sleep conditions for their users. The company is a strong advocate for the Pro-Nap Movement, promoting the benefits of regular napping and challenging traditional corporate norms that discourage rest during work hours. Their mission centers on empowering individuals to unlock their full potential through better sleep, offering products that cater to various sleep needs and preferences.\nAbout the Role:We are looking to hire a mature and experienced Lead Industrial Product Designer who will be responsible for shaping the company’s product vision and leading the design team to create innovative sleep products that resonate with customers. You will work hands-on in a fast-growing e-commerce environment, balancing strategic planning with execution while managing a small but expanding team of designers and product managers.\nThe role requires a deep understanding of user needs, ensuring that each product launched not only meets high design standards but also drives business growth. Collaboration is key, as you will work closely with product design, marketing, and report directly to leadership to bring products to market successfully. With a global team spread across Europe and Asia, the candidate must be adaptable and capable of leading design efforts in a highly dynamic, entrepreneurial setting.\nThis is a Full-Time remote role.Salary Range: 70- 100k USD annually\nWe are looking for a Lead Industrial Product Designer specifically with these requirements:\nIdeally, 5-10 years of experience in a Product Design role, having both hands-on and leadership experience.Previous experience in a smaller to mid-sized E-commerce business, with at least a $30M-$50M revenue.Experience designing soft products or similar (home or textile goods) is a must.Proven track record of building and managing small design teams.Ability to plan for product launches over the next 3+ years.Understanding of how to create products that customers love and that are feasible from the engineering side.Experience working closely with the product and marketing teams, and with external agencies when needed.Comfortable making decisions in a fast-paced environment with limited corporate infrastructure.Experience working with international teams across different time zones.Open to occasional travel, especially to Asia, for product development purposes.Strong communication and leadership skills, while being able to find a good balance between creative ideas and feasible solutions.\n\nYour responsibility will include (but not limited to):\nDevelop and implement a long-term product design strategy aligned with business growth objectives.Be directly involved in design processes, from concept to launch, ensuring a balance of vision and execution.Oversee the design and launch of products that drive customer engagement and sales.Build, manage, and mentor a growing team of designers and product managers.Foster a hands-on, collaborative environment where creativity and efficiency thrive.Work closely with the product, marketing, and leadership team to bring products to market successfully.Ensure seamless coordination between design, production, engineering and marketing efforts.Iterate on product design based on user feedback, data, and market trends.Stay updated on design trends, customer preferences, and industry innovations.Use data-driven insights to enhance product design and user experience.Occasional travel to Asia - approx 3 times a year for product development and production coordination.\nGrowth Opportunities/Perks:\nFreedom and control over your schedule.Open and transparent workplace.Freedom to be creative and own your work.No office politics or bureaucracyGreat growth opportunities and training resources.Unlimited vacation and sick leave days.\nThis Position Is Perfect For You If…\nYou're a visionary problem solver.You won’t be expected to have all the answers from day one, but you’ll need to think strategically, adapt quickly, and drive innovative product designs that align with business goals.\nYou're highly organized and hands-on.You can balance big-picture vision with hands-on execution, ensuring that design projects move forward smoothly while leading and growing a small, agile team.\nYou're passionate about creating products people love.You understand the intersection of design, functionality, and customer needs, ensuring that every product developed is not just well-designed but also highly desirable and marketable.\n\nOur hiring process is made up of four parts, so please be aware that you will need to dedicate time for a questionnaire, a video, and two 1-on-1 interviews.Thank you for taking the time to consider this position. I look forward to hearing from you soon!",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": null,
          "applicants": 788,
          "views": 4272,
          "jobApplicationLimitReached": false,
          "applyMethod": null,
          "salary": null,
          "company": {
              "specialities": [],
              "industries": [
                  "Business Consulting and Services"
              ],
              "locations": [
                  {
                      "city": "Sheridan",
                      "state": "Wyoming",
                      "country": "United States"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/letsremotivate",
              "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQFlXbpHjcE2iQ/company-logo_400_400/company-logo_400_400/0/1630523419626/remotivate_plc_logo?e=1757548800&v=beta&t=Br5c7yCm6377pYoJofEhVTcOUXO1op3S54WdN9qyoq4",
              "website": null,
              "name": "Remotivate",
              "employeeCount": 18,
              "followerCount": 286832,
              "description": "Remotivate helps digital companies find remote superstar talent in leadership and management roles, using a proprietary vetting and filtering process so you can focus on growing your business."
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 0.2,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 0,
          "kpi_salary": 0.5,
          "kpi_company_size": 0.3,
          "kpi_company_popularity": 0.9,
          "kpi_industry_match": 0,
          "kpi_job_popularity": 0.6,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 1,
          "final_score": 0.57,
          "tier": "Yellow"
      },
      {
          "id": "4261165037",
          "title": "User Experience Designer (UX/UI)",
          "linkedinUrl": "https://www.linkedin.com/jobs/view/4261165037/",
          "postedDate": "2025-07-09T17:39:32.000Z",
          "expireAt": "2025-08-08T17:39:32.000Z",
          "descriptionText": "Job Title: UX/UI Designer (Mid-Level) Industry: Access Management Solutions/SaaSLocation: Remote (Please only apply if based in UK - this is mandatory)Salary Range: Circa £55,000\nWeDo have partnered with a business who are considered to be a market leader in the key and access management field. As a business, they have a wide product portfolio underpinned by complex technology/IoT. They have also recently merged with their sister company which only adds to their project portfolio. Off the back of this merger and recent promotions, this has led to an opportunity for a UX designer (with an appreciation for UI) to join at what is arguably one of the most exciting growth periods for the business. This is working alongside a phenomenal UX Architect who we onboarded circa 2 years back....\nRequirements;-Initially working with one relatively small engineering team, you will be presenting and communicating design concepts to a range of stakeholders The product lends itself to someone who has a \"functional\" mindset, ideally with a background in embedded apps/SaaS/tooling Adobe XD/Figma with a strong portfolio Understanding of front-end principles - HTML/CSS (no coding required) Prototyping conveying concept designs to stakeholders/end users A pragmatic but also, growth mindset \nThis is a remote opportunity with very occasional travel - one day every couple of months.Interview slots are available with an expected turnaround time to be 7-14 days from start to finish. Two stage process, likely to include a presentation/walk-through of a solution. \nThere is no sponsorship on offer and you need to be based in the UK to be considered for this one.Please apply now for further consideration.",
          "employmentType": "full_time",
          "workplaceType": "remote",
          "easyApplyUrl": "https://www.linkedin.com/job-apply/4261165037",
          "applicants": 282,
          "views": 657,
          "jobApplicationLimitReached": false,
          "applyMethod": null,
          "salary": "50,000 - 60,000 GBP",
          "company": {
              "specialities": [
                  "Recruitment ",
                  "Growth ",
                  "Consultancy ",
                  "Software Development ",
                  "Product",
                  "UX",
                  "QA",
                  "Devops",
                  "SoW",
                  "Contract ",
                  "Retained",
                  "Contingent ",
                  "Data ",
                  "Networking ",
                  "Community",
                  "Welfare ",
                  "Coaching",
                  "Personal Growth "
              ],
              "industries": [
                  "Staffing and Recruiting"
              ],
              "locations": [
                  {
                      "city": "Bristol",
                      "state": "England",
                      "country": "UK"
                  }
              ],
              "linkedinUrl": "https://www.linkedin.com/company/wedo-tech-solutions-limited",
              "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQFMfLH6pGbAVQ/company-logo_400_400/company-logo_400_400/0/1658159537365/wedo_tech_solutions_limited_logo?e=1757548800&v=beta&t=_tkCUuRlcNtg7YxEkJP9WHH5zjaM0XMMpBrD2BHTYdg",
              "website": null,
              "name": "WeDo ",
              "employeeCount": 37,
              "followerCount": 40523,
              "description": "At Wedo, we believe recruitment is more than just filling roles - it’s about building lasting relationships and creating value beyond the hire. Our mission? To be the most recommended recruitment agency in the UK.\n\nWe specialise in Tech, Data, and Product hiring, offering contract, permanent, and project-led solutions designed to complement your direct sourcing strategy.\n\nOur Expertise:\n🔹 Microsoft Cloud, D365 & Power Platform (F&O, CE, SCM) – UK & Europe\n🔹 Software Engineering, Architecture & Product Leadership – FinTech, Payments, Credit, Lending & RegTech\n\nInspired by Surrounded by Idiots, we embed behavioral understanding into our process because hiring isn’t just about skills - it’s about people. We know every hiring situation is unique, and while we may not be the perfect fit for everyone, we’d love to learn more about you or your business and explore how we can support your hiring needs."
          },
          "kpi_jd_quality": 1,
          "kpi_domain_fit": 1,
          "kpi_seniority_alignment": 1,
          "kpi_location_priority": 0.6,
          "kpi_company_specialties": 1,
          "kpi_salary": 0.2,
          "kpi_company_size": 0.3,
          "kpi_company_popularity": 0.6,
          "kpi_industry_match": 0.33,
          "kpi_job_popularity": 0.4,
          "kpi_job_freshness": 0.5,
          "kpi_employment_type": 1,
          "kpi_contact_info": 0,
          "kpi_skills_explicitness": 1,
          "kpi_experience_threshold": 0.5,
          "final_score": 0.63,
          "tier": "Yellow"
      }
  ]
}