[
  {
    "id": "4264428501",
    "title": "Developer",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4264428501/",
    "postedDate": "2025-07-14T08:31:24.000Z",
    "expireAt": "2025-08-13T08:31:23.000Z",
    "descriptionText": "Lead/Senior Java Developer – High-Performance Systems | Cloud | Observability | LeadershipWe're on the hunt for a Lead Java Developer (or a strong Senior Developer ready to step up) to join our dynamic team. If you’re passionate about building high-performance systems, driving modern architecture, and leading from the front—this is your next challenge.\nWhat You’ll Bring:8+ years of Java experience with deep knowledge of Spring Boot, Hibernate, and RESTful APIsStrong front-end skills in Angular or ReactCloud fluency in AWS (certifications like Cloud Practitioner/Architect Essentials a plus)Experience with Docker, Kubernetes, and observability tools like New RelicHands-on with Git, CI/CD pipelines, and Agile practicesProven leadership and a passion for mentoring and delivery excellence\nBonus Points For:Microservices architectureDevOps mindset and toolingAdvanced database knowledge (SQL/NoSQL)\nFull-time | Modern tech stack | Collaborative culture",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": "https://www.linkedin.com/job-apply/4264428501",
    "applicants": 534,
    "views": 2372,
    "jobApplicationLimitReached": false,
    "applyMethod": null,
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/explore-group",
      "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQFfdHWkdiV1_A/company-logo_400_400/company-logo_400_400/0/1704297956755/explore_group_logo?e=1755129600&v=beta&t=KTsCryZ5JRvs8eAyRXokSsaNfK1_al-O7CxJ7YRI7KI",
      "website": null,
      "name": "Explore Group",
      "employeeCount": 145,
      "followerCount": 281781,
      "description": "The Explore Group has been helping companies recruit top talent in the ever-evolving world of technology since 2005.  We’ve adapted alongside the changing IT market to become increasingly specialist enabling us to support our customers on their journey through the new digital economy.  Our niche divisions of Open Source, Cloud, DevOps, Mobile, Digital Marketing and Technology now provide both candidates and clients with the knowledge, market insight and advice that they need to build great teams now and for the future.  \n \nThe Technology sector is one of the UK’s leading economic success stories but this can only continue if organisations secure top talent in an increasingly competitive market.  Explore has evolved to consistently deliver that top talent through carefully tailored services using leading recruitment technology, candidate attraction techniques, embedding ourselves deeply in our candidates’ world and relentlessly learning the intricacies of supply and demand in each niche.  \n\nWe believe that our core values of integrity, expertise, partnership, passion and collaboration are also key to helping our customers succeed.  We are committed to continuous improvement, innovation and knowledge sharing and try to add value wherever possible for our customers whilst keeping the recruitment process simple and easy \nRecruitment will always be a people business and our success is built on the strong long lasting relationships we have with our customers.  We always encourage our staff to ‘do the right thing’ from providing an honest and open level of service to delivering on all promises.  We also support them through extensive training and coaching to create new ideas, experiment and look at issues in new ways enabling us to unearth new solutions that we can share so everyone has the knowledge and information to succeed\n",
      "specialities": [
        "Project Management",
        "iOS",
        "QA",
        "Mobile",
        "PHP",
        "UX/UI",
        "Digital Marketing",
        "DevOps",
        "Open Source",
        "Cloud",
        "Sitecore",
        "Recruitment",
        "Staffing",
        "Jobs",
        "Android",
        "Java",
        "Ruby",
        "Microservices",
        "Python",
        "software development"
      ],
      "industries": [
        "Staffing and Recruiting"
      ],
      "locations": [
        {
          "city": "London",
          "state": "England",
          "country": "UK"
        }
      ]
    }
  },
  {
    "id": "4263892664",
    "title": "Senior DevOps / Infrastructure Engineer",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4263892664/",
    "postedDate": "2025-07-13T17:23:24.000Z",
    "expireAt": "2026-01-09T17:23:24.000Z",
    "descriptionText": "Purpose:Help us scale a high-performance, AI-powered trading platform. You’ll be the backbone, ensuring our infrastructure is stable, secure, and lightning fast. No fluff. Real systems. Real impact.Responsibilities:Build, secure, and monitor cloud-native infrastructure (preferably GCP)Set up CI/CD pipelines for multiple AI & data appsAutomate deployments, backups, and recovery systemsMonitor performance, logging, and error reporting for live trading environmentsCollaborate with AI and backend teams to ensure fast delivery with zero downtimeMust-Have Skills:Docker, Kubernetes, Terraform, or similar IaC toolsGitHub Actions / GitLab CI / Jenkins pipelinesStrong Linux / networking skillsProficient in scripting: Bash / PythonFamiliarity with monitoring tools: Prometheus, Grafana, Loki, ELK, etc.Experience securing cloud deployments (IAM, secrets, VPC configs) Bonus If You Have:Experience supporting real-time systems or trading platformsAWS CDK, GCP Cloud Composer, or similar toolsKnowledge of financial systems (FIX protocol, latency optimization)Incident response or SRE experience Don't apply if:You're focused only on web app infrastructure or marketing sitesYou dislike shell work or debugging broken pipelinesYou need a detailed Jira ticket to take action",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": "https://www.linkedin.com/job-apply/4263892664",
    "applicants": 244,
    "views": 654,
    "jobApplicationLimitReached": false,
    "applyMethod": null,
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/automatedtrading",
      "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQGzcXGpTvDYXA/company-logo_400_400/company-logo_400_400/0/1705428534634/automatedtrading_logo?e=1755129600&v=beta&t=EXvNIDkuDkVmHmaZTyJIVzARHPuEphR3bHiViluL9fY",
      "website": null,
      "name": "Automated Trading",
      "employeeCount": 13,
      "followerCount": 1266,
      "description": "We are a cutting-edge financial technology firm, providing automated trading solutions and advanced analytics tools tailored for investors along with a range of consulting services. These tools help investors navigate and thrive in the dynamic Capital Markets.\n\nWe equip investment professionals with automated trading tools that are not only powerful but also cost-effective. This ensures that our clients can execute sophisticated trading strategies, gain deeper market insights, and improve investment outcomes without incurring excessive costs.\n\nVision:\nEmpowering customers with the intelligent technology, trading made smarter.\n\nMission:\nTo equip financial professionals with the most advanced tools available to navigate and thrive in the dynamic environment of the Saudi capital markets.",
      "specialities": [
        "Algorithmic Trading Solutions",
        "Real-Time Data Analysis",
        "Fintech Innovation",
        "Artificial Intelligence",
        "Software as a service (SaaS)",
        "Financial Data",
        "LLM",
        "NLP"
      ],
      "industries": [
        "Financial Services"
      ],
      "locations": [
        {
          "city": "Riyadh",
          "state": "Riyadh",
          "country": "Saudi Arabia"
        }
      ]
    }
  },
  {
    "id": "4263150685",
    "title": "Full Stack Developer, Trilogy (Remote) - $60,000/year USD",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4263150685/",
    "postedDate": "2025-07-14T08:55:17.000Z",
    "expireAt": "2025-10-07T00:24:33.000Z",
    "descriptionText": "Ready to revolutionize software development with AI? We're not just looking for another coder—we're seeking a visionary Full Stack Developer who's ready to leave traditional development practices in the dust.\n\nAt Trilogy, we're redefining what's possible in software engineering. While others are still debugging manually and treating AI as an afterthought, we've built an ecosystem where AI isn't just a tool—it's the backbone of our entire development process. From ideation to deployment, every line of code is enhanced by cutting-edge AI capabilities.\n\nThis role is your chance to transform legacy B2B products into sleek, AI-powered cloud-native applications. You'll be at the forefront of implementing retrieval-augmented generation (RAG) systems and crafting zero-downtime deployments. We move fast, ship faster, and leave analysis paralysis at the door.\n\nIf you're energized by the idea of pushing AI-driven development to its limits and building the future of enterprise software, you're our kind of developer. But if you're comfortable with manual testing and resistant to automation, you might want to look elsewhere.\n\nWhat You Will Be Doing\n\nMaster the art of AI-powered debugging using sophisticated RAG vector stores and analysis toolsOrchestrate AI development agents to craft and deploy groundbreaking features in cloud-native environmentsDrive innovation as part of an elite global team delivering enterprise-level solutions\n\nWhat You Won’t Be Doing\n\nWrestling with tedious infrastructure tasks - we've automated the boring stuffWatching the clock in endless meetings - we believe in maximizing your coding time\n\nFull Stack Developer Key Responsibilities\n\nPioneer AI-enhanced features that transform service provider workflows and deliver unprecedented efficiency gains\n\nBasic Requirements\n\nProven track record with 4+ years crafting production-grade server-side web applicationsHands-on expertise with modern GenAI tools like Github Copilot, Cursor, or v0.dev (traditional ML experience alone won't cut it)Enthusiasm for incorporating GenAI into your daily development workflow\n\nAbout Trilogy\n\nHundreds of software businesses run on the Trilogy Business Platform. For three decades, Trilogy has been known for 3 things: Relentlessly seeking top talent, Innovating new technology, and incubating new businesses. Our technological innovation is spearheaded by a passion for simple customer-facing designs. Our incubation of new businesses ranges from entirely new moon-shot ideas to rearchitecting existing projects for today's modern cloud-based stack. Trilogy is a place where you can be surrounded with great people, be proud of doing great work, and grow your career by leaps and bounds.\n\nThere is so much to cover for this exciting role, and space here is limited. Hit the Apply button if you found this interesting and want to learn more. We look forward to meeting you!\n\nWorking with us\n\nThis is a full-time (40 hours per week), long-term position. The position is immediately available and requires entering into an independent contractor agreement with Crossover as a Contractor of Record. The compensation level for this role is $30 USD/hour, which equates to $60,000 USD/year assuming 40 hours per week and 50 weeks per year. The payment period is weekly. Consult www.crossover.com/help-and-faqs for more details on this topic.\n\nCrossover Job Code: LJ-3889-SA-Riyadh-FullStackDevel1.015\n\n",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 284,
    "views": 1139,
    "jobApplicationLimitReached": false,
    "applyMethod": "https://www.crossover.com/roles/a0s0o00000NhIN0AAN/full-stack-developer/apply?utm_source=linkedin&utm_medium=jobslot&utm_campaign=LJ-3889-SA-Riyadh-FullStackDevel1.015",
    "salary": "30 - 30 USD",
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/trilogy",
      "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQHo46awkKVsFg/company-logo_400_400/B4DZY4U_eJHAAY-/0/1744701749693/trilogy_logo?e=1755129600&v=beta&t=TAxQSqatfYbow1F6fi7rca71uhnQbs6ymHsMMydxFVA",
      "website": null,
      "name": "Trilogy",
      "employeeCount": 1217,
      "followerCount": 222943,
      "description": "Trilogy acquires software companies and fundamentally transforms them with an AI-first strategy. We embed AI and automation deep into operations – from development to support – to unlock radical efficiency and drive growth.\n\nPowered by the top 1% of global remote talent sourced via Crossover, we refine proprietary playbooks to build the future of intelligent, high-performance software operations. Join us at the cutting edge.",
      "specialities": [
        "Automotive configuration software",
        "Financial services channel compensation software",
        "telecommunications network management software",
        "telecommunications channel compensation software"
      ],
      "industries": [
        "Software Development"
      ],
      "locations": [
        {
          "city": "Austin",
          "state": "Texas",
          "country": "United States"
        }
      ]
    }
  },
  {
    "id": "2902876557",
    "title": "Junior Software Developer - Observability",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/2902876557/",
    "postedDate": "2025-07-13T12:13:55.000Z",
    "expireAt": "2026-07-12T20:30:48.000Z",
    "descriptionText": "Canonical is a leading provider of open source software and operating systems to the global enterprise and technology markets. Our platform, Ubuntu, is very widely used in breakthrough enterprise initiatives such as public cloud, data science, AI, engineering innovation, and IoT. Our customers include the world's leading public cloud and silicon providers, and industry leaders in many sectors. The company is a pioneer of global distributed collaboration, with 1200+ colleagues in 75+ countries and very few office-based roles. Teams meet two to four times yearly in person, in interesting locations around the world, to align on strategy and execution.\n\nThe company is founder-led, profitable, and growing.\n\nWe are hiring a Junior developer with a proven track record in Python and/or Go. As part of the Observability team, you will develop a cloud-native monitoring stack that composes best-in-class open-source monitoring tools. The stack is opinionated, resilient, and scalable, providing deep insights out of the box. The user experience is polished and seamless for the end-users, and its administrators will enjoy smooth, lightweight Day 1 and Day 2 operations.\n\nThis is an exciting opportunity for a software engineer passionate about open source software, Linux, Kubernetes, and Observability. Build a rewarding, meaningful career working with the best and brightest people in technology at Canonical, the growing international software company behind Ubuntu.\n\nThe monitoring stack will monitor applications running on a mix of cloud technologies such as Kubernetes and OpenStack, as well as bare-metal, virtual machines and containers. The stack will be capable of monitoring applications and infrastructure irrespective of whether they are operated by Juju, and will leverage multiple data sources at various levels of the architecture, including Juju itself, to contextualize the collected telemetry and insights delivered to the end-users.\n\nYou can read more about the project here and here.\n\nLocation: This role will be based remotely in the EMEA and Americas regions\n\nThe role entails\n\nCollaborate proactively with a globally distributed teamWrite, test and document high quality code to create new featuresDebug issues and interact with a vibrant communityReview code produced by other engineersAttend conferences to represent Canonical and the Charmed Observability StackWork from home with global travel 2 to 4 weeks for internal and external events\n\n\nWhat we are looking for in you\n\nYou love technology and working with brilliant peopleYou value soft skills and are passionate, enterprising, thoughtful, and self-motivatedYou have a Bachelor’s or equivalent in Computer Science, STEM or similar degreeYou are a skilled Python developer, preferably with a track record in open sourceYou have a working knowledge of GoYou have interest and experience with two or more of the following: Ubuntu Linux, container images, Debian packaging, snap, distributed systems.\n\n\nWhat we offer colleagues\n\nWe consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognize outstanding performance. In addition to base pay, we offer a performance-driven annual bonus or commission. We provide all team members with additional benefits which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.\n\nDistributed work environment with twice-yearly team sprints in personPersonal learning and development budget of USD 2,000 per yearAnnual compensation reviewRecognition rewardsAnnual holiday leaveMaternity and paternity leaveTeam Member Assistance Program & Wellness PlatformOpportunity to travel to new locations to meet colleaguesPriority Pass and travel upgrades for long-haul company events\n\n\nAbout Canonical\n\nCanonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open-source projects and the platform for AI, IoT, and the cloud, we are changing the world of software. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence; in order to succeed, we need to be the best at what we do. Most colleagues at Canonical have worked from home since our inception in 2004. Working here is a step into the future and will challenge you to think differently, work smarter, learn new skills, and raise your game.\n\nCanonical is an equal opportunity employer\n\nWe are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.\n\n",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 4451,
    "views": 27101,
    "jobApplicationLimitReached": false,
    "applyMethod": "https://job-boards.greenhouse.io/canonical/jobs/2166631?gh_src=1943652a1",
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/canonical",
      "logo": "https://media.licdn.com/dms/image/v2/C560BAQEbIYAkAURcYw/company-logo_400_400/company-logo_400_400/0/1650566107463/canonical_logo?e=1755129600&v=beta&t=ttcvz0KNFApRDW45s_L-PCtU4CUBYRy_jwIko6gKakM",
      "website": null,
      "name": "Canonical",
      "employeeCount": 1766,
      "followerCount": 618271,
      "description": "We deliver open source to the world faster,  more securely and more cost effectively than any other company.\n\nWe're also the publishers of Ubuntu, the world’s most popular enterprise Linux from cloud to edge, together with a passionate global community of 200,000+ contributors. \n\nUbuntu means 'humanity to others'​. We chose it because it embodies the generosity at the heart of open source, the new normal for platforms and innovation.\n\nTogether with a community of 200,000, we publish an operating system that runs from the tiny connected devices up to the world's biggest mainframes, the platform that everybody uses on the public cloud, and the workstation experience of the world's most productive developers.\n\nSecure and reliable, elegant and intuitive, and open for innovation - this is the future of open source, which is why we're proud to be the developers of the fastest growing Linux in the world despite already being the most widely deployed.\n\nIf you're interested in a career at Canonical, we are a remote-first company so please apply to any suitable role as skills are valued more than location, despite some having a preferred geographic preference. \n\nwww.canonical.com ",
      "specialities": [
        "Open Source",
        "Certification",
        "OpenStack",
        "Software Development",
        "Containers",
        "Kubernetes",
        "AI/ML",
        "Software Engineering",
        "IoT",
        "Operating Systems",
        "Software Operations",
        "Cloud computing",
        "Public cloud",
        "Robotics",
        "Cloud"
      ],
      "industries": [
        "Software Development"
      ],
      "locations": [
        {
          "city": "London",
          "state": "England",
          "country": "UK"
        }
      ]
    }
  },
  {
    "id": "4264433469",
    "title": "Senior Analytical Engineer (Job onsite in Abu Dhabi)",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4264433469/",
    "postedDate": "2025-07-14T10:10:25.000Z",
    "expireAt": "2025-08-13T10:10:24.000Z",
    "descriptionText": "Job Title: Senior Engineer · AnalyticalLocation: Abu Dhabi (Relocation Provided) Employment Type: Full-Time Industry: Aerospace / Defense / Robotics / Advanced Systems Engineering\nPosition Overview We are seeking a visionary and technically accomplished Senior Engineer – Analytical to lead the design, development, and integration of advanced analytical systems. This role is pivotal in shaping the architecture and performance of cutting-edge navigation, control, and sensor fusion technologies for aerospace, defense, and autonomous platforms.\nCore Responsibilities Define, design, and refine system architectures for advanced analytical applications, including navigation systems, sensor integration, and control algorithms.Optimize flight control systems for precision maneuvering and stability across all flight phases. Develop and implement terminal guidance algorithms (e.g., Proportional Navigation) for high-accuracy target engagement.Lead modeling and simulation efforts for dynamic systems such as missiles, UAVs, robotics, and autonomous vehicles.Design and implement algorithms for sensor fusion, state estimation (e.g., Kalman Filters), trajectory analysis, and control.Develop solutions for GPS-denied environments, ensuring system precision and reliability. Direct the creation and validation of high-fidelity simulations and iterative testing processes. Collaborate with cross-functional teams (hardware, software, electronics) to ensure seamless system integration.Provide technical leadership and mentorship across multidisciplinary engineering teams. Drive innovation through research in AI/ML, sensor technologies, and computational modeling.Identify and implement best practices in analytical system design and process improvement.\nSupporting ResponsibilitiesLead R&D initiatives to explore emerging theories and technologies in aerospace engineering.Maintain a robust portfolio of research projects aimed at advancing aerial and missile system capabilities.Develop comprehensive technical documentation, including specifications, algorithm descriptions, and validation protocols.Conduct technical risk assessments and develop mitigation strategies.Establish partnerships with external research institutions and industry leaders.Mentor and develop engineering talent, fostering a culture of innovation and excellence.\nQualifications & ExperienceEducation: PhD or Master’s degree in Aerospace Engineering, Control Systems Engineering, Electrical Engineering, Computer Science, or a related field.Additional Qualifications: Business or technology management credentials are highly desirable.Experience: 20+ years in analytical system design and integration, with a focus on navigation, control systems, and sensor fusion.Track Record: Proven leadership in delivering complex analytical solutions in defense, aerospace, or robotics sectors.\nKey SkillsAnalytical Modeling: Proficiency in MATLAB, Simulink, and Python for dynamic system modeling and algorithm development.Simulation and Testing: Expertise in evaluating high-fidelity simulations and validating analytical models.Navigation and Control Systems: In-depth knowledge of navigation algorithms, control theory, and state estimation techniques (EKF, UKF, Particle Filters).Sensor Fusion: Advanced experience integrating multi-sensor data, including IMU, GPS, LiDAR, and vision systems.AI/ML Integration: Familiarity with machine learning frameworks for data-driven modeling and prediction.Cross-Domain Knowledge: Strong understanding of mechanical, electrical, and software systems for holistic integration of analytical solutions",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": "https://www.linkedin.com/job-apply/4264433469",
    "applicants": 33,
    "views": 802,
    "jobApplicationLimitReached": false,
    "applyMethod": null,
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/leveluphcs",
      "logo": "https://media.licdn.com/dms/image/v2/D560BAQHw_lgY4yPu5w/company-logo_400_400/company-logo_400_400/0/1708431340589/leveluphcs_logo?e=1755129600&v=beta&t=hBzOapyixAeMYAtXo16vZWKB9vHmzemad9aTd-59nrk",
      "website": null,
      "name": "LevelUP HCS",
      "employeeCount": 334,
      "followerCount": 217395,
      "description": "LevelUP Human Capital Solutions (LevelUP HCS) is a global leader in innovative talent acquisition and workforce management. As one of the largest minority-owned business talent solution providers, we deliver Recruitment Process Outsourcing (RPO), contingent workforce solutions, and talent intelligence to organizations of all sizes—empowering them to attract, hire, and retain top talent. Driven by our mission to elevate the world of work, we blend cutting-edge technology with industry expertise to build strong, resilient workforces and fuel sustainable growth.",
      "specialities": [
        "Recruitment",
        "RPO",
        "Talent Acquisition",
        "Human Resources",
        "MSP",
        "Consulting",
        "Contingent Workforce Management",
        "Workforce Strategy "
      ],
      "industries": [
        "Human Resources Services"
      ],
      "locations": [
        {
          "city": "New York City",
          "state": "New York",
          "country": "United States"
        }
      ]
    }
  },
  {
    "id": "4263152309",
    "title": "Quality Assurance Developer, Trilogy (Remote) - $60,000/year USD",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4263152309/",
    "postedDate": "2025-07-14T09:05:05.000Z",
    "expireAt": "2025-10-07T00:24:34.000Z",
    "descriptionText": "Ready to revolutionize quality assurance with artificial intelligence? We're not looking for traditional QA engineers who follow the same old playbook. We need a visionary who can transform testing through the power of AI. In this role, you'll architect next-generation test frameworks that learn, adapt, and anticipate issues before they become problems.\n\nForget being the last stop before deployment—our QA team operates at the heart of product development. You'll pioneer GenAI solutions that automatically generate comprehensive test scenarios from product requirements, simulate unpredictable user behaviors, and uncover hidden edge cases that traditional testing would miss.\n\nThis position demands someone who thrives on innovation and technical challenges. You'll build sophisticated systems that leverage AI to predict failure points, analyze patterns across thousands of tests, and deliver actionable quality insights in real-time. This isn't about following a QA checklist—it's about engineering intelligence into the very fabric of our quality process.\n\nJoin our forward-thinking, AI-powered product team where your technical expertise will directly shape user experiences. If you're ready to redefine what's possible in quality assurance and harness cutting-edge AI to do it, we want to hear from you!\n\nWhat You Will Be Doing\n\nDesign and deploy sophisticated AI-powered test automation frameworks that scale with our rapidly evolving productsLeverage GenAI technologies to extract meaningful patterns from test results, identifying subtle defect trends before they impact usersCreate intelligent simulation systems that use AI to generate diverse user scenarios and stress conditions, uncovering vulnerabilities traditional testing would miss\n\nQuality Assurance Developer Key Responsibilities\n\nSafeguard product quality through advanced AI-driven automation, continuous quality monitoring, and proactive issue detection to ensure flawless releases\n\nBasic Requirements\n\nMinimum 4 years of progressive experience in quality assurance engineering with demonstrated expertise in designing and implementing automated testing frameworksPractical experience implementing or developing with generative AI tools in either development or quality assurance contexts\n\nAbout Trilogy\n\nHundreds of software businesses run on the Trilogy Business Platform. For three decades, Trilogy has been known for 3 things: Relentlessly seeking top talent, Innovating new technology, and incubating new businesses. Our technological innovation is spearheaded by a passion for simple customer-facing designs. Our incubation of new businesses ranges from entirely new moon-shot ideas to rearchitecting existing projects for today's modern cloud-based stack. Trilogy is a place where you can be surrounded with great people, be proud of doing great work, and grow your career by leaps and bounds.\n\nThere is so much to cover for this exciting role, and space here is limited. Hit the Apply button if you found this interesting and want to learn more. We look forward to meeting you!\n\nWorking with us\n\nThis is a full-time (40 hours per week), long-term position. The position is immediately available and requires entering into an independent contractor agreement with Crossover as a Contractor of Record. The compensation level for this role is $30 USD/hour, which equates to $60,000 USD/year assuming 40 hours per week and 50 weeks per year. The payment period is weekly. Consult www.crossover.com/help-and-faqs for more details on this topic.\n\nCrossover Job Code: LJ-5603-AE-COUNTRY-QualityAssuran.003\n\n",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 271,
    "views": 1007,
    "jobApplicationLimitReached": false,
    "applyMethod": "https://www.crossover.com/roles/a0sIj000001HE3NIAW/quality-assurance-developer/apply?utm_source=linkedin&utm_medium=jobslot&utm_campaign=LJ-5603-AE-COUNTRY-QualityAssuran.003",
    "salary": "30 - 30 USD",
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/trilogy",
      "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQHo46awkKVsFg/company-logo_400_400/B4DZY4U_eJHAAY-/0/1744701749693/trilogy_logo?e=1755129600&v=beta&t=TAxQSqatfYbow1F6fi7rca71uhnQbs6ymHsMMydxFVA",
      "website": null,
      "name": "Trilogy",
      "employeeCount": 1217,
      "followerCount": 222943,
      "description": "Trilogy acquires software companies and fundamentally transforms them with an AI-first strategy. We embed AI and automation deep into operations – from development to support – to unlock radical efficiency and drive growth.\n\nPowered by the top 1% of global remote talent sourced via Crossover, we refine proprietary playbooks to build the future of intelligent, high-performance software operations. Join us at the cutting edge.",
      "specialities": [
        "Automotive configuration software",
        "Financial services channel compensation software",
        "telecommunications network management software",
        "telecommunications channel compensation software"
      ],
      "industries": [
        "Software Development"
      ],
      "locations": [
        {
          "city": "Austin",
          "state": "Texas",
          "country": "United States"
        }
      ]
    }
  },
  {
    "id": "4263148903",
    "title": "Senior DevOps Engineer, Trilogy (Remote) - $100,000/year USD",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4263148903/",
    "postedDate": "2025-07-14T11:06:19.000Z",
    "expireAt": "2025-09-07T00:24:39.000Z",
    "descriptionText": "You're the kind of DevOps engineer who doesn't just keep the lights on; you make sure they never go out in the first place. If your idea of fun is tearing into a tangled mess of legacy infrastructure, designing a more efficient system, and automating away every repetitive task you encounter, then you're in the right place. We're looking for a DevOps and AWS infrastructure expert who thrives in high-stakes environments, where 99.9% uptime is expected. You'll work across a portfolio of acquired products, each with its own quirks, migrating them into a streamlined, scalable AWS ecosystem while building monitoring and automation that actually makes incidents rare.\n\nMost companies want you to maintain a single stack. We want you to consolidate and optimize multiple stacks without breaking anything along the way. While others isolate databases, we do the opposite, strategically consolidating them to optimize for cost and management efficiency across our portfolio. This isn't a role for someone who wants to babysit existing infrastructure; it's for someone who sees an inconsistent, fragmented environment and immediately starts designing a better one.\n\nYou'll own everything from infrastructure migrations to AI-driven automation, performance tuning, database migration, and cost optimization. That means diagnosing and fixing what's broken, planning and executing seamless cloud migrations with near-zero downtime, and automating away half of your own job with AI/ML-powered workflows. You'll have real authority to make infrastructure decisions—no waiting around for approvals from people who don't understand what's actually happening under the hood.\n\nIf you're an independent problem-solver who thrives on untangling complex systems and making them run flawlessly, this job will be your playground. If you need extensive hand-holding, get overwhelmed by multiple tech stacks, or prefer clean-slate projects over making order from chaos, you're going to hate it here. If you're ready to take ownership of a high-impact infrastructure role with room to build, optimize, and automate at scale, apply now!\n\nWhat You Will Be Doing\n\nPlanning and executing complex infrastructure changes, including migrations from legacy systems to AWS cloud infrastructure and lift-and-shift migrationsDesigning and implementing monitoring plans and building automations for monitoring, software deployments, and operational workflowsPerforming system monitoring, system backups, incident response, database migrations, database configurations, and cost optimization\n\nWhat You Won’t Be Doing\n\nLiving in Jira and endless status meetings - we value people who can drive solutions, not just track problemsMaintaining outdated systems indefinitely - you'll be empowered to drive meaningful improvementsGetting blocked by bureaucratic approval chains - you'll have the authority to execute immediate fixes to resolve incidentsGetting stuck in narrow technical silos - this role requires both breadth and depth of expertiseFighting for budget to implement critical improvements - we understand the importance of infrastructure investment\n\nSenior DevOps Engineer Key Responsibilities\n\nDrive reliability and standardization of cloud infrastructure across our growing product portfolio by implementing robust monitoring, automation, and AWS best practices.\n\nBasic Requirements\n\nDeep AWS infrastructure expertise (this is our primary platform - other cloud experience alone won't cut it)Strong programming skills in Python or JavaScript for building automation and toolingExperience managing and migrating production databases with multiple engines (including MySql, Postgres, Oracle, MS-SQL)Advanced Docker/Kubernetes skillsExperience with infrastructure automation (Terraform, Ansible, or CloudFormation)Linux systems administration expertise\n\nAbout Trilogy\n\nHundreds of software businesses run on the Trilogy Business Platform. For three decades, Trilogy has been known for 3 things: Relentlessly seeking top talent, Innovating new technology, and incubating new businesses. Our technological innovation is spearheaded by a passion for simple customer-facing designs. Our incubation of new businesses ranges from entirely new moon-shot ideas to rearchitecting existing projects for today's modern cloud-based stack. Trilogy is a place where you can be surrounded with great people, be proud of doing great work, and grow your career by leaps and bounds.\n\nThere is so much to cover for this exciting role, and space here is limited. Hit the Apply button if you found this interesting and want to learn more. We look forward to meeting you!\n\nWorking with us\n\nThis is a full-time (40 hours per week), long-term position. The position is immediately available and requires entering into an independent contractor agreement with Crossover as a Contractor of Record. The compensation level for this role is $50 USD/hour, which equates to $100,000 USD/year assuming 40 hours per week and 50 weeks per year. The payment period is weekly. Consult www.crossover.com/help-and-faqs for more details on this topic.\n\nCrossover Job Code: LJ-5236-AE-Dubai-SeniorDevOpsEn.010\n\n",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 132,
    "views": 473,
    "jobApplicationLimitReached": false,
    "applyMethod": "https://www.crossover.com/roles/a0s2j00000E8hxdAAB/senior-devops-engineer/apply?utm_source=linkedin&utm_medium=jobslot&utm_campaign=LJ-5236-AE-Dubai-SeniorDevOpsEn.010",
    "salary": "50 - 50 USD",
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/trilogy",
      "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQHo46awkKVsFg/company-logo_400_400/B4DZY4U_eJHAAY-/0/1744701749693/trilogy_logo?e=1755129600&v=beta&t=TAxQSqatfYbow1F6fi7rca71uhnQbs6ymHsMMydxFVA",
      "website": null,
      "name": "Trilogy",
      "employeeCount": 1217,
      "followerCount": 222943,
      "description": "Trilogy acquires software companies and fundamentally transforms them with an AI-first strategy. We embed AI and automation deep into operations – from development to support – to unlock radical efficiency and drive growth.\n\nPowered by the top 1% of global remote talent sourced via Crossover, we refine proprietary playbooks to build the future of intelligent, high-performance software operations. Join us at the cutting edge.",
      "specialities": [
        "Automotive configuration software",
        "Financial services channel compensation software",
        "telecommunications network management software",
        "telecommunications channel compensation software"
      ],
      "industries": [
        "Software Development"
      ],
      "locations": [
        {
          "city": "Austin",
          "state": "Texas",
          "country": "United States"
        }
      ]
    }
  },
  {
    "id": "4264425927",
    "title": "C++ Software Engineer - High-Frequency Trading",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4264425927/",
    "postedDate": "2025-07-14T08:42:34.000Z",
    "expireAt": "2025-08-13T08:42:33.000Z",
    "descriptionText": "Venture Search is currently partnered with a leading high-frequency crypto trading firm based in Dubai, that are looking for a Middle Software Engineer (C++) who has experience with high-load applications.\nYou will be working on developing and optimizing trading systems, algorithms, and connections to cryptocurrency exchanges. If you have worked with systems where every microsecond counts and everything needs to run fast and smoothly, you might be a good candidate for this role.\nResponsibilities\nDevelop and maintain connections to cryptocurrency exchanges and data providers, troubleshoot market data issues.Develop new features.Work together with different teams to ensure the correct behaviour of algorithms and improve trading systems.Helping with fixing small bugs.\nRequired Skills & Experience\nMinimum 3 years of experience in software development.Extensive experience in C++Experience working with high load applications.Good understanding of design patterns, data structures, and algorithms.Good understanding of networking concepts.Knowledge in financial markets and low latency/high-frequency systems and/or distributed systems.\nBonus\nExperience with Python, Kafka.Experience with networking protocols REST/Websockets/FIX.Experience with AWS, Kibana, Grafana, and Prometheus",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": "https://www.linkedin.com/job-apply/4264425927",
    "applicants": 62,
    "views": 160,
    "jobApplicationLimitReached": false,
    "applyMethod": null,
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/venture-search",
      "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQHgl_8PBDoYYg/company-logo_400_400/company-logo_400_400/0/1684568123384/venture_search_logo?e=1755129600&v=beta&t=U10jqDTKBTTvpwJuYj4AAuH3wGUQx8vtIqBpD6jtRZo",
      "website": null,
      "name": "Venture Search",
      "employeeCount": 31,
      "followerCount": 208136,
      "description": "Delivering high-performing recruitment solutions through collaborative partnerships.\n\nBy fully immersing ourselves in key specialist markets, we truly understand our clients’ and candidates’ specific requirements, enabling us to provide credible insights, bespoke solutions, and successful recruitment outcomes. \n\nOur market specialisms include:\n- Investment Banking & Advisory\n- Public & Private Markets\n- Global Markets\n- Hedge Funds & Proprietary Trading\n- Commodities\n- Financial Technology\n- Governance, Risk, & Compliance",
      "specialities": [
        "Hedge Funds",
        "Investment Management",
        "Technology",
        "Commodities",
        "Private Equity",
        "Sovereign Wealth Funds ",
        "Compliance"
      ],
      "industries": [
        "Staffing and Recruiting"
      ],
      "locations": [
        {
          "city": "London",
          "state": "England",
          "country": "UK"
        }
      ]
    }
  },
  {
    "id": "4264438684",
    "title": "Full Stack Developer",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4264438684/",
    "postedDate": "2025-07-14T11:30:38.000Z",
    "expireAt": "2025-08-13T11:30:38.000Z",
    "descriptionText": "We're Hiring - Full Stack Developer\nCompany: LuxoraFX – Proprietary Trading FirmLocation: Remote (preferred)Type: Full-TimeExperience: Senior-Level\n\nAbout LuxoraFX \nLuxoraFX is a rapidly growing proprietary trading firm, providing funded trading opportunities to skilled traders across the globe. We empower traders with cutting-edge platforms, real-time risk management systems, and a strong support structure to help them succeed.\nAs we expand, we’re looking for a Full Stack Developer who is passionate about technology, trading, and building systems that power high-performance environments.\n\nResponsibilities • Design, develop, and maintain scalable web applications (frontend & backend) • Develop internal dashboards, trader portals, CRM systems, and API integrations • Collaborate with traders, product managers, and other stakeholders to build custom tools • Optimize platforms for speed, performance, and security • Integrate third-party services (e.g., payment gateways, KYC providers, MT5/CTRM APIs) • Write clean, well-documented, and testable code • Monitor and debug applications in real-time\n\n\nRequirements • 3+ years of experience as a Full Stack Developer • Strong knowledge of JavaScript, React/Vue, Node.js, Python, or similar tech stacks • Experience with RESTful APIs, MySQL/MongoDB, and cloud platforms (AWS/GCP) • Familiarity with trading platforms (e.g., MetaTrader 5, cTrader) is a big plus • Knowledge of authentication, role-based access, and secure coding practices • Self-starter with the ability to work independently and remotely • Good communication and collaboration skills\n\n\n Nice to Have • Experience in fintech or prop trading platforms • Knowledge of forex trading, crypto, or financial instruments • DevOps experience (Docker, CI/CD pipelines)\n\n\nHow to Apply\nSend your resume, portfolio, and a short intro to Luxorafx@gmail.comSubject: Application – Full Stack Developer\n\n\nJoin LuxoraFX and help us build the next generation of trading infrastructure.Let’s shape the future of prop trading together.",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 24,
    "views": 46,
    "jobApplicationLimitReached": false,
    "applyMethod": null,
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/luxora-fx",
      "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQHU2a-y5WUREQ/company-logo_400_400/B4DZeB6EXmH4Ag-/0/1750231174451?e=1755129600&v=beta&t=NxnCAsurK6PvFyC1EaQAVuBFCNU_ZNaz_S62hVaIKVk",
      "website": null,
      "name": "Luxora FX",
      "employeeCount": 3,
      "followerCount": 18,
      "description": "LuxoraFX is a Dubai-based proprietary trading firm designed to empower talented forex traders around the world.\n\nWe provide qualified traders with access to up to $100,000 in funded capital, 1:100 leverage, and 80% profit share — all with fast payouts, transparent rules, and institutional-grade trading infrastructure.\n\nAt LuxoraFX, we believe skill should be the only barrier to success — not capital. That’s why we focus on supporting traders with the tools, flexibility, and real-time guidance they need to perform at their best.\n\n📍 Dubai HQ | 🌍 Global Community\n💼 Funded Trading Programs | ⚖️ Risk Management Support | 📈 Trader Development\n\nJoin us and trade with real capital, real support, and real opportunity.",
      "specialities": [],
      "industries": [
        "Financial Services"
      ],
      "locations": [
        {
          "city": "Dubai",
          "state": "Dubai",
          "country": "United Arab Emirates"
        }
      ]
    }
  },
  {
    "id": "4264429707",
    "title": "Freelance Business Development Executive - Marketing Solutions (UAE)",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4264429707/",
    "postedDate": "2025-07-14T09:41:23.000Z",
    "expireAt": "2026-01-10T09:41:23.000Z",
    "descriptionText": "Are you a results-driven Business Development Executive with a proven track record in the UAE market? Do you thrive on building relationships and closing deals? We're looking for experienced, highly motivated freelance professionals to expand our reach and sell comprehensive marketing solutions to businesses across the UAE.This is a unique opportunity for a self-starter to control their earning potential through a commission-based structure. The more deals you close, the more you earn!\nAbout Us:We're more than just a marketing solutions provider; we're a team of passionate innovators dedicated to empowering businesses across the UAE to thrive in the digital age. We believe in the transformative power of strategic SEO, engaging social media, intuitive web development, and compelling content to unlock unparalleled growth. Our mission is to partner with companies, leveraging our expertise to craft tailored strategies that not only meet but exceed their digital marketing goals.\nAbout the Role:As a Freelance Business Development Executive, you will be responsible for identifying, pursuing, and securing new business opportunities within the UAE. You'll be selling a full suite of marketing services, including:Search Engine Optimization (SEO)Social Media MarketingWeb DevelopmentContent Creation\nWe're Looking for Someone Who Has:A minimum of 5 years of experience successfully selling marketing solutions in the UAE.Existing connections and a strong network within the UAE business landscape.Exceptional communication, negotiation, and presentation skills.The resilience and positive attitude to turn rejection into opportunity.MUST be a current resident of the UAE with a valid UAE residency visa.\nWhy This Opportunity is Appealing:Unlimited Earning Potential: Your income is directly tied to your success.Flexibility: Work independently and manage your own schedule.Diverse Service Portfolio: Offer a wide range of in-demand marketing solutions.Impactful Work: Help businesses in the UAE grow and succeed.Growth Potential: Opportunity to build a significant pipeline and client base.\nReady to Take Control of Your Career?If you're a highly motivated individual with a passion for sales and a deep understanding of the UAE market, we want to hear from you. Apply Today! Both male and female candidates are encouraged to apply.",
    "employmentType": "part_time",
    "workplaceType": "remote",
    "easyApplyUrl": "https://www.linkedin.com/job-apply/4264429707",
    "applicants": 13,
    "views": 52,
    "jobApplicationLimitReached": false,
    "applyMethod": null,
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/private8sector",
      "logo": null,
      "website": null,
      "name": "Private sector",
      "employeeCount": 6519,
      "followerCount": 12953,
      "description": null,
      "specialities": [],
      "industries": [
        "Hospitality"
      ],
      "locations": []
    }
  },
  {
    "id": "4264443632",
    "title": "Affiliate Marketing Manager (Job Based Onsite in Dubai)",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4264443632/",
    "postedDate": "2025-07-14T11:21:25.000Z",
    "expireAt": "2025-08-13T11:21:25.000Z",
    "descriptionText": "Tired of managing low-impact affiliate networks? We're looking for an elite partnership builder to forge strategic alliances for a top US brand growing 100% YoY.\n*Note: Job Based Onsite in Dubai (Full Relocation & Visa Sponsorship Provided)*\nAt Rapid Global Growth (RGG), we're powering Puffy—a Top 5 US mattress brand with 100% YoY sales growth and a reputation for innovation recognized by Forbes, Entrepreneur.com, and TechCompanyNews. Now, we're seeking an elite Affiliate Marketing Manager to forge strategic partnerships that drive exponential growth in our North American market. Your mission: drive exponential growth in our North American market, with direct CEO mentorship, from our tax-free world-class headquarters in Dubai.\nWhy This Role Will Transform Your Career\nOwn a High-Scale ImpactLead strategies influencing thousands of conversions daily, directly impacting our bottom-line revenue growthCollaborate with the Top 1%Work directly with our Forbes Council Member CEO, gaining rare executive mentorship and a front-row seat to elite-level thought leadership.Join a high-performance environment alongside the top 1% of global talent who delivered success across industries.Experience Tax-Free Prosperity & World-Class LifestyleCompetitive salary range of AED 22,000 - AED 31,000/month based on experience and qualifications, with opportunity for up to 10% performance bonus, all tax-free. This transparent range represents our full compensation spectrum, with specific offers determined by relevant experience and demonstrated expertise.Enjoy full relocation support: flights, visa sponsorship, and two weeks of hotel accommodation on arrival.Thrive in our modern Dubai Internet City headquarters, complete with organic snacks, curated wellness programs, and a vibrant international team of 16+ nationalitiesInnovate with the most advanced Tools & Tech stackHarness industry-leading affiliate platforms, advanced attribution modeling, and sophisticated analytics tools.Leverage cutting-edge tracking technologies and performance optimization frameworks.Accelerate Your Growth TrajectoryFast-track your path to leadership: past team members have grown into Managers and Directors within 12–24 months.Access a robust learning budget, fueling continuous skill expansion.\nWhat You'll AchievePartnership Development: Establish, strengthen, and maintain relationships with affiliate partners—overseeing negotiations, conflict resolution, and performance strategies.Strategic Growth: Identify new partnership opportunities and unexplored affiliate channels to drive high-quality traffic and improve conversions within the D2C e-commerce landscape.Performance Optimization: Continuously test, evaluate, and refine affiliate campaigns; track KPIs (EPC, ROAS) and provide actionable insights for immediate and long-term improvements.Budget & Forecasting: Manage campaign budgets, forecast results, and allocate spend to maximize profitability and meet defined targets.Cross-Functional Collaboration: Work with creative, marketing, and product teams to develop, test, and iterate on promotional materials—ensuring brand consistency across all affiliate channels.Industry Awareness: Stay abreast of emerging trends, technologies, and best practices in affiliate marketing, ensuring competitive positioning and innovative approaches to growth.Reporting Cadence: Frequency and depth of performance reporting to internal stakeholders, along with dashboard or reporting tool responsibilities.\n\nIdeal ProfileProven D2C Expertise: 5+ years of affiliate marketing experience in a B2C e-commerce environment within the North American sleep sector (USA/Canada)Proven Success in Onboarding and Scaling Organic Publishers and PPC Affiliate PartnersAdvanced Affiliate Knowledge: In-depth understanding of affiliate marketing channels, attribution models, and performance metrics (EPC, ROAS).Data & Analytics Skills: Proficiency in market-leading affiliate tracking tools (e.g., Impact or Partnerize) and secondary platforms (BrandVerity, Similarweb/Ahrefs, or Visual Ping).Performance-Driven Mindset: Demonstrated success in recruiting, activating, and optimizing top affiliates for maximum ROI.Negotiation & Communication: Strong background in managing vendor/partner relationships, with excellent written and verbal communication.Entrepreneurial Approach: Self-starter who thrives in fast-paced, high-growth environments and can adapt quickly to changing market dynamics.\n\nGood-to-Have SkillsPaid Media Experience: Familiarity with running and optimizing paid acquisition campaigns in tandem with affiliate initiatives.Startup/Scale-Up Exposure: Past work in a rapidly scaling company, comfortable navigating limited resources and swift pivots.Global Market Insight: Experience coordinating with international partners and tailoring campaigns to diverse audiences.\nCompensation & PerksIndustry-leading salary plus performance bonus, all tax-free.Full Relocation Coverage: Flights, visa sponsorship, plus two weeks of hotel upon arrival in Dubai.Health & Wellness: Comprehensive international medical, dental, and vision coverage, plus a wellness-focused campus stocked with healthy snacks and beverages.Elite Peer Group: Collaborate daily with the top talents at Puffy—our environment fosters continuous growth and learning.Career Fast-Track: Clear pathways to high impact and leadership roles, backed by a devoted mentorship framework and an annual professional development budget.Global Growth & Recognition: Be part of a company recognized by Forbes, featured in Entrepreneur.com, and achieve unstoppable momentum in e-commerce.\n\nReady to Shape Our Story & Accelerate Your Own?Click \"Apply\" Now and take the first step in a 3-phase streamlined hiring process designed for speed and fairness. Within one business day, you could be invited to Phase 2 if you pass our online assessment—where top talent like you belongs.\nJoin us in rewriting the future of e-commerce—one game-changing partnership at a time. Lead a top-tier global team, and leave your mark on a $500M+ success story in the making. If you're primed for massive impact, rapid career growth, and the thrill of shaping a beloved American brand on a global stage, we want you on our team.",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 7,
    "views": 107,
    "jobApplicationLimitReached": false,
    "applyMethod": "https://careers.puffy.com/roles/affiliate-marketing-manager",
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/puffy",
      "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQG6eIezsRpR9w/company-logo_400_400/company-logo_400_400/0/1727180869620/puffy_logo?e=1755129600&v=beta&t=eoXRM8CD0vX1o6nvHAh8nLEXXcOg9MTy0SBvxrHRYNo",
      "website": null,
      "name": "Puffy",
      "employeeCount": 158,
      "followerCount": 85290,
      "description": "Renowned for its commitment to fostering a dynamic and supportive workplace, Puffy takes pride in its certification as a 'Great Place to Work'. This prestigious acknowledgment coupled with the numerous awards we have received underline our reputation as a distinguished place to work.\n\nFounded in 2016, Puffy is a celebrated direct-to-consumer mattress and bedroom company operating across the U.S. and Canada. With a profound reputation for inventing mattresses that offer the sensation of sleeping on a cloud, Puffy is on a mission to redefine comfort and transform sleep experiences worldwide. This unwavering dedication to delivering premium sleep solutions and innovation has made Puffy one of the most popular online mattress brands in the U.S.\n\nThe inception of Puffy sprang from a simple, child-like curiosity: \"What would it feel like to sleep on a bed of clouds?\" This wonder led to the creation of the Puffy Mattress. What sets us apart is our groundbreaking Cooling Cloud™️ technology that epitomizes the feeling of sleeping on a cloud.\n\nProudly manufactured in the USA, Puffy embodies the philosophy of avoiding salesmen and markups, with the aim to deliver better sleep straight to your door.\n\nLearn more about Puffy by visiting our website and engage with us on our social media channels:\n\nCareers - https://careers.puffy.com/\nWeb -  https://puffy.com\nFacebook -  https://facebook.com/PuffyMattress\nTwitter -  https://twitter.com/PuffyMattress\nInstagram -  https://instagram.com/PuffyMattress",
      "specialities": [
        "Sleep",
        "Mattresses",
        "Dream Making",
        "Sleep Magicians"
      ],
      "industries": [
        "Retail"
      ],
      "locations": [
        {
          "city": "Los Angeles",
          "state": "California",
          "country": "United States"
        }
      ]
    }
  },
  {
    "id": "4264440825",
    "title": "Affiliate Marketing Manager (Job Based Onsite in Dubai)",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4264440825/",
    "postedDate": "2025-07-14T11:22:13.000Z",
    "expireAt": "2025-08-13T11:22:13.000Z",
    "descriptionText": "Tired of managing low-impact affiliate networks? We're looking for an elite partnership builder to forge strategic alliances for a top US brand growing 100% YoY.\n*Note: Job Based Onsite in Dubai (Full Relocation & Visa Sponsorship Provided)*\nAt Rapid Global Growth (RGG), we're powering Puffy—a Top 5 US mattress brand with 100% YoY sales growth and a reputation for innovation recognized by Forbes, Entrepreneur.com, and TechCompanyNews. Now, we're seeking an elite Affiliate Marketing Manager to forge strategic partnerships that drive exponential growth in our North American market. Your mission: drive exponential growth in our North American market, with direct CEO mentorship, from our tax-free world-class headquarters in Dubai.\nWhy This Role Will Transform Your Career\nOwn a High-Scale ImpactLead strategies influencing thousands of conversions daily, directly impacting our bottom-line revenue growthCollaborate with the Top 1%Work directly with our Forbes Council Member CEO, gaining rare executive mentorship and a front-row seat to elite-level thought leadership.Join a high-performance environment alongside the top 1% of global talent who delivered success across industries.Experience Tax-Free Prosperity & World-Class LifestyleCompetitive salary range of AED 22,000 - AED 31,000/month based on experience and qualifications, with opportunity for up to 10% performance bonus, all tax-free. This transparent range represents our full compensation spectrum, with specific offers determined by relevant experience and demonstrated expertise.Enjoy full relocation support: flights, visa sponsorship, and two weeks of hotel accommodation on arrival.Thrive in our modern Dubai Internet City headquarters, complete with organic snacks, curated wellness programs, and a vibrant international team of 16+ nationalitiesInnovate with the most advanced Tools & Tech stackHarness industry-leading affiliate platforms, advanced attribution modeling, and sophisticated analytics tools.Leverage cutting-edge tracking technologies and performance optimization frameworks.Accelerate Your Growth TrajectoryFast-track your path to leadership: past team members have grown into Managers and Directors within 12–24 months.Access a robust learning budget, fueling continuous skill expansion.\nWhat You'll AchievePartnership Development: Establish, strengthen, and maintain relationships with affiliate partners—overseeing negotiations, conflict resolution, and performance strategies.Strategic Growth: Identify new partnership opportunities and unexplored affiliate channels to drive high-quality traffic and improve conversions within the D2C e-commerce landscape.Performance Optimization: Continuously test, evaluate, and refine affiliate campaigns; track KPIs (EPC, ROAS) and provide actionable insights for immediate and long-term improvements.Budget & Forecasting: Manage campaign budgets, forecast results, and allocate spend to maximize profitability and meet defined targets.Cross-Functional Collaboration: Work with creative, marketing, and product teams to develop, test, and iterate on promotional materials—ensuring brand consistency across all affiliate channels.Industry Awareness: Stay abreast of emerging trends, technologies, and best practices in affiliate marketing, ensuring competitive positioning and innovative approaches to growth.Reporting Cadence: Frequency and depth of performance reporting to internal stakeholders, along with dashboard or reporting tool responsibilities.\n\nIdeal ProfileProven D2C Expertise: 5+ years of affiliate marketing experience in a B2C e-commerce environment within the North American sleep sector (USA/Canada)Proven Success in Onboarding and Scaling Organic Publishers and PPC Affiliate PartnersAdvanced Affiliate Knowledge: In-depth understanding of affiliate marketing channels, attribution models, and performance metrics (EPC, ROAS).Data & Analytics Skills: Proficiency in market-leading affiliate tracking tools (e.g., Impact or Partnerize) and secondary platforms (BrandVerity, Similarweb/Ahrefs, or Visual Ping).Performance-Driven Mindset: Demonstrated success in recruiting, activating, and optimizing top affiliates for maximum ROI.Negotiation & Communication: Strong background in managing vendor/partner relationships, with excellent written and verbal communication.Entrepreneurial Approach: Self-starter who thrives in fast-paced, high-growth environments and can adapt quickly to changing market dynamics.\n\nGood-to-Have SkillsPaid Media Experience: Familiarity with running and optimizing paid acquisition campaigns in tandem with affiliate initiatives.Startup/Scale-Up Exposure: Past work in a rapidly scaling company, comfortable navigating limited resources and swift pivots.Global Market Insight: Experience coordinating with international partners and tailoring campaigns to diverse audiences.\nCompensation & PerksIndustry-leading salary plus performance bonus, all tax-free.Full Relocation Coverage: Flights, visa sponsorship, plus two weeks of hotel upon arrival in Dubai.Health & Wellness: Comprehensive international medical, dental, and vision coverage, plus a wellness-focused campus stocked with healthy snacks and beverages.Elite Peer Group: Collaborate daily with the top talents at Puffy—our environment fosters continuous growth and learning.Career Fast-Track: Clear pathways to high impact and leadership roles, backed by a devoted mentorship framework and an annual professional development budget.Global Growth & Recognition: Be part of a company recognized by Forbes, featured in Entrepreneur.com, and achieve unstoppable momentum in e-commerce.\n\nReady to Shape Our Story & Accelerate Your Own?Click \"Apply\" Now and take the first step in a 3-phase streamlined hiring process designed for speed and fairness. Within one business day, you could be invited to Phase 2 if you pass our online assessment—where top talent like you belongs.\nJoin us in rewriting the future of e-commerce—one game-changing partnership at a time. Lead a top-tier global team, and leave your mark on a $500M+ success story in the making. If you're primed for massive impact, rapid career growth, and the thrill of shaping a beloved American brand on a global stage, we want you on our team.",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 19,
    "views": 197,
    "jobApplicationLimitReached": false,
    "applyMethod": "https://careers.puffy.com/roles/affiliate-marketing-manager",
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/puffy",
      "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQG6eIezsRpR9w/company-logo_400_400/company-logo_400_400/0/1727180869620/puffy_logo?e=1755129600&v=beta&t=eoXRM8CD0vX1o6nvHAh8nLEXXcOg9MTy0SBvxrHRYNo",
      "website": null,
      "name": "Puffy",
      "employeeCount": 158,
      "followerCount": 85290,
      "description": "Renowned for its commitment to fostering a dynamic and supportive workplace, Puffy takes pride in its certification as a 'Great Place to Work'. This prestigious acknowledgment coupled with the numerous awards we have received underline our reputation as a distinguished place to work.\n\nFounded in 2016, Puffy is a celebrated direct-to-consumer mattress and bedroom company operating across the U.S. and Canada. With a profound reputation for inventing mattresses that offer the sensation of sleeping on a cloud, Puffy is on a mission to redefine comfort and transform sleep experiences worldwide. This unwavering dedication to delivering premium sleep solutions and innovation has made Puffy one of the most popular online mattress brands in the U.S.\n\nThe inception of Puffy sprang from a simple, child-like curiosity: \"What would it feel like to sleep on a bed of clouds?\" This wonder led to the creation of the Puffy Mattress. What sets us apart is our groundbreaking Cooling Cloud™️ technology that epitomizes the feeling of sleeping on a cloud.\n\nProudly manufactured in the USA, Puffy embodies the philosophy of avoiding salesmen and markups, with the aim to deliver better sleep straight to your door.\n\nLearn more about Puffy by visiting our website and engage with us on our social media channels:\n\nCareers - https://careers.puffy.com/\nWeb -  https://puffy.com\nFacebook -  https://facebook.com/PuffyMattress\nTwitter -  https://twitter.com/PuffyMattress\nInstagram -  https://instagram.com/PuffyMattress",
      "specialities": [
        "Sleep",
        "Mattresses",
        "Dream Making",
        "Sleep Magicians"
      ],
      "industries": [
        "Retail"
      ],
      "locations": [
        {
          "city": "Los Angeles",
          "state": "California",
          "country": "United States"
        }
      ]
    }
  },
  {
    "id": "4266182217",
    "title": "Systems Integrator",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4266182217/",
    "postedDate": "2025-07-14T11:29:22.000Z",
    "expireAt": "2025-08-13T11:29:22.000Z",
    "descriptionText": "Capital One has partnered with iHire to reach top talent for their opening below. Check it out and apply via iHireTechnology today!\n\nPrincipal Systems Integrator- Salesforce (Remote)\n\nOverview\n\nEver since our first credit card customer in 1994, Capital One has recognized that technology and data can enable even large companies to be innovative and personalized. As one of the first large enterprises to go all-in on the public cloud, Capital One needed to build cloud and data management tools that didnt exist in the marketplace to enable us to operate at scale in the cloud. And in 2022, we publicly announced Capital One Software and brought our first B2B software solution, Slingshot, to market.\n\nBuilding on Capital Ones pioneering adoption of modern cloud and data capabilities, Capital One Software is helping accelerate the data management journey at scale for businesses operating in the cloud. If you think of the kind of challenges that companies face things like data publishing, data consumption, data governance, and infrastructure management weve built tools to address these various needs along the way. Capital One Software will continue to explore where we can bring our solutions to market to help other businesses address these same needs going forward.\n\nWe are seeking top tier talent to join our pioneering team and propel us towards our destination. You will be joining a team of innovative product, tech, and design leaders that tirelessly seek to question the status quo. As a Capital One Systems Administrator, youll have the opportunity to be on the forefront of building this business and bring these tools to market.\n\nAs a valuable member in this organization, this individual will be responsible for partnering with Product team/Product Owners and Engineering leaders along with Architects to analyze and help derive solutions. Additionally this individual will be responsible for working with business partners to help pave the path forward for the organization in relation to tools and solutions.\n\nYou will have the opportunity to tackle complex problems while using your expertise to deliver and support our services. Candidates must be able to effectively communicate and influence partners vertically and horizontally throughout the organization. Strong analytical skills, attention to detail, and the ability to integrate into a dynamic environment are essential to succeeding in this role.\n\nIn This Role You Will\n\n Continue to develop and demonstrate a thorough understanding of supported business processes and underlying technologies, ensuring alignment to initiatives and strategy.  Communicate across technical, project, and business resources verbally and through written documentation.  Collaborate cross-functionally with other tech platforms and partners to engineer integrated, end-to-end solutions across technology layers.  Support automated testing efforts required to ensure successful implementation of solutions into production.  Communicate with business and technical partners on incidents as they occur when they impact system performance or availability  Take an active contributor and lead role in Agile practices, especially leading Story writing, EPIC decomposition and User Story Mapping, especially for very technical requirements.  Utilize problem solving and root cause analysis skills including but not limited to, 5 Whys, Cause-Effect/ishikawa diagrams, Value Stream mapping etc. \n\nBasic Qualifications\n\n Bachelors Degree  Salesforce Admin Certified  At least 4 years of experience in Integrating systems  At least 1 year experience with a public cloud (AWS, Microsoft Azure, Google Cloud) \n\nPreferred Qualifications\n\n Master's Degree  2+ years of experience in Agile practices  Salesforce Certified Developer \n\nAt this time, Capital One will not sponsor a new applicant for employment authorization for this position.\n\nThe minimum and maximum full-time annual salaries for this role are listed below, by location. Please note that this salary information is solely for candidates hired to perform work within one of these locations, and refers to the amount Capital One is willing to pay at the time of this posting. Salaries for part-time roles will be prorated based upon the agreed upon number of hours to be regularly worked.\n\nRemote (Regardless of Location): $115,900 - $132,200 for Senior System IntegratorMcLean, VA: $127,500 - $145,500 for Senior System Integrator\n\nCandidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidates offer letter.\n\nThis role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and/or long term incentives (LTI). Incentives could be discretionary or non discretionary depending on the plan.\n\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well-being. Learn more at the Capital One Careers website . Eligibility varies based on full or part-time status, exempt or non-exempt status, and management level.\n\nThis role is expected to accept applications for a minimum of 5 business days.No agencies please. Capital One is an equal opportunity employer (EOE, including disability/vet) committed to non-discrimination in compliance with applicable federal, state, and local laws. Capital One promotes a drug-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901-4920; New York Citys Fair Chance Act; Philadelphias Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\n\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at [phone removed] or via email at [email removed] . All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\nFor technical support or questions about Capital One's recruiting process, please send an email to [email removed]\n\nCapital One does not provide, endorse nor guarantee and is not liable for third-party products, services, educational tools or other information available through this site.\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).\n\n",
    "employmentType": "part_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 0,
    "views": 0,
    "jobApplicationLimitReached": false,
    "applyMethod": "https://www.ihiretechnology.com/ppc/dp/24/485109036?utm_campaign=programmatic&utm_medium=downpost&utm_term=2025-07-14&utm_content=&utm_source=linkedin&ih_linkedinjobtype=slot&ih_date=2025-07-14",
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/ihire-llc",
      "logo": "https://media.licdn.com/dms/image/v2/D560BAQHuNchlo_EfHQ/company-logo_400_400/company-logo_400_400/0/1665581497965/ihire_llc_logo?e=1755129600&v=beta&t=DYxzGq4Ul4hIK8owEt8GdBHQ53_CnW5av4Tx2pNRqKc",
      "website": null,
      "name": "iHire",
      "employeeCount": 164,
      "followerCount": 302644,
      "description": "iHire is a leading employment platform that powers a family of 57 industry-focused talent networks, including WorkInSports, iHireVeterinary, iHireDental, iHireConstruction, and iHireChefs. For more than 20 years, iHire has combined advanced job matching technology with our expertise in the talent acquisition space to connect job seekers with employers in their desired sector. With an industry-specific, candidate-centric, and data-driven approach to recruitment, iHire helps candidates find meaningful work, and employers find unique, high-quality talent – faster, easier, and more effectively than a general job board. Visit www.iHire.com for more information.",
      "specialities": [
        "Jobs",
        "Niche Jobs",
        "Employment",
        "Hiring",
        "Job Search",
        "Job Posting",
        "Resume Writing",
        "Resume Search",
        "Career Advice",
        "Internet Job Board",
        "Niche Job Board",
        "Employer",
        "Job Seeker",
        "Recruiting",
        "HR",
        "outplacement",
        "Talent Acquisition",
        "HR Tech",
        "Recruitment Marketing",
        "Employer Branding"
      ],
      "industries": [
        "Software Development"
      ],
      "locations": [
        {
          "city": "Frederick",
          "state": "Maryland",
          "country": "United States"
        }
      ]
    }
  },
  {
    "id": "4262459038",
    "title": "Senior Cloud Engineer",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4262459038/",
    "postedDate": "2025-07-14T03:03:42.000Z",
    "expireAt": "2025-08-13T03:03:42.000Z",
    "descriptionText": "About GridUnity\n\nAt GridUnity, we are at the forefront of transforming the nation’s energy landscape. Our innovative team is dedicated to solving complex interconnection challenges, delivering precise, high-quality solutions that empower large transmission companies, RTOs, ISOs, and utilities. We foster a culture of collaboration, continuous learning, and strategic innovation, positioning ourselves as a pivotal player in addressing today’s energy challenges.\n\nOur vision is to: Energize the planet with a faster, smarter and more sustainable grid, and our mission is to: Unite all grid interconnection stakeholders on a single platform that converts centralized data into actionable intelligence and accelerates the transition to a reliable, sustainable, and cost-efficient electric grid.\n\nOur advanced platform combines machine learning, configurable business processes, and cloud computing to deliver a suite of SaaS-based products and services with the flexibility to evolve with the world’s changing energy market. The GridUnity platform has been rolled out across North America by entities providing energy to 70% of Americans, and we are accelerating our growth.\n\nAbout The Team\n\nThe GridUnity engineering team is a tight-knit group of experienced professionals who are genuinely passionate about building cutting-edge solutions. We're serious about the quality of our work and the impact it has, but we also believe in the power of a good laugh to fuel creativity and collaboration. You'll find us tackling complex challenges with focused dedication, but never without a healthy dose of humor. We value deep expertise, measured not in years but in the countless hours we've dedicated to honing our craft. We're driven by a shared commitment to innovation and a desire to deliver the very best for our customers, and we wouldn't have it any other way.\n\nAbout The Role\n\nAs a Senior Cloud Engineer, you will be a key technical leader within our team, driving the design, implementation, and optimization of scalable cloud infrastructure. You will collaborate with a cross-functional team of engineers and product managers to architect and support high-scale data ingestion, empowering customers to extract valuable insights and accelerating interconnection and power grid development.\n\nIn This Role, You Will\n\nDesign, develop, and optimize cloud-based infrastructure with a focus on scalability, reliability, and security.Implement and manage cloud solutions using AWS, Azure, or Google Cloud, ensuring seamless integration with our data platforms.Automate infrastructure provisioning, configuration, and deployment using Infrastructure as Code (IaC) tools such as Terraform or CloudFormation.Lead architectural discussions and decision-making for cloud-native applications, data pipelines, and microservices.Enhance system observability, monitoring, and alerting to proactively identify and resolve performance and reliability issues.Advocate for best practices in cloud security, compliance, and cost optimization.Contribute to a collaborative engineering culture by mentoring peers, participating in technical design reviews, and driving innovation within the cloud engineering space.\n\nAbout You\n\n8+ years of experience in cloud engineering, software development, or DevOps, with expertise in cloud platforms (AWS, Azure, or GCP).Strong experience with containerization and orchestration (Docker, Kubernetes).Proficiency in Infrastructure as Code (Terraform, CloudFormation, or Pulumi).Expertise in serverless architectures, microservices, and event-driven systems.Solid programming experience with Node.js/TypeScript, Python, or Golang.Deep understanding of networking, security, and cloud governance best practices.Hands-on experience with CI/CD pipelines, observability tools (Prometheus, Grafana, Datadog), and logging solutions (ELK stack, CloudWatch, etc.).Experience managing relational (Postgres, MySQL) and NoSQL (DynamoDB, MongoDB) databases.Strong problem-solving skills, with the ability to break down complex technical challenges into actionable solutions.A collaborative mindset, with excellent communication skills and a passion for mentoring and knowledge sharing.\n\nNice To Have\n\nExperience with multi-cloud environments.Familiarity with machine learning workflows and big data processing.Experience with hybrid cloud or edge computing architectures.\n\nWe Offer\n\nCompetitive Compensation Packages that recognize your expertise and contributions.Remote-First Work Environment – Remote-first culture that provides flexibilityProfessional Development – Access to training, mentorship, and career pathing.Comprehensive Health/Dental/Vision Insurance – coverage begins on your first day.Short & Long Term Disability and Basic Life Insurance at no cost to you401(k) Plan with a 4% match of your annual earnings to help secure your future.Flexible PTO and a supportive work culture that values work-life balance.Mission-Driven Work – An opportunity to make a significant impact in the energy sector and contribute to groundbreaking solutions in an industry undergoing rapid evolution.\n\nOur Company Values\n\nBoldness & Reliability: We think BIG. We are forward thinking in our approach to reliably accelerating the energy transition.\n\nScrappiness: We empower our teams to solve problems with ingenuity, creativity, and resourcefulness, achieving remarkable results with extreme efficiency.\n\nContinuous Learning: We enable continuous learning via mentorship, training, and career pathing. We welcome challenging objectives.\n\nRadical Transparency: We foster a culture that embraces diverse perspectives and a provides a safe space to give and receive candid feedback with radical transparency.\n\nCustomer-Centric Innovation & Agility: We partner closely with our customers, adapting and innovating to deliver solutions that anticipate their evolving needs with agility.\n\nFunfillment: We believe that holding true to these core values makes life at GridUnity a fulfilling, electrifying, and epic adventure!\n\n___________\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status and will not be discriminated against on the basis of disability.\n\nPursuant to the San Francisco Fair Chance Ordinance, we will also consider for employment qualified applicants with arrest and conviction records.\n\nTo request an accommodation for the application process, please send an email to careers@gridunity.com.\n\nFor the safety of all applicants, we urge you to be vigilant and protect your personal information during your job search. Be mindful that applying for jobs online exposes you to potential threats from individuals seeking to obtain your personal data. Be informed that our official communication will only come through emails from the domain gridunity.com. Any correspondence not originating from this domain should be disregarded and viewed as a potential security threat.",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 440,
    "views": 907,
    "jobApplicationLimitReached": false,
    "applyMethod": "https://jobs.ashbyhq.com/gridunity/87b85be1-0202-46ff-94f0-3e05b0c120c4?src=LinkedIn",
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/gridunity",
      "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQH4xWdVkHNlFA/company-logo_400_400/B4EZW5vuNDH0AY-/0/1742578050150/gridunity_logo?e=1755129600&v=beta&t=FCzbn4ofiUsAyg4QQkI_-e-JAHSPagZufN1Mag_D7bs",
      "website": null,
      "name": "GridUnity",
      "employeeCount": 58,
      "followerCount": 1824,
      "description": "GridUnity® accelerates grid interconnection by streamlining and automating complex, manual processes that delay energy deployment. The company’s cloud-based software helps utilities, system operators, transmission owners, and developers reduce bottlenecks and bring more energy to the grid faster—a capability that is critical for meeting growing demand. GridUnity’s SaaS platform is the only solution that integrates customer engagement, engineering automation, and infrastructure management in one unified system of record—empowering clients to increase efficiency, improve transparency, and make smarter, data-driven decisions. Trusted by North America’s leading utilities and system operators, GridUnity customers serve over 50% of the U.S. population. For more information, visit https://gridunity.com.",
      "specialities": [
        "Energy Analytics",
        "Interconnection Software",
        "Distributed Energy Resources",
        "Smart Grid",
        "Distributed Generation",
        "Predictive Analytics",
        "Machine Learning",
        "Distribution Resource Planning",
        "Hosting Capacity Analysis",
        "Technical Screening",
        "Impact Study"
      ],
      "industries": [
        "Software Development"
      ],
      "locations": [
        {
          "city": "Boston",
          "state": "Massachusetts",
          "country": "United States"
        }
      ]
    }
  },
  {
    "id": "4266112353",
    "title": "Data Engineer",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4266112353/",
    "postedDate": "2025-07-14T03:46:54.000Z",
    "expireAt": "2025-08-13T03:46:54.000Z",
    "descriptionText": "Job Summary:We are seeking a skilled and detail-oriented Data Engineer to join our team. The ideal candidate will have hands-on experience building, optimizing, and maintaining data pipelines and architectures to support advanced analytics and business intelligence solutions. You will work closely with data scientists, analysts, and software engineers to ensure data is accessible, reliable, and scalable.Key Responsibilities:Design, develop, and maintain robust data pipelines using ETL/ELT processes.Build and optimize data systems and architectures (e.g., data lakes, warehouses).Integrate data from various sources (structured, semi-structured, unstructured).Collaborate with stakeholders to understand data requirements and deliver solutions.Ensure data quality, integrity, and security across all data platforms.Monitor data pipeline performance and troubleshoot issues in real time.Participate in the development of data models and support schema design.Implement best practices for data governance, lineage, and metadata management.Required Skills and Qualifications:Strong experience with SQL, relational databases (e.g., PostgreSQL, MySQL, SQL Server).Proficiency with data processing tools such as Apache Spark, Kafka, Airflow, dbt.Programming skills in Python, Scala, or Java.Experience with cloud platforms such as AWS (Redshift, Glue, S3), Azure, or GCP (BigQuery, Dataflow).Familiarity with data warehousing concepts and tools like Snowflake, Databricks, or Hive.Knowledge of REST APIs, JSON, and data integration techniques.Understanding of DevOps and CI/CD practices in data engineering workflows.",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": "https://www.linkedin.com/job-apply/4266112353",
    "applicants": 157,
    "views": 340,
    "jobApplicationLimitReached": false,
    "applyMethod": null,
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/aorzon-technologies-1",
      "logo": "https://media.licdn.com/dms/image/v2/D560BAQHCbwRUmIEToA/company-logo_400_400/B56ZXnxURZHQAY-/0/1743350220310?e=1755129600&v=beta&t=saFt7TcmwshV7xwTrZJl0kroliMDYxU3cAitUa9QxVQ",
      "website": null,
      "name": "Aorzon Technologies Inc",
      "employeeCount": 7,
      "followerCount": 6595,
      "description": "At Aorzon Technologies, we are dedicated to delivering top-tier IT consulting and staffing solutions that drive innovation and business success. With a deep understanding of industry trends and emerging technologies, we bridge the gap between exceptional talent and organizations seeking transformative digital solutions.",
      "specialities": [],
      "industries": [
        "IT Services and IT Consulting"
      ],
      "locations": [
        {
          "city": "Aurora",
          "state": "Colorado",
          "country": "United States"
        }
      ]
    }
  },
  {
    "id": "4264425515",
    "title": "Senior Site Reliability Engineer",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4264425515/",
    "postedDate": "2025-07-14T07:44:56.000Z",
    "expireAt": "2025-08-13T07:44:56.000Z",
    "descriptionText": "ROLE: Senior Site Reliability Engineer\nPRIMARY ACCOUNTABILITIESImprove the reliability of mission-critical solutions, applications, and platformsSoftware development for enterprisesContinuous improvement identification and implementationManage risks and resolve resolves issues that affect applicationsLead efforts to troubleshoot and/or debug issues in any environmentEnable the ability to fully automate every stage of application deliveryLeverage test automation strategies and methods to increase efficiencyIdentify and implement platform enhancements\nQUALIFICATIONS (Both Roles)\nEducation:Bachelor’s Degree in Computer Science or equivalent (Work Experience in lieu of Education)\nKnowledge/Skills/Abilities:Two of the following: Python, Java, C#, Go, etc. with respect to designing, coding, testing, and software deliveryDevOps / Cloud MigrationScripting and AutomationShell Languages Powershell and BashWindows and LinuxRelevant Technologies: Terraform / Azure Kubernetes / .NET 6 / SQL / Cosmos\nYears of Experience: 5 Years of Software Engineering",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": "https://www.linkedin.com/job-apply/4264425515",
    "applicants": 49,
    "views": 90,
    "jobApplicationLimitReached": false,
    "applyMethod": null,
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/interex-group",
      "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQFu8vDCGxDbxw/company-logo_400_400/company-logo_400_400/0/1693320979221/interex_group_logo?e=1755129600&v=beta&t=HdZ8fQ90dUwETQtHtAj-h1UJUm0P8yl-LjAFPpg1cOg",
      "website": null,
      "name": "InterEx Group",
      "employeeCount": 143,
      "followerCount": 477246,
      "description": "InterEx’s vision is to revolutionise the technical resource service market globally. We will do this by redefining the relationship between staffing service providers and customers. Our goal is to offer a comprehensive suite of solutions.\n\nInterEx Group takes a unique approach by offering project-driven, outcome-based solutions across the technology space. We partner closely with our customers to solve their business and technology challenges, utilising our experience and capability of supplying the right expertise and services for all our customers resource needs. InterEx has an exceptional and defined process to deliver an efficient, cost optimised and tailor-made service. \n\nOver the last 8 years we have secured our position as a leader in providing the world’s biggest technical projects with experts in Data, ERP and CRM. We currently have offices in London, Amsterdam, Miami and New York. This allows us to offer a 24/7 service to our clients whereby we can access candidates in every corner of the globe.",
      "specialities": [
        "Microsoft",
        "Microsoft D365",
        "Staffing",
        "Consulting ",
        "security",
        "SAP",
        "CRM",
        "Data"
      ],
      "industries": [
        "Staffing and Recruiting"
      ],
      "locations": [
        {
          "city": "London",
          "state": "England",
          "country": "UK"
        }
      ]
    }
  },
  {
    "id": "4266083559",
    "title": "Senior DevOps Manager",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4266083559/",
    "postedDate": "2025-07-14T01:05:35.000Z",
    "expireAt": "2025-07-26T01:17:09.000Z",
    "descriptionText": "Degreed is the upskilling platform that fuels growth and innovation through lifelong learning. We bring together everything you need to learn and advance: LMSs, courses, videos, articles, projects, and real-world skill insights, matching you with opportunities that align with your skills, role, and goals.\n\nFor businesses, Degreed helps build a culture of learning that attracts, develops, and retains top talent, driving both individual and company success.\n\nWe believe learning is the key to unlocking opportunities. Our mission is to discover, empower, and celebrate the next generation of global expertise.\n\nJoin us in shaping the future of learning and workforce development!\n\nWe're looking for a dynamic and experienced CloudOps Manager to lead our global cloud infrastructure operations at Degreed. In this role, you'll oversee cloud environments across Azure and GCP, ensuring our systems are highly available, scalable, and secure. You'll lead a team of talented CloudOps engineers, drive automation initiatives, and collaborate cross-functionally to support our evolving business needs.\n\nThis is a high-impact opportunity to shape the future of our cloud infrastructure while delivering reliable, high-performing services to millions of users worldwide. If you're passionate about cloud technologies, operational excellence, and leading with a people-first mindset — we'd love to hear from you.\n\nKey Skills\n\n7+ years of experience in cloud operations, with at least 2 years in a leadership or management roleDeep expertise in Azure and GCP, with multi-cloud experience considered a plusProficiency with infrastructure-as-code tools like Terraform or CloudFormationExperience with container orchestration technologies such as Kubernetes and DockerStrong understanding of CI/CD pipelines and deployment automationFamiliarity with monitoring and observability tools such as Datadog, Grafana, or SplunkProven ability to implement and optimize incident detection, response, and resolutionStrong knowledge of cloud security best practices and compliance frameworksSkilled in mentoring and leading high-performing technical teamsProficiency in scripting languages like Python or BashCloud certifications such as AWS Solutions Architect or Azure Administrator are a plus\n\nKey Responsibilities\n\nLead and mentor the CloudOps engineering team, fostering a culture of reliability, growth, and accountabilityManage and optimize cloud infrastructure across Azure and GCP to ensure high availability and scalabilityCollaborate with development, engineering, and customer success teams to align cloud operations with business goalsImplement and refine automated monitoring, alerting, and incident response workflowsOversee change management processes, ensuring minimal disruptions during infrastructure updatesDrive automation initiatives across deployment pipelines, monitoring systems, and operational tasksEnsure adherence to cloud security standards and data governance policiesMonitor and publish key performance metrics to provide visibility into team performance and system reliabilityContinuously improve operational processes to enhance system resilience and customer satisfaction\n\nCompensation\n\nWe are committed to fair and equitable compensation practices.\n\nThe total pay range for this role is $150,000 - $175,000\n\nActual compensation packages are based on several factors that are unique to each candidate, including but not limited to: skill set, depth of experience, certifications, and specific work location.\n\nBenefits\n\n\n\nWe take care of our people with a comprehensive benefits package designed to support your well-being, growth, and success.\n\nView the full details here: https://px.sequoia.com/globalcompanybenefits\n\nAt Degreed, We Value\n\n🌍 Diversity & Inclusion – We celebrate diverse perspectives and backgrounds, fostering an inclusive environment where everyone can thrive and contribute.\n\n📈 Growth Mindset – Learning is at the heart of what we do. We empower our employees to continuously develop their skills and grow their careers in alignment with their unique strengths and aspirations.\n\n🤝 Collaboration – The best ideas come from working together. We cultivate a culture of open communication, teamwork, and shared success.\n\nBy joining Degreed, you'll be part of a community that values learning, collaboration, and meaningful impact. If you're passionate about driving change through upskilling and workforce transformation, we encourage you to apply and contribute to our mission.\n\nWork Environment & Physical Demands\n\nDegreed offers flexible work arrangements tailored to each role. Some positions are fully remote, while others follow a hybrid model for employees near an office. Please check the job details for role-specific requirements.\n\nFor remote and hybrid roles, you'll collaborate virtually using tools like Zoom and Slack. This role may require prolonged computer use and stationary work, with the ability to interpret written and verbal communication effectively.\n\nWe are committed to creating an inclusive and adaptable work environment that enables every team member to thrive and do their best work.\n\nAdditional Information\n\nDegreed is an equal opportunity employer committed to fostering a workplace free from discrimination and harassment. We do not discriminate based on race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state, or local laws.\n\nThis policy applies to all aspects of employment, including recruitment, hiring, career development, compensation, and training.\n\n💡 Accessibility & Accommodations – We are dedicated to full inclusion and will provide reasonable accommodations for applicants with disabilities throughout the hiring process. If you need assistance, please let us know.\n\n🔍 Fair Hiring Practices – In compliance with the San Francisco Fair Chance Ordinance, we consider qualified applicants with arrest and conviction records.\n\n📄 E-Verify Participation – Degreed participates in the E-Verify employment verification program.\n\nGlobal Data Privacy Notice for Job Candidates & Applicants\n\nIf you're applying from specific regions, your personal data may be processed in line with applicable privacy laws, including the General Data Protection Regulation (GDPR) and the California Consumer Privacy Act (CCPA).\n\nTo understand how we handle applicant data, please review our Global Data Privacy Notice and related policies:\n\nGlobal Privacy NoticeGDPR Compliance Details\n\nBy submitting your application, you acknowledge and agree to our use and processing of your data in compliance with applicable laws.\n\nFraudulent Recruitment Warning 🚨\n\nBeware of fraudulent recruitment scams using the Degreed name. Scammers may impersonate our company, website, or hiring team.\n\nDegreed will never:\n\n❌ Conduct recruitment via WhatsApp, Telegram, or direct-messaging platforms.❌ Request sensitive personal or financial information in unsolicited communications.❌ Offer jobs requiring upfront payments or promising unrealistic returns.\n\n✅ Official Degreed communications will always come from a @degreed.com email address or phone number during the hiring process.\n\nIf you encounter suspicious activity, please report it immediately. Stay vigilant and protect yourself from fraud.",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 6,
    "views": 32,
    "jobApplicationLimitReached": false,
    "applyMethod": "https://grnh.se/2d757bc94us",
    "salary": "150,000 - 175,000 USD",
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/degreed",
      "logo": "https://media.licdn.com/dms/image/v2/C560BAQFjJK6SrK9IMQ/company-logo_400_400/company-logo_400_400/0/1630615733042/degreed_logo?e=1755129600&v=beta&t=GHx0R8ybqR7wUWPmx6hxmYYvJ8T0dvFurS6DhPi5_68",
      "website": null,
      "name": "Degreed",
      "employeeCount": 534,
      "followerCount": 76632,
      "description": "Degreed is the leading AI-powered learning platform for enterprise workforce transformation, helping organizations build the skills they need to stay ahead. With deep skill-building experiences, seamless integration with your HR technology suite, and intelligent automation, Degreed personalizes development at scale—so your workforce is always ready for what’s next. To learn more about Degreed, visit www.degreed.com.",
      "specialities": [
        "Education",
        "Credentials",
        "Social Recruiting",
        "EdTech",
        "Education Technology",
        "Learning and Development"
      ],
      "industries": [
        "Software Development"
      ],
      "locations": [
        {
          "city": "Pleasanton",
          "state": "California",
          "country": "United States"
        }
      ]
    }
  },
  {
    "id": "4266030335",
    "title": "Sr. QA Automation Engineer - Remote",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4266030335/",
    "postedDate": "2025-07-13T12:06:53.000Z",
    "expireAt": "2025-08-12T12:06:53.000Z",
    "descriptionText": "Lensa is a career site that helps job seekers find great jobs in the US. We are not a staffing firm or agency. Lensa does not hire directly for these jobs, but promotes jobs on LinkedIn on behalf of its direct clients, recruitment ad agencies, and marketing partners. Lensa partners with DirectEmployers to promote this job for TWO95 International. Clicking \"Apply Now\" or \"Read more\" on Lensa redirects you to the job board/employer site. Any information collected there is subject to their terms and privacy notice.\n\nTitle – Sr. QA Automation Engineer (Cypress)\n\nPosition – Contract (6 +Months)\n\nLocation – 100 % Remote\n\nRate - $Open (Best Possible)\n\nJob Description\n\nBachelor’s degree in Computer Science, Information Technology, Management Information Systems, or related field or comparable industry experience. 5+ years of software test automation experience with a focus on building and maintaining test automation frameworks. Experience with software automation testing methodologies including regression, functional, unit, integration, coverage, performance and load preferred. Experience testing applications that integrate with other systems through RESTful API's preferred. Experience designing test scenarios, breaking down software features and developing automated test strategies required. Strong understanding of continuous integration and deployment preferred. Experience with test management tools such as qTest, ALM, TFS or similar tools preferred. Experience in Agile software development methodology and using tools such as Rally, Jira, TFS, or ServiceNow required. Strong expertise in JavaScript, C#, Java, TypeScript, or other applicable languages as needed required. Advanced understanding of open source web frameworks such as Angular, Bootstrap, Node.js, and Express required. Advanced understanding of web application testing tools such as Selenium, Jasmine, Protractor, Cucumber, Appium, or Cypress required. Experience with API testing frameworks such as Karate, Gatling, JMeter, or Postman preferred. Experience with load and performance testing preferred. Knowledge of Cloud platforms and services such as Amazon AWS, Azure, Heroku, Perfecto Mobile, and SauceLabs preferred. Experience in reviewing and providing feedback to team members during pull requests preferred. Solid understanding of object-oriented principles and Service Oriented Architecture required. Solid understanding of source control tools such as Git or Subversion required. Experience with test-driven development and behavior-driven development preferred. Advanced level experience with SQL preferred. Coaches and mentors Software Test Engineers in execution of automated testing efforts. Leads effort to review product specifications and work with others to develop appropriate test strategies, detailed test plans, and test architectures. Leads formal reviews of test plans, designs, and requirements with cross-functional teams. \n\nParticipates in the evaluation of new tools and technologies to continue enhancing the automation framework.\n\nNote: If interested please send your updated resume and include your rate requirement along with your contact details with a suitable time when we can reach you. If you know of anyone in your sphere of contacts, who would be a perfect match for this job then, we would appreciate if you can forward this posting to them with a copy to us.\n\nWe look forward to hearing from you at the earliest!\n\nIf you have questions about this posting, please contact support@lensa.com",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 20,
    "views": 83,
    "jobApplicationLimitReached": false,
    "applyMethod": "https://lensa.com/cgw/d8f2b26a4f9a4655bd2774c23c10e52dtjo1?jpsi=directemployers&publisher_preference=easier_apply&utm_campaign=Computer%20Occupations&utm_medium=slot&utm_source=linkedin&utm_term=jse",
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/lensa",
      "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQEkHa-0Aki9XQ/company-logo_400_400/B4DZaKylu7GsAY-/0/1746085240184/lensa_logo?e=1755129600&v=beta&t=8w3sv0EdC7S2E1h7mnvHeGWgBQOcNN4zNR0FNH9PPWA",
      "website": null,
      "name": "Lensa",
      "employeeCount": 328,
      "followerCount": 105086,
      "description": "Lensa is a U.S. job search platform with over 20 million registered users.\n\nWe connect jobseekers to a wide range of opportunities from employers, staffing firms, recruitment agencies and job boards. Lensa also offers tools to help users understand their career options and make informed decisions throughout their job search journey — from exploration to application.",
      "specialities": [
        "Recruitment, eRecruitment, Online Recruitment",
        "Talent Acquisition HR Platform",
        "Hiring platform",
        "Job search",
        "Jobs",
        "Employment",
        "job advertising"
      ],
      "industries": [
        "Technology, Information and Internet"
      ],
      "locations": [
        {
          "city": "Chester",
          "state": "Pennsylvania",
          "country": "United States"
        }
      ]
    }
  },
  {
    "id": "4263151633",
    "title": "QA Test Engineer, Trilogy (Remote) - $60,000/year USD",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4263151633/",
    "postedDate": "2025-07-14T09:57:35.000Z",
    "expireAt": "2025-10-07T00:24:37.000Z",
    "descriptionText": "Are you an engineer tired of monotonous testing routines and fragile scripts? Join us and harness the power of AI in QA like never before. You'll spearhead the creation of smart, adaptive test automation frameworks that grow alongside our product. Using GenAI, you'll push the boundaries of QA by simulating edge-case behaviors, generating stress conditions spontaneously, and unearthing bugs others overlook.\n\nWhile most teams are stuck in a cycle of chasing regressions and fixing broken builds, we're pioneering a new approach. Our team is integrated within the product cycle, not just an afterthought. By automating QA workflows with GenAI, we'll generate test plans, scripts, and data directly from live product requirements. Say goodbye to waiting for tickets; you'll be crafting the AI layer that predicts issues before they reach users.\n\nIf you're looking for a role that goes beyond traditional tools and manual testing, this is it. QA is reimagined here—rooted in automated quality analytics, AI-driven failure scenarios, and real-time test feedback that informs release decisions. You won't just validate work; you'll build the system that ensures quality never falters. It's fast-paced, dynamic, and technically challenging.\n\nJoin our high-speed, AI-centric product team dedicated to developing the core of our AI-driven user experience. If you're skilled at crafting scalable automation frameworks, think like a code detective, and are ready to master AI, we want you on our team!\n\nWhat You Will Be Doing\n\nDevelop and uphold AI-driven test automation frameworks to enhance test coverage and efficiencyLeverage GenAI tools to evaluate test outcomes, identify defect patterns, and offer actionable insights for ongoing improvementUtilize GenAI for simulating user scenarios, stress conditions, and edge cases to detect potential issues before they affect users\n\nQA Test Engineer Key Responsibilities\n\nFacilitate bug-free, high-performance releases through QA automation with AI tools and quality audits, ensuring the quality of releases\n\nBasic Requirements\n\nMinimum 4 years of experience in QA engineering with practical experience in test automation frameworksExperience using or developing with GenAI tools for development or QA\n\nAbout Trilogy\n\nHundreds of software businesses run on the Trilogy Business Platform. For three decades, Trilogy has been known for 3 things: Relentlessly seeking top talent, Innovating new technology, and incubating new businesses. Our technological innovation is spearheaded by a passion for simple customer-facing designs. Our incubation of new businesses ranges from entirely new moon-shot ideas to rearchitecting existing projects for today's modern cloud-based stack. Trilogy is a place where you can be surrounded with great people, be proud of doing great work, and grow your career by leaps and bounds.\n\nThere is so much to cover for this exciting role, and space here is limited. Hit the Apply button if you found this interesting and want to learn more. We look forward to meeting you!\n\nWorking with us\n\nThis is a full-time (40 hours per week), long-term position. The position is immediately available and requires entering into an independent contractor agreement with Crossover as a Contractor of Record. The compensation level for this role is $30 USD/hour, which equates to $60,000 USD/year assuming 40 hours per week and 50 weeks per year. The payment period is weekly. Consult www.crossover.com/help-and-faqs for more details on this topic.\n\nCrossover Job Code: LJ-5603-US-NewYork-QATestEngineer.001\n\n",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 284,
    "views": 1002,
    "jobApplicationLimitReached": false,
    "applyMethod": "https://www.crossover.com/roles/a0sIj000001HEFSIA4/qa-test-engineer/apply?utm_source=linkedin&utm_medium=jobslot&utm_campaign=LJ-5603-US-NewYork-QATestEngineer.001",
    "salary": "30 - 30 USD",
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/trilogy",
      "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQHo46awkKVsFg/company-logo_400_400/B4DZY4U_eJHAAY-/0/1744701749693/trilogy_logo?e=1755129600&v=beta&t=TAxQSqatfYbow1F6fi7rca71uhnQbs6ymHsMMydxFVA",
      "website": null,
      "name": "Trilogy",
      "employeeCount": 1217,
      "followerCount": 222943,
      "description": "Trilogy acquires software companies and fundamentally transforms them with an AI-first strategy. We embed AI and automation deep into operations – from development to support – to unlock radical efficiency and drive growth.\n\nPowered by the top 1% of global remote talent sourced via Crossover, we refine proprietary playbooks to build the future of intelligent, high-performance software operations. Join us at the cutting edge.",
      "specialities": [
        "Automotive configuration software",
        "Financial services channel compensation software",
        "telecommunications network management software",
        "telecommunications channel compensation software"
      ],
      "industries": [
        "Software Development"
      ],
      "locations": [
        {
          "city": "Austin",
          "state": "Texas",
          "country": "United States"
        }
      ]
    }
  },
  {
    "id": "4266033338",
    "title": "Remote Chatbot QA - India",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4266033338/",
    "postedDate": "2025-07-13T12:06:36.000Z",
    "expireAt": "2025-08-12T12:06:36.000Z",
    "descriptionText": "Lensa is a career site that helps job seekers find great jobs in the US. We are not a staffing firm or agency. Lensa does not hire directly for these jobs, but promotes jobs on LinkedIn on behalf of its direct clients, recruitment ad agencies, and marketing partners. Lensa partners with DirectEmployers to promote this job for Insight Global. Clicking \"Apply Now\" or \"Read more\" on Lensa redirects you to the job board/employer site. Any information collected there is subject to their terms and privacy notice.\n\nJob Description\n\nInsight Global is seeking a Quality Assurance Tester to create and execute manual and automation test scripts to drive the overall quality and user experience for a Conversational AI platform that is helping our members to get answers to their health insurance questions through the channel of their choice. This role is responsible for identifying the QA test scenarios, partnering with product and technology partners to deliver a superior user experience with a focus on quality.\n\nWe are a company committed to creating inclusive environments where people can bring their full, authentic selves to work every day. We are an equal opportunity employer that believes everyone matters. Qualified candidates will receive consideration for employment opportunities without regard to race, religion, sex, age, marital status, national origin, sexual orientation, citizenship status, disability, or any other status or characteristic protected by applicable laws, regulations, and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application or recruiting process, please send a request to Human Resources Request Form (https://airtable.com/app21VjYyxLDIX0ez/shrOg4IQS1J6dRiMo) . The EEOC \"Know Your Rights\" Poster is available here (https://www.eeoc.gov/sites/default/files/2023-06/22-088_EEOC_KnowYourRights6.12ScreenRdr.pdf) .\n\nTo learn more about how we collect, keep, and process your private information, please review Insight Global's Workforce Privacy Policy: https://insightglobal.com/workforce-privacy-policy/ .\n\nSkills And Requirements\n\n5+ years in the software industry with Quality Assurance\n\nExperience creating test plans, test cases, tracking defects, reporting status to various levels in the organization\n\nExperience testing Natural language speech recognition, conversational AI and cognitive solutions\n\nExperience with automated test tools using Hammer On Demand\n\nExperience writing and executing IVR test cases\n\nKnowledge and experience testing software applications within the Healthcare industry Familiar with Text to Speech, Speech to Text\n\nFamiliarity with leveraging Postman/SoapUI for API testing\n\nExperience with Selenium automation framework\n\nExperience working in SAFe / Agile\n\nUnderstanding of Rally for project and test management\n\nExperience writing and executing IVR test cases\n\nKnowledge and experience testing software applications within the Healthcare industry null\n\nWe are a company committed to creating diverse and inclusive environments where people can bring their full, authentic selves to work every day. We are an equal employment opportunity/affirmative action employer that believes everyone matters. Qualified candidates will receive consideration for employment without regard to race, color, ethnicity, religion,sex (including pregnancy), sexual orientation, gender identity and expression, marital status, national origin, ancestry, genetic factors, age, disability, protected veteran status, military oruniformed service member status, or any other status or characteristic protected by applicable laws, regulations, andordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request to HR@insightglobal.com.\n\nIf you have questions about this posting, please contact support@lensa.com",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 7,
    "views": 67,
    "jobApplicationLimitReached": false,
    "applyMethod": "https://lensa.com/cgw/fa816ccdd4ce4361a03c29c2b65ebc3ctjo1?jpsi=directemployers&publisher_preference=easier_apply&utm_campaign=None&utm_medium=slot&utm_source=linkedin&utm_term=jse",
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/lensa",
      "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQEkHa-0Aki9XQ/company-logo_400_400/B4DZaKylu7GsAY-/0/1746085240184/lensa_logo?e=1755129600&v=beta&t=8w3sv0EdC7S2E1h7mnvHeGWgBQOcNN4zNR0FNH9PPWA",
      "website": null,
      "name": "Lensa",
      "employeeCount": 328,
      "followerCount": 105086,
      "description": "Lensa is a U.S. job search platform with over 20 million registered users.\n\nWe connect jobseekers to a wide range of opportunities from employers, staffing firms, recruitment agencies and job boards. Lensa also offers tools to help users understand their career options and make informed decisions throughout their job search journey — from exploration to application.",
      "specialities": [
        "Recruitment, eRecruitment, Online Recruitment",
        "Talent Acquisition HR Platform",
        "Hiring platform",
        "Job search",
        "Jobs",
        "Employment",
        "job advertising"
      ],
      "industries": [
        "Technology, Information and Internet"
      ],
      "locations": [
        {
          "city": "Chester",
          "state": "Pennsylvania",
          "country": "United States"
        }
      ]
    }
  },
  {
    "id": "4266028490",
    "title": "DERMS Quality Assurance Lead (Test Mgr)",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4266028490/",
    "postedDate": "2025-07-13T12:06:49.000Z",
    "expireAt": "2025-08-12T12:06:49.000Z",
    "descriptionText": "Lensa is a career site that helps job seekers find great jobs in the US. We are not a staffing firm or agency. Lensa does not hire directly for these jobs, but promotes jobs on LinkedIn on behalf of its direct clients, recruitment ad agencies, and marketing partners. Lensa partners with DirectEmployers to promote this job for GE Vernova. Clicking \"Apply Now\" or \"Read more\" on Lensa redirects you to the job board/employer site. Any information collected there is subject to their terms and privacy notice.\n\nJob Description Summary\n\nJob Description Summary\n\nWho are you?\n\nYou are a passionate and technical client-obsessed Quality Assurance Lead / Specialist who understands emerging energy industry trends and implications on utilities and their clients. You are on your way to becoming a trusted advisor to the client, providing technical testing leadership expertise in the planning, design, and build of strategic Test Strategies.\n\nJob Description\n\nWhat will you as our new Quality Assurance Lead work on?\n\nEngage with our utility clients to understand the impacts of distributed energy resources (DERs) on the distribution system by providing our utility clients with solutions to manage and plan for the emergence of more DERs. Engage with our utility clients to understand their Business Needs and how our solution can align, meet and exceed their business needs. Participate in the Requirements Management phase, leading to a complete set of approved requirements that are traceable to both the solution design and QA plan, and test cases. Define success criteria and author Master Test Plans, and Test Strategies for the project. Ensure test strategies are in context of current business processes and incorporates how the business uses our systems Represent the QA function as needed in our internal initiatives and communicate status back to the team (internal and client). Lead testing activities for assigned projects Estimate and communicate quality assurance effort for assigned work Identify and partner with cross-functional teams to ensure all necessary levels of testing are performed Identify, mitigate, and drive product issues and risks to resolution Analyze user story requirements and validate their testability Log defect reports and perform retest of defects as required Communicate test progress and results and other relevant information Collaborate with our Service Engineering development lead during the development cycle to ensure all custom deliverables meet defined needs and standards to be fully tested. Respond to all client inquiries, bugs, and product ideas for in-flight projects and file tickets for the Product team. Perform use case and client specific testing runs and lead factory and site acceptance testing. Define the user acceptance testing process and test cases, and articulate progress metrics. \n\nRequired Skills:\n\nEducation. You hold a bachelor’s degree in engineering or a similar program, with a focus on power systems or relevant experience. Experience. 10+ years of Quality Assurance testing with a solid understanding of testing tools. Experience in/with the following: Testing Cloud/Web-based and/or client or server solutions applications and systems Test automation and direct hands-on experience with automated testing tools Performance testing practices Exceptional customer engagement, presentation, crisis management and overall communication skills Ability to collaborate with other team members to develop and enhance deliverables Capacity to continuously improve team processes to ensure information is of the highest quality, contributing to the overall effectiveness of the team Experience developing application and data customer-focused solutions based upon market and customer needs Experience in the development of estimates, Statements of Work (SOWs) and proposals, outlining professional services required to meet client requirements from a QA test perspective Excellent test design and documentation skills Ability to exercise independent judgment, multi-task, and effectively prioritize tasks Knowledge. You are familiar with emerging energy industry trends and implications on utility clients in the area of DER management, distribution planning, IT, SCADA and asset management with a strong background in analysis. Problem Solving . You can quickly understand and analyze various approaches and processes and are able to configure solutions to client needs given existing product functionality. You have the ability to drill down to the details, obtaining the right level of specificity for your team. You can creatively solve complex problems. Communication . Strong written and verbal communication style. Can effectively share complex technical topics with various levels of audience. Client Focus. You enjoy being in front of clients, listening to their needs. You are deeply focused on ensuring their success. You can create powerful user stories detailing the needs of your clients. Innovation. A genuine interest in new tools and technology. You learn new software quickly without extensive documentation or hand holding. \n\nNice To Have:\n\nMaster’s degree. AWS Certification. DevOps hands on experience. Cybersecurity hands on experience. Familiarity with cloud-based solutions and deployment activities (Azure and / or GCP) Utility integration experience (E.g. SCADA, ADMS, OT, OMS etc.) Experience with power system analysis software (eg OpenDSS, CYME, Powerfactory, Synergi etc.) \n\nAdditional Information\n\nThe base pay range for this position is $81,600.00 - $122,400.00 USD Annual. The specific pay offered may be influenced by a variety of factors, including the candidate’s experience, education, and skill set. This position is also eligible for 15 % variable incentive compensation.\n\nThe Company pays a geographic differential of 110%, 120% or 130% of salary in certain areas.\n\nHealthcare benefits include medical, dental, vision, and prescription drug coverage; access to a Health Coach, a 24/7 nurse-based resource; and access to the Employee Assistance Program, providing 24/7 confidential assessment, counseling and referral services. Retirement benefits include the GE Retirement Savings Plan, a tax-advantaged 401(k) savings opportunity with company matching contributions and company retirement contributions, as well as access to Fidelity resources and planning consultants. Other benefits include tuition assistance, adoption assistance, paid parental leave, disability insurance, life insurance, and paid time-off for vacation or illness.\n\nGeneral Electric Company, Ropcor, Inc., their successors, and in some cases their affiliates, each sponsor certain employee benefit plans or programs (i.e., is a “Sponsor”). Each Sponsor reserves the right to terminate, amend, suspend, replace, or modify its benefit plans and programs at any time and for any reason, in its sole discretion. No individual has a vested right to any benefit under a Sponsor’s welfare benefit plan or program. This document does not create a contract of employment with any individual.\n\nAdditional Information\n\nGE Vernova offers a great work environment, professional development, challenging careers, and competitive compensation. GE Vernova is an Equal Opportunity Employer (https://www.eeoc.gov/sites/default/files/2022-10/22-088_EEOC_KnowYourRights_10_20.pdf) . Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.\n\nGE Vernova will only employ those who are legally authorized to work in the United States for this opening. Any offer of employment is conditioned upon the successful completion of a drug screen (as applicable).\n\nRelocation Assistance Provided: No\n\n This is a remote position\n\nApplication Deadline: agosto 01, 2025\n\nGE Vernova is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.\n\nIf you have questions about this posting, please contact support@lensa.com\n\n",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 7,
    "views": 57,
    "jobApplicationLimitReached": false,
    "applyMethod": "https://lensa.com/cgw/18b7a793230445fca08023bb056f371dtjo1?jpsi=directemployers&publisher_preference=easier_apply&utm_campaign=None&utm_medium=slot&utm_source=linkedin&utm_term=jse",
    "salary": "81,600 - 122,400 USD",
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/lensa",
      "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQEkHa-0Aki9XQ/company-logo_400_400/B4DZaKylu7GsAY-/0/1746085240184/lensa_logo?e=1755129600&v=beta&t=8w3sv0EdC7S2E1h7mnvHeGWgBQOcNN4zNR0FNH9PPWA",
      "website": null,
      "name": "Lensa",
      "employeeCount": 328,
      "followerCount": 105086,
      "description": "Lensa is a U.S. job search platform with over 20 million registered users.\n\nWe connect jobseekers to a wide range of opportunities from employers, staffing firms, recruitment agencies and job boards. Lensa also offers tools to help users understand their career options and make informed decisions throughout their job search journey — from exploration to application.",
      "specialities": [
        "Recruitment, eRecruitment, Online Recruitment",
        "Talent Acquisition HR Platform",
        "Hiring platform",
        "Job search",
        "Jobs",
        "Employment",
        "job advertising"
      ],
      "industries": [
        "Technology, Information and Internet"
      ],
      "locations": [
        {
          "city": "Chester",
          "state": "Pennsylvania",
          "country": "United States"
        }
      ]
    }
  },
  {
    "id": "4266026684",
    "title": "QA Manager",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4266026684/",
    "postedDate": "2025-07-13T12:06:47.000Z",
    "expireAt": "2025-08-12T12:06:47.000Z",
    "descriptionText": "Lensa is a career site that helps job seekers find great jobs in the US. We are not a staffing firm or agency. Lensa does not hire directly for these jobs, but promotes jobs on LinkedIn on behalf of its direct clients, recruitment ad agencies, and marketing partners. Lensa partners with DirectEmployers to promote this job for Zero Hash. Clicking \"Apply Now\" or \"Read more\" on Lensa redirects you to the job board/employer site. Any information collected there is subject to their terms and privacy notice.\n\nAbout The Role\n\nThe QA Manager owns the quality of deliverables. This ownership does not include building the test cases for the team, but to ensure that those exist and that they are run properly. Furthermore, this role requires technical knowledge to understand how to raise the quality of the technical delivery, including test coverage, unit testing quality and integration testing quality.\n\nThis team member will join the product life cycle process and be part of the design cycle from the Product Memo to the Release Memo and final release to PROD. The involvement from the QA Manager will help define quality KPIs based on the project and deliverables.\n\nWhen a release is going to happen, this person will gauge the level of quality of the procedures involved in the release as well as the quality of the tests required to gate the deployment. This also includes documentation and guides provided to the clients.\n\nResponsibilities\n\nMonitoring, evaluating, managing and executing automated and manual testing processes Own our test case management tools Ensuring software products and services consistently meet or exceed customer expectations by developing and executing comprehensive test plans Ensure all production releases adhere to the release management procedures Conduct internal studies and/or audits on product development team activities to evaluate if processes and deliverables fulfill requirements for quality Providing subject matter expertise to product development teams on quality assurance methodologies Collects metrics on software releases and incidents and communicates that information throughout the organization Collects metrics on client management and deliveries and communicates that information throughout the organization Supports development and delivery of training in quality matters Own the documentation of code and business processes, ensuring they are clear and easy to follow for ongoing maintenance Ensure clients satisfaction level is up to required standards (NPS and surveys) Ensure quality of deliveries to clients is up to required standards Gatekeep the releases to uphold maximum quality standards \n\nRequirements\n\n8+ years of experience as a QA or release manager in the financial services field Experience with test case management tools (e.g. TestRail) Excellent written and communication skills Product mindset In-depth knowledge of one or more end-to-end SDLC methodologies \n\nBenefits\n\nWe believe a happy, motivated, and healthy team is the best way to succeed. We offer the following benefits:\n\nChance to earn equity Maternity & Paternity leave WeWork Membership WFH Yearly Stipend L&D Stipend (after 6 months) \n\nAbout Zero Hash\n\nZero Hash's full stack financial infrastructure seamlessly connects fiat, crypto and stablecoins, enabling a better way to move and transfer money and value globally. Zero Hash provides the complete technical infrastructure (delivered through API and SDK) as well as the global regulatory stack to easily and compliantly send, receive, store, and convert fiat, crypto, and stablecoins, in one platform.\n\nStart-ups, enterprises and Fortune 500 companies, including Stripe, Interactive Brokers, Shift4, Franklin Templeton, and MoonPay embed our infrastructure to power a diverse range of use cases: cross-border payments, commerce, trading, remittance, payroll, tokenization, wallets and on and off-ramps.\n\nBacked by Interactive Brokers, Point72 Ventures, NYCA, Bain Capital, and tastytrade.\n\nThe Zero Hash Culture\n\nAll Zero Hash employees are guided by the following characteristics and core principles:\n\nIndependence/Ownership - An ability to work autonomously. Join Zero Hash, pitch ideas, and shape the work you do. Passion - We are innovating quickly and challenging the status quo. We want you to think big, be creative and make a difference every day. Collaborative - A good attitude and respect for others. We're teammates, not co-workers. Everything we do is a shared success and equally a shared failure - we talk in terms of “we” not “me”. Initiative - An ability and passion for learning and asking questions. We will champion you, challenge you and push you to achieve your best - and we expect you to do the same. Empathy - An ability to listen, respect, and understand your co-workers, customers, and everyone you interact with no matter how different they are to you. Adaptability - An ability to respond quickly. We are in a fast-paced industry and so we expect you to be creative when solving a new problem and comfortable under pressure. Transparency - We believe that transparency is critical to empowering everyone to make the best decisions, both the company to its people and vice versa. Integrity - Integrity creates trust. As both an organization collectively and as individuals, it is our most valuable asset. \n\nFollow us\n\nTwitter (https://twitter.com/ZeroHashX)\n\nLinkedIn (https://www.linkedin.com/company/zerohash)\n\nYoutube (https://www.youtube.com/channel/UC8HvrzcqzbusQYyfzctl_VA)\n\nBlog (https://blog.zerohash.com/)\n\nFor candidates based in Colorado, please contact colorado-wages @zerohash.com to request compensation and benefits information regarding a particular role(s). Please include with your email the city you reside (or intend to reside in Colorado) and the title/link to the roles you're interested in.\n\nIf you have questions about this posting, please contact support@lensa.com",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 55,
    "views": 229,
    "jobApplicationLimitReached": false,
    "applyMethod": "https://lensa.com/cgw/9ed452c9480f404e876f0a78556268d5tjo1?jpsi=directemployers&publisher_preference=easier_apply&utm_campaign=Operations%20Specialties%20Managers&utm_medium=slot&utm_source=linkedin&utm_term=jse",
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/lensa",
      "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQEkHa-0Aki9XQ/company-logo_400_400/B4DZaKylu7GsAY-/0/1746085240184/lensa_logo?e=1755129600&v=beta&t=8w3sv0EdC7S2E1h7mnvHeGWgBQOcNN4zNR0FNH9PPWA",
      "website": null,
      "name": "Lensa",
      "employeeCount": 328,
      "followerCount": 105086,
      "description": "Lensa is a U.S. job search platform with over 20 million registered users.\n\nWe connect jobseekers to a wide range of opportunities from employers, staffing firms, recruitment agencies and job boards. Lensa also offers tools to help users understand their career options and make informed decisions throughout their job search journey — from exploration to application.",
      "specialities": [
        "Recruitment, eRecruitment, Online Recruitment",
        "Talent Acquisition HR Platform",
        "Hiring platform",
        "Job search",
        "Jobs",
        "Employment",
        "job advertising"
      ],
      "industries": [
        "Technology, Information and Internet"
      ],
      "locations": [
        {
          "city": "Chester",
          "state": "Pennsylvania",
          "country": "United States"
        }
      ]
    }
  },
  {
    "id": "4266163101",
    "title": "Senior Manager, IT Service Operations ",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4266163101/",
    "postedDate": "2025-07-14T09:25:50.000Z",
    "expireAt": "2025-08-13T09:25:50.000Z",
    "descriptionText": "Our client, a leading professional services organization, is seeking a Senior Manager, IT Service Operations to oversee and optimize the performance of its IT service teams. This role will lead efforts to improve incident and request management, elevate service quality, monitor ticket aging, and drive data-informed reporting and process improvement initiatives.\nThis is a highly metrics-driven position focused on enhancing operational effectiveness across a global service environment. The Senior Manager will collaborate closely with the IT Service Director, the 24/7 IT Support Center, and regional IT leaders to ensure consistent, high-quality support delivery.\nKey Responsibilities:Vendor Oversight: Manage the performance and operations of the external 24/7 IT Support Center. Partner with supervisory staff to address escalations and ensure a strong customer experience.\nService Management: Utilize tools like ServiceNow and Jira to manage service requests through their lifecycle. Ensure proper ticket documentation, escalation, and resolution while promoting ownership and accountability.\nOperational Efficiency: Monitor support activity and performance across teams.Focus on first-call resolution, ticket quality, and aging trends to drive continuous improvement.\nReporting & Analytics: Analyze incident trends and service metrics. Generate actionable dashboards and reports to support IT leadership and team performance tracking.\nSystems Administration: Oversee intake and routing of service requests via cloud-based ACD systems, ServiceNow email intake, and customer portal workflows.\nKnowledge Management: Create and maintain a structured knowledge base, collaborating with technical teams to ensure content is accurate, timely, and accessible.\nProcess & Policy Development: Contribute to the design and implementation of service delivery standards, policies, and best practices across the organization.\nCustomer Advocacy: Act as a customer service champion, identifying opportunities for enhanced support and promoting collaboration across IT teams.\nSecurity Awareness: Enforce adherence to information security policies in all aspects of ticket handling and data management.\nFlexibility: Be available beyond standard hours for urgent or planned initiatives, as needed.\nQualifications:Bachelor's degree or equivalent experience (advanced degree preferred)\n8+ years of experience managing Level 1 and Level 2 IT support teams\nStrong background in call center operations, including ACD systems\nExpertise in ServiceNow and Jira (required)\nSkilled in performance reporting and operational analytics\nPrior experience in professional services or fast-paced environments is required\nProven leadership skills, with 5+ years of team management experience\nExcellent communication and problem-solving abilities\nDemonstrated job stability and a track record of driving service excellence\nSkills and Certifications 8+ years of experience managing Level 1 and Level 2 IT support teamsStrong background in call center operations, including ACD systemsExpertise in ServiceNow and Jira (required)\nSkilled in performance reporting and operational analyticsPrior experience in professional services or fast-paced environments is requiredProven leadership skills, with 5+ years of team management experienceDemonstrated job stability and a track record of driving service excellence",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": "https://www.linkedin.com/job-apply/4266163101",
    "applicants": 22,
    "views": 67,
    "jobApplicationLimitReached": false,
    "applyMethod": null,
    "salary": "160,000 - 210,000 USD",
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/nastech-consulting",
      "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQFXJ02KvFzPHw/company-logo_400_400/company-logo_400_400/0/1631364515070?e=1755129600&v=beta&t=i6Na2SfeRV_FgMPcUJPfPK1TJTJK5bDnVqL31P44yfg",
      "website": null,
      "name": "NASTECH CONSULTING",
      "employeeCount": 2,
      "followerCount": 6339,
      "description": "NASTECH Consulting Services is a global recruiting firm designed in locating skilled individuals and matching them with top companies for career placement within all areas of the Information Technology and Information Systems fields.\r\n\r\nWe pride ourselves in understanding the changes in market conditions and work with our clients and candidates in finding the best possible staffing solution or career to suit each individual's needs. Our service enables customers to gain efficiency in operations, minimize Costs, and keep to a strategy of staying lean, flexible and nimble.\r\n\r\nAnd best of all, we truly believe in a collaborative partnership to provide long-term value to our clients. Our solid corporate experience enables us to deliver the right people, with the right skills, at the right time.",
      "specialities": [],
      "industries": [
        "IT Services and IT Consulting"
      ],
      "locations": [
        {
          "city": "Chennai",
          "state": "Tamil Nadu",
          "country": "India"
        }
      ]
    }
  },
  {
    "id": "4176914701",
    "title": "Senior Staff Software Engineer, Fullstack (Consumer App Experience)",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4176914701/",
    "postedDate": "2025-07-14T09:54:28.000Z",
    "expireAt": "2025-10-02T05:09:50.000Z",
    "descriptionText": "Affirm is reinventing credit to make it more honest and friendly, giving consumers the flexibility to buy now and pay later without any hidden fees or compounding interest.\n\nAffirm is looking for a Senior Staff Software Engineer to take on a critical role in defining and leading technical excellence across all consumer app experiences at Affirm. You’ll collaborate with engineering leaders, create and implement technical strategy across full-stack teams, and coordinate closely with stakeholders to build scalable, reliable, and high-performing solutions. You'll help shape best practices, guide architectural choices, and drive the successful delivery of critical initiatives. This role requires a high level of technical ability, leadership and project management skills, strong cross-functional communication, and a customer-first mindset. You will be responsible for building and directly leading a core group of senior engineers across the company to unlock large-scale product features, building trust and accountability, and developing the overall technology strategy to uphold technical excellence across all consumer mobile and web surfaces within our engineering org.\n\nThe Affirm App and web are the primary surfaces that Affirm brings delightful experiences to our customers. From the first time new users are introduced to their eligible purchasing power with Affirm, to signing up for the Affirm Card, to helping them repay and manage their loans while surfacing the best personalized offers for them. This team spans across multiple products and areas at Affirm to power these products and experiences.\n\nWhat You'll Do\n\nBuild and drive technical strategy for app and web experiences across all consumer facing surfaces at AffirmWork closely with stakeholders across all teams at Affirm to champion and implement technical excellence in conjunction with business resultsCreate and influence a strong ownership culture across teams, with high accountability and investment for building at scaleDeliver critical user experiences that uphold high reliability and performanceGuide or influence product decisions/scope and determine the right technical tradeoffs to deliver customer value quickly.Design, implement, and extend core platform components and functionality to enable new products and features to be builtArchitect and contribute to decisions on the right platform, tools, and technologies to support consistency and reliabilityPartner closely with Front End Platform to plan and drive path-to-green initiatives across platform, features, and product roadmapsPlan, design, and build our core platform software and systems to scale with an increasing number of users, features, business requirements, partners, and new engineers\n\nWhat We Look For\n\n10+ years of experience working across the stack in frontend (mobile, web) and backend. Bonus points using languages like React Native, Javascript, or Kotlin.Strong experience leading multiple engineering teams to deliver results across organizational boundariesTrack record of successfully leading critical projects and leveraging partner teams for company-wide resultsExtensive experience developing and implementing technical strategy that drove prominent change in reliability and responsivenessPrevious project management or people management experience: You know how to influence, effectively communicate, and coach othersTake Ownership: You embody an ownership mindset and help influence a similar culture to those around you. Collaborative partnership across engineering teams and crossfunctional stakeholdersYou have a customer-first mindset: wanting to create the best-in-class experience for our customers, and understand how that translates into the right technical decisionsYou thrive in the ambiguity, and are comfortable diving into code and systems to understand how they work, potential dependencies, and how to constantly improveYou have strong verbal and written communication skills that can help influence and share critical decisions with stakeholdersThis position requires either equivalent practical experience or a Bachelor’s degree in a related field.\n\nBase Pay Grade - R\n\nEquity Grade - 15\n\nEmployees new to Affirm typically come in at the start of the pay range. Affirm focuses on providing a simple and transparent pay structure which is based on a variety of factors, including location, experience and job-related skills.\n\nBase pay is part of a total compensation package that may include equity rewards, monthly stipends for health, wellness and tech spending, and benefits (including 100% subsidized medical coverage, dental and vision for you and your dependents.)\n\nUSA base pay range (CA, WA, NY, NJ, CT) per year: $260,000 - $310,000\n\nUSA base pay range (all other U.S. states) per year: $232,000 - $282,000\n\nAffirm is proud to be a remote-first company! The majority of our roles are remote and you can work almost anywhere within the country of employment. Affirmers in proximal roles have the flexibility to work remotely, but will occasionally be required to work out of their assigned Affirm office. A limited number of roles remain office-based due to the nature of their job responsibilities.\n\nBenefits\n\nWe’re extremely proud to offer competitive benefits that are anchored to our core value of people come first. Some key highlights of our benefits package include:\n\nHealth care coverage - Affirm covers all premiums for all levels of coverage for you and your dependents Flexible Spending Wallets - generous stipends for spending on Technology, Food, various Lifestyle needs, and family forming expensesTime off - competitive vacation and holiday schedules allowing you to take time off to rest and rechargeESPP - An employee stock purchase plan enabling you to buy shares of Affirm at a discount\n\nWe believe It’s On Us to provide an inclusive interview experience for all, including people with disabilities. We are happy to provide reasonable accommodations to candidates in need of individualized support during the hiring process.\n\n[For U.S. positions that could be performed in Los Angeles or San Francisco] Pursuant to the San Francisco Fair Chance Ordinance and Los Angeles Fair Chance Initiative for Hiring Ordinance, Affirm will consider for employment qualified applicants with arrest and conviction records.\n\nBy clicking \"Submit Application,\" you acknowledge that you have read Affirm's Global Candidate Privacy Notice and hereby freely and unambiguously give informed consent to the collection, processing, use, and storage of your personal information as described therein.\n\n",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 81,
    "views": 509,
    "jobApplicationLimitReached": false,
    "applyMethod": "https://job-boards.greenhouse.io/affirm/jobs/6336790003?gh_src=689c81d53us",
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/affirm",
      "logo": "https://media.licdn.com/dms/image/v2/C560BAQEHSbORvS_jKg/company-logo_400_400/company-logo_400_400/0/1630665839795/affirm_logo?e=1755129600&v=beta&t=hwhSJc3B0Z_4epThcevlwSVuE6hzCRAYr9t7Hv1xxEs",
      "website": null,
      "name": "Affirm",
      "employeeCount": 2792,
      "followerCount": 287447,
      "description": "At Affirm, we’re using today’s technology to bring significant disruptive innovation to the financial industry. We focus on improving the lives of consumers by delivering simple, honest and transparent financial products. \n\nWe have roles across a variety of teams, including engineering, product, finance, operations, revenue, marketing, people and more.\n\nA note to applicants: Fake job and recruiting scams are on the rise. Affirm will never ask you to pay any upfront fees or send you any checks to purchase equipment during any part of the recruiting process. Affirm only uses legitimate company email address domains (either “@affirm.com” or \"@us.greenhouse-mail.io”) to communicate with candidates via email. \n\nAffirm is also proud to be a remote-first company! Attracting great people starts by finding talent in different places. That's why we built remote work into the DNA of how we do business—but if an office space is more your style, we have offices in Chicago, New York City, Pittsburgh, San Francisco, Seattle, Toronto, Warsaw, Madrid and London.\n\nNot to mention we have comprehensive and award-winning benefits that were made for you.\n\nInterested in learning more? Check out our careers page and apply today!\n\nVisit affirm.com/careers for more information. \n\n\n",
      "specialities": [
        "eCommerce",
        "Payments",
        "Installment Loans",
        "Millennials",
        "Financial Services",
        "Online Payments",
        "Retail",
        "Personal Finance",
        "FinTech",
        "Financial Technology",
        "Financial Management"
      ],
      "industries": [
        "Financial Services"
      ],
      "locations": [
        {
          "city": "San Francisco",
          "state": "California",
          "country": "United States"
        }
      ]
    }
  },
  {
    "id": "4264442285",
    "title": "Implementation Specialist - 75-Employee Series B - AI-first CRM - 2,000 Active Customers - REMOTE",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4264442285/",
    "postedDate": "2025-07-14T10:43:29.000Z",
    "expireAt": "2025-08-13T10:43:29.000Z",
    "descriptionText": "Our recruiting firm (Bravado) represents a privately-held A.I.-first CRM company that is more highly rated than Salesforce and HubSpot on G2 (4.8), ProductHunt (5.0) and Glassdoor (5.0).  This 75-employee, Series B firm ($64 million in total funding), which has more than 2,000 active clients worldwide, is seeking a Product Implementation Specialist to coach prospects and customers through every step of their product journey. This is a remote role, although you must live in either the San Francisco or New York City metro area. SolutionOur client’s core product is a flexible, collaborative CRM (Customer Relationship Management) platform designed for modern teams, particularly in startups and growing businesses. \nUnlike traditional CRMs, which often require rigid workflows and data structures, we focus on adaptability, allowing users to customize the platform to their unique business needs. Role* Individual contributor role, working from your home office in either the NYC or SF metro area.* $110k to $130k base, commensurate with previous achievement and experience. Plus, equity in an early-stage tech company on an incredible trajectory.* Medical, Vision, Dental; 401[k]; paid parental leave; Apple hardware and a budget for desk amenities; 25 days off, plus holidays.* Top candidates straddle the divide between technical and non-technical teams, and are as comfortable in a room of engineers as you are with marketers and sellers. * You have some professional or academic experience with one programming/query language (Javascript, Python, SQL).* You’re comfortable designing and explaining solutions using SaaS concepts like APIs and JSON, and integrating systems using code or iPaaS solutions like Zapier, Tray,io, IFTTT, etc. Culture* 5.0 Glassdoor. One employee says: “High bar for talent, very smart ICs … culture of working hard and getting things done … kind, decent colleagues.”* Hiring manager joined this firm in 2023 after successful tenures at Looker, Google, and HeadsUp.* The company is filled with ambitious, growth-minded professionals who consider this not just their job, but their mission. * One of their customers says: “We completely rebuilt our GTM stack with (COMPANY) in under 90 days while growing pipeline 500%.” Official Job Description\nWhy is this role important?As a subscription software startup, we only succeed when our customers can quickly learn, adopt, and get value from our product. We spend a lot of time building a simple and intuitive product, but we know there’s no replacement for getting help from a real-life human being when you’re learning a product for the first time.\nOur Product Specialists are the first helpful and friendly face that our customers meet. They work directly with founders and operators helping them set up our CRM. As experts in our solution, they are our most critical touchpoint in making customers, early-stage high-growth startups, successful with our product.\nWe are particularly interested in hearing from you if you have:Direct customer-facing experience deploying, selling, or managing complex products or servicesCustomer-facing experience solving business problems with technologyComfortable designing and explaining solutions using SaaS concepts like APIs and JSON, and integrating systems using code or iPaaS solutions like Zapier, Tray,io, IFTTT, etc.Some professional or academic experience with 1 programming or query language (Javascript, Python, SQL)Comfortable working independently in an unstructured, fast paced, environment with shifting priorities\nWhose team will you join?You will join a small but mighty team of CRM experts that coach prospects and customers through every step of their journey. We straddle the divide between technical and non-technical teams, and are as comfortable in a room of engineers as we are with marketers and sellers. \nWe are endlessly curious and perpetual question askers. We’re intent on understanding the ins and outs of our customer’s businesses, the needs of their teams, and the motivations of each individual we work with.\nWe are builders who may dabble in development, definitely tinker with iPaaS, and help push the bounds of what’s possible.\nPerhaps most importantly, we are teachers and two-way conduits of information between our product team and our customers. We write, speak, and present about our product, how it works, and what our customers achieve with it. We also share stories and feedback with our product and engineering colleagues to help them understand our customers’ needs.\nWhat are the role requirements?In this role, you will be expected to:Work directly and independently with new customers via video call, email, and live chat to ensure their success Design and develop programs to support customer onboarding at scale e.g., user guides, documentation, onboarding emails, office hoursIdentify accounts where there is opportunity to expand our impact and footprint, and collaborate with Sales and Customer Success teams to nurture that growthWork collaboratively with internal teams (e.g., support or engineering) to address and resolve customers product issuesGather client feedback and insights to contribute to the continuous improvement of the product\nWe believe the right person will have the following attributes:Committed. Quickly become an expert in the product.Thoughtful. Contribute to internal knowledge sharing systems and communication templates to make your and your teammates’ work more efficient.Resourceful. Develop customer-facing programs and content to support customers at scale.Resilient. Support a wide variety of customers and needs with a commercial mindset.\nWhat does the hiring process look like?Our hiring process is designed to help us identify people with critical thinking and analytical problem-solving abilities. We will test for excellent customer communication skills and your technical level, in search of no-code experts, basic programming skills and people who are comfortable with APIs and JSON.",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 13,
    "views": 123,
    "jobApplicationLimitReached": false,
    "applyMethod": null,
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/wearebravado",
      "logo": "https://media.licdn.com/dms/image/v2/D560BAQFIU8cysjJ-sg/company-logo_400_400/company-logo_400_400/0/1665691999279/wearebravado_logo?e=1755129600&v=beta&t=A_M5MRIwchzruz7dETPJJ1_5PrSrZDtFkQMj8g6pTgU",
      "website": null,
      "name": "Bravado",
      "employeeCount": 175,
      "followerCount": 52686,
      "description": "Bravado is on a mission to revolutionize the world of sales. We match sales professionals with quality companies looking to hire full-time or fractional sales talent. We are also home to the War Room, the biggest online sales community of over 400k sales professionals globally.\n\nThe future of sales is here. ",
      "specialities": [
        "sales",
        "b2b sales",
        "networking",
        "referral sales",
        "communities"
      ],
      "industries": [
        "Software Development"
      ],
      "locations": [
        {
          "city": "San Francisco",
          "state": "California",
          "country": "United States"
        }
      ]
    }
  },
  {
    "id": "4266127954",
    "title": "Delivery Leader – Commerce and Data",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4266127954/",
    "postedDate": "2025-07-14T07:26:20.000Z",
    "expireAt": "2025-08-13T07:26:20.000Z",
    "descriptionText": "Delivery Leader – Commerce and Data\nBe part of a high growth Customer and Employee Experience consulting firm that has been recognized as one of the fastest growing companies in America by Inc. 5000 and honored in the Deloitte Technology Fast 500 North America. \nAs the Delivery Leader – Commerce and Data, you will lead the delivery organization, ensuring seamless alignment with the sales process and successful implementation of commerce and Data projects. You will oversee multiple engagements, drive profitability, and foster customer and employee satisfaction while leveraging your expertise in commerce and data platforms and digital transformation. \nRoles & Responsibility: Lead and optimize delivery frameworks by implementing standardized project review processes and robust risk management practices.Drive operational excellence through continuous refinement of agile methodologies and automation of project tracking systems.Mentor and develop Project Managers and Delivery Directors, aligning individual OKRs with business goals to build high-performing teams.Ensure exceptional delivery quality across timeline, cost, and scope—consistently exceeding client expectations.Promote a culture of accountability and engagement by embedding organizational values and fostering collaboration across teams.Partner with sales and account teams to support account growth through strategic delivery leadership and client relationship management.Manage project margins and financial performance, ensuring profitability through close collaboration with finance and delivery teams.Embed innovation and client-centric value in delivery models to enhance customer satisfaction and retention.Design and implement scalable frameworks for seamless cross-functional collaboration across service lines and geographies.Identify and act on opportunities to optimize delivery operations, reduce inefficiencies, and scale best practices across the organization.\nJob Requirements 12+ years of experience in project, program, or delivery management in digital consulting, technology services, or a similar fast-paced environment.Proven track record of optimizing delivery frameworks, risk management processes, and agile methodologies at scale.Strong background in team coaching, OKR setting, performance management, and cultural development within delivery organizations.Demonstrated ability to drive high levels of CSAT through operational excellence, innovation, and stakeholder collaboration.Experience in financial oversight of project delivery, including cost control, margin management, and resource allocation.Excellent communication and leadership skills, with the ability to inspire teams and influence senior stakeholders.Prior experience in account farming or supporting account growth through exceptional delivery is highly desirable.PMP, Scrum Master, SAFe, or similar certifications are a plus.\nBenefits of this role\nCompetitive salary and benefits package.Opportunity to work on cutting-edge digital commerce transformation projects.Career growth in a dynamic, award-winning company.Inclusive and collaborative work culture.\nAbout Altudo\nAltudo is an award-winning customer and employee experience consulting firm with a global presence across the US, Canada, and South America. Recognized as one of the fastest-growing companies in America by Inc. 5000 and honored in the Deloitte Technology Fast 500 North America, Altudo has cemented its position as a leader in the industry. Altudo is proud to be recognized among India’s top 50 Best Companies to Work For™ in 2022 and 2023 by the Great Place to Work® Institute. It is also certified as a great workplace for women and millennials. \n Over the last two decades, we have established ourselves as a leader in the customer experience space, with over fifty Fortune 500 companies among our clients. We specialize in creating solutions that improve customer experience and drive revenue. Our work has earned us numerous accolades and international recognition. \n Our success is rooted in our people and our work culture. We provide fast-track growth opportunities to our top performers and foster entrepreneurial avenues that contribute to their holistic development at Altudo. Additionally, we have strong alliances with Sitecore (Platinum), Microsoft, BigCommerce, and Adobe\n Learn more about us at https://www.altudo.co/",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 9,
    "views": 79,
    "jobApplicationLimitReached": false,
    "applyMethod": null,
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/altudo-experience",
      "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQEHdqY5uJmeSQ/company-logo_400_400/company-logo_400_400/0/1630628599300/altudo_1to1_personalization_logo?e=1755129600&v=beta&t=-Y-2wuAlsxiJL7o2qHNuRxvCy48J4m6WIXuN_tQTS9s",
      "website": null,
      "name": "Altudo",
      "employeeCount": 531,
      "followerCount": 85832,
      "description": "At Altudo, we help our clients deliver exceptional customer experience through 1:1 personalization & enhanced engagement to grow revenue streams.\n\nAs Sitecore Platinum partner, our deep understanding of the Sitecore ecosystem goes beyond the basics of CMS to unleash the true potential of a seamless, personalized website experience & curating engagement analytics throughout the customer journey.\n\nWith over 500 employees spread across 9 locations, our team is a rich combination of certified developers, architects and 8 Sitecore MVPs. \n\nWe’ve completed over 2000+ projects for more than 200 clients including 45 Fortune 500 firms, to help deliver ROI using their MarTech stack including CX strategy, marketing automation and data analytics.",
      "specialities": [
        "Digital Strategy",
        "Experience & Commerce Platforms",
        "Customer Experience Strategy",
        "Customer Experience Design",
        "Transformation Consulting",
        "Personalization",
        "Web Development",
        "Mobile Applications",
        "Content Strategy",
        "UI/UX Design",
        "Digital Marketing",
        "Emerging Technologies",
        "IT Staff Augmentation",
        "CRM",
        "Marketing Technology",
        "Marketing Automation",
        "Sitecore",
        "Drupal",
        "Acquia",
        "Contentful",
        "Asana",
        "SimilarWeb",
        "Databricks",
        "Snowflake",
        "Optimizely",
        "Contentstack"
      ],
      "industries": [
        "IT Services and IT Consulting"
      ],
      "locations": [
        {
          "city": "New York City",
          "state": "New York",
          "country": "United States"
        }
      ]
    }
  },
  {
    "id": "4264439101",
    "title": "Principal Mission Critical",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4264439101/",
    "postedDate": "2025-07-14T10:03:03.000Z",
    "expireAt": "2025-08-13T10:03:03.000Z",
    "descriptionText": "Principal, Mission Critical (Electrical Engineering) – REMOTE/HYBRID\nWould you like...?✅ To shape the future of a top 10 Data Center Engineering Firm (BD+C)✅ To drive business growth in a sector generating 30%+ of firm revenue✅ Autonomy & influence spearhead teams, strategy, and high-stakes projects✅ Flexible work remote/hybrid options + industry-leading DTO policy\nOverviewA top 10 national engineering firm, in search of a visionary Principal of Mission Critical with deep electrical engineering expertise to lead their rapidly expanding practice. You’ll oversee cutting-edge data center projects, mentor top talent, and directly fuel business development in a firm where mission-critical work is a core revenue driver.\nResponsibilities🔹 Business Leadership: Identify and secure new mission-critical opportunities, fostering client relationships and strategic partnerships.🔹 Technical Excellence: Provide ultimate oversight on electrical systems design (power distribution, redundancy, UPS, generators) for hyperscale/enterprise data centers.🔹 Team Growth: Recruit, manage, and mentor a high-performing team of engineers; expand the practice’s capabilities and reputation.🔹 Client Stewardship: Act as the face of the firm, translating technical solutions into business value for C-suite and developer clients.🔹 Innovation: Champion R&D in resilient power systems, sustainability, and emerging tech (e.g., AI-driven load management).\nQualifications✔ 15+ years in electrical engineering, with 8+ years focused on data center design.✔ PE License (required) & proven track record in engineering consultancy.✔ Business Development: Demonstrated ability to grow revenue, nurture client pipelines, and win work in mission-critical markets.✔ Leadership: Experience building/managing teams; adept at balancing technical rigor with profit goals.✔ Big-Picture Thinker: Understands how engineering decisions impact scalability, OPEX, and uptime SLAs.\nDay-to-Day⚡ Lead client workshops to align hyperscale/colocation design strategies with performance, scalability, and uptime objectives.⚡ Review and optimize master plans for Tier III+/IV data centers, ensuring resiliency, efficiency, and future-ready innovation.⚡ Collaborate with C-suite and stakeholders to define the firm’s mission-critical design roadmap, balancing cost, risk, and emerging technologies (e.g., liquid cooling, AI-ready infrastructure).⚡ Mentor engineers and designers, fostering expertise in electrical systems, power studies, and sustainable data center best practices.",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 2,
    "views": 20,
    "jobApplicationLimitReached": false,
    "applyMethod": null,
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/dakstaglobal",
      "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQHmZ1AcyjwyUw/company-logo_400_400/company-logo_400_400/0/1688458347723/dakstaglobal_logo?e=1755129600&v=beta&t=-yoAl89Ws4yWz4QAuYQk_igy-Khjuv7calQxL9r7uQM",
      "website": null,
      "name": "Daksta | Connecting Mission Critical Talent",
      "employeeCount": 32,
      "followerCount": 64072,
      "description": "🟪 Our Story\nDaksta’s mission is to be the leading recruitment & executive search partner that are specialists in identifying and partnering with mid-senior level engineering & construction talent and connecting them with leading organisations across advanced facilities markets including Data Centres, Life Sciences and Semiconductors operating across two continents: Europe & USA.\n\nWe are dedicated to delivering tailored solutions to combat the number one challenge for our clients - Securing and retaining talent.\n\nDaksta are proud members of both APSCo and Rec.\n\n🚀Why We're The Best At Connecting Mission Critical Talent\nWe are able to connect the best Mission Critical talent by continually networking with both highly skilled professionals and innovative clients.\n• Speed - Our deep network of Mission Critical professionals allows us to connect talent with our clients quickly and efficiently \n• Quality - Our database and network of >100,000 Mission Critical specific individuals ensures we can connect the best candidates in the market\n• Delivery - Proven with our clients across our tenure, our commitment to you is that we'll deliver on what we promise\n\n⭐ Who We Recruit\nData Centre / Life Sciences / Semiconductor\n• Executive Search / VP / Director\n• Engineering – Automation, Electrical, Mechanical, Civil, Structural, Process, CQV\n• Project Management – Project Director, Site Manager \n• Project Controls – Cost, Planning, Estimating\n• Commissioning \n• HSE \n• Facilities Management \n• Sales\n• Tech / IT\n\n🌎Where We Recruit\n• Europe & North America\n\n📩 Get in Touch\n• +44 207 186 0880 / +353 1 539 8480 / +1 919 561 6915\n• info@daksta.com\n• https://linktr.ee/Dakstaglobal",
      "specialities": [
        "Recruitment",
        "Global Staffing Solutions",
        "Search & Selection",
        "Engineering",
        "Construction",
        "IT & Telecoms",
        "Data Centre",
        "Pharmaceutical",
        "semiconductor"
      ],
      "industries": [
        "Staffing and Recruiting"
      ],
      "locations": [
        {
          "city": "Coulsdon",
          "state": "England",
          "country": "UK"
        }
      ]
    }
  },
  {
    "id": "4266096980",
    "title": "Voice Coach - AI Tutor",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4266096980/",
    "postedDate": "2025-07-14T02:45:42.000Z",
    "expireAt": "2025-08-13T02:45:42.000Z",
    "descriptionText": "Job Title: Voice Coach - AI Tutor\nJob Type: Part-time\nLocation: Remote\nJob Summary:We are seeking a passionate and experienced Voice Coach to join our client's innovative AI Tutoring team. This role involves guiding AI in mastering diverse accents and dialects, utilizing your expertise in voice directing. Work remotely in a dynamic environment on an audio description mini-pilot project.\nKey Responsibilities:• Collaborate with AI developers to enhance voice recognition and synthesis.• Provide expert guidance on accents and regional dialects for AI training.• Conduct intensive voice coaching sessions focused on dialect accuracy.• Evaluate and improve AI’s audio output for clarity and authenticity.• Develop training materials for AI voice modulation and inflection.• Assist in testing and refining AI’s accent capabilities.• Document progress and report findings to the development team.\nRequired Skills and Qualifications:• Proven experience as a voice coach with professional voice acting background.• Expertise in a wide range of accents and regional dialects.• Strong communication skills, both written and verbal.• Ability to work independently and collaboratively in a remote setup.• Familiarity with audio editing tools and software.• Experience in voice directing for diverse projects.\nPreferred Qualifications:• Previous experience in AI or technology-driven projects.• Knowledge of emerging trends in voice synthesis and AI learning.• Experience creating comprehensive voice training modules.",
    "employmentType": "part_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 38,
    "views": 764,
    "jobApplicationLimitReached": false,
    "applyMethod": "https://jobs.micro1.ai/post/168e44a1-15f3-40b3-b89c-ce010193ae50/",
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/micro1",
      "logo": "https://media.licdn.com/dms/image/v2/D560BAQFP2_v6zGgavA/company-logo_400_400/company-logo_400_400/0/1735932161692/micro1_logo?e=1755129600&v=beta&t=V6NjisRbJAJ8TOkAPMXUdQrilXqPVJ_zAiFu8fL1FZk",
      "website": null,
      "name": "micro1",
      "employeeCount": 1103,
      "followerCount": 404604,
      "description": "AI recruitment engine to hire the best talent on earth. Hire from our pre-vetted talent pool instantly or use our software to vet your own talent 10x faster. \n\nWe’re building the AI engine that will match 1 billion people with their dream role.",
      "specialities": [
        "Top Talent",
        "AI",
        "Engineering talent",
        "AI Recruiter",
        "AI Agent",
        "AI Interviewer"
      ],
      "industries": [
        "Software Development"
      ],
      "locations": [
        {
          "city": "San Francisco",
          "state": "California",
          "country": "United States"
        }
      ]
    }
  },
  {
    "id": "4264407695",
    "title": "Senior Designer",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4264407695/",
    "postedDate": "2025-07-14T02:52:40.000Z",
    "expireAt": "2025-08-13T02:52:39.000Z",
    "descriptionText": "As a Senior Designer, you’ll be a proactive creative leader entrusted with advancing Positive Grid’s brand through bold, expressive, and highly polished design. You’ll own visual direction across digital, print, and motion graphics, integrating modern AI tools to enhance both ideation and execution. In close partnership with the Creative Director, you’ll help shape campaign concepts, uphold brand integrity, and influence cross-functional creative output. You’ll also play a key role in prioritizing and streamlining team workflows, contributing to a more agile and innovative design operation.\nApplicants must include their resume, cover letter, and portfolio when applying.\n\n\nCreative Leadership & Brand OwnershipDrive the evolution of Positive Grid’s brand through compelling visual storytelling, concept development and campaign design.Develop visual systems that are scalable, memorable, and expressive across formats and platforms.Deliver polished, high-quality work across all design formats with minimal revisions.Ensure final visual assets, including photography—achieve premium polish through expert-level image manipulation with attention to detail and refinement.\nMotion Graphics & AnimationCreate animated brand assets, marketing visuals, and product-related motion content.Collaborate with content and video teams to bring campaign ideas to life through motion design.\nAI-Enhanced Design WorkflowsMaster and deploy AI tools (e.g., Firefly, Midjourney, Runway, ChatGPT, Gemini) as part of daily production, ideation, and workflow.Use generative design approaches to enhance scalability, experiment with concepts, and accelerate delivery timelines.\nMulti-Platform ExecutionDesign across digital, print, web, packaging, and social media to maintain a unified, bold brand presence.Contribute to photography direction, visual campaigns, post-production refinement and packaging when needed.\nProject Prioritization & Ops SupportPartner with leadership stakeholders to triage incoming requests, manage timelines, and prioritize team workload.Act as a strategic partner to the Creative Director—supporting vision execution, ensuring brand consistency, and helping drive the evolution of the design team’s structure and capabilities.Help create a clear flow of deliverables that balances strategic, high-impact projects with agile creative needs.Cross-Team CollaborationWork closely with marketing, content, product, and PM teams to align creative with business goals.Provide creative feedback, art direction, and mentorship to team members and freelancers as needed.\nKey Qualifications5+ years of experience in graphic design, ideally with exposure to tech, lifestyle, or music-related brands.A portfolio that demonstrates bold brand thinking, excellent execution, and polished motion work.Expert proficiency in Adobe Creative Suite, Figma, and AI design tools (e.g., Firefly, Midjourney, Runway).Advanced Photoshop skills for high-fidelity image manipulation, compositing, and visual polish; ability to independently elevate raw imagery to brand-level quality.Strong understanding of typography, layout, image curation, and storytelling through design.Experience with animation, motion graphics, and interactive content.High attention to detail with a reputation for delivering tight, revision-light work.Ability to manage multiple projects at once and help drive workflow prioritization.Self-starter attitude with strong remote communication skills.\n\n\nBonus SkillsExperience with 3D tools (e.g., Blender, Cinema 4D).Knowledge of print production and packaging workflows.Familiarity with music culture, musicians, or musical instruments.",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": "https://www.linkedin.com/job-apply/4264407695",
    "applicants": 271,
    "views": 1192,
    "jobApplicationLimitReached": false,
    "applyMethod": null,
    "salary": "85,000 - 100,000 USD",
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/confidential1234",
      "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQEi1DJ4p374gQ/company-logo_400_400/company-logo_400_400/0/1643906486347/confidential1234_logo?e=1755129600&v=beta&t=QoZ4WTDR8WY5bW0BFYtkPsoUViAroS0LGnND8H2u0bE",
      "website": null,
      "name": "Confidential Jobs",
      "employeeCount": 1646,
      "followerCount": 977802,
      "description": "Confidential Jobs is operated by ExecThread, Inc. (https://execthread.com).\n\nExecThread is a job discovery platform that provides high-caliber professionals with scalable access to thousands of confidential Board roles & Exec-level career opportunities. Our platform creates transparency in an otherwise opaque & clandestine executive recruiting market. 800k+ executives, and thousands of employers & recruiting firms, leverage ExecThread to discover opportunities and talent alike.",
      "specialities": [],
      "industries": [
        "Software Development"
      ],
      "locations": [
        {
          "city": "New York City",
          "state": "New York",
          "country": "United States"
        }
      ]
    }
  },
  {
    "id": "4129612599",
    "title": "Staff Product Designer, Crypto",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4129612599/",
    "postedDate": "2025-07-14T10:03:34.000Z",
    "expireAt": "2025-10-18T23:23:23.000Z",
    "descriptionText": "Join a leading fintech company that’s democratizing finance for all.\n\nRobinhood Markets was founded on a simple idea: that our financial markets should be accessible to all. With customers at the heart of our decisions, Robinhood and its subsidiaries and affiliates are lowering barriers and providing greater access to financial information. Together, we are building products and services that help create a financial system everyone can participate in.\n\nWith growth as the top priority...\n\nThe business is seeking curious, growth-minded thinkers to help shape our vision, structures and systems; playing a key-role as we launch into our ambitious future. If you’re invigorated by our mission, values, and drive to change the world — we’d love to have you apply.\n\nAbout the team + role \n\nWe’re looking for an exceptional Staff Product Designer to help shape the future of our crypto experiences. Crypto is one of the most dynamic and rapidly evolving spaces in technology, offering endless opportunities for innovation and creativity. As a designer in this field, you’ll tackle complex challenges—like simplifying decentralized systems, building trust in a new financial paradigm, and making crypto truly accessible to all.\n\nThis is your chance to work with finance and technology, crafting products that empower people to interact with and understand crypto in intuitive, meaningful ways. You’ll be designing solutions that break down barriers, foster financial inclusion, and redefine how people engage with our product, all while collaborating with a forward-thinking team passionate about transforming this space.\n\nIt is preferred that this role is located in one of the office locations listed on this job description which will align with our in-office working environment. This position is only eligible for remote work in limited geographies within the US where we do not have physical office locations. Please connect with your recruiter for more information regarding our in-office philosophy and expectations.\n\nWhat You’ll Do\n\nLead with Vision: Drive the design strategy and execution for key crypto features and experiences, setting a high bar for design excellence.Shape the Future: Collaborate with cross-functional teams to define how people interact with and understand crypto, simplifying complex systems for diverse audiences.Champion Inclusion: Ensure our designs empower users of all backgrounds, building experiences that are accessible, equitable, and user-friendly.Own End-to-End Design: From research and ideation to prototyping and delivery, you’ll take ownership of crafting seamless, impactful designs.Mentor and Inspire: Provide guidance and leadership within the design team, fostering collaboration, growth, and innovation.\n\nWhat You Bring\n\nProven Expertise: Extensive experience designing for complex, user-focused products at scale, with a strong portfolio that showcases your ability to simplify intricate workflows.Crypto Curiosity: While deep crypto knowledge isn’t required, an eagerness to dive in and understand the space is a must.Inclusive Design Thinking: A strong commitment to creating equitable and accessible experiences that resonate with diverse user groups.Systems Problem Solver: You excel at balancing micro and macro perspectives, creating cohesive design systems that scale.Collaboration Skills: A proven track record of partnering with engineering, product, and research teams to bring ideas to life.\n\nWhat We Offer\n\nMarket competitive and pay equity-focused compensation structure100% paid health insurance for employees with 90% coverage for dependentsAnnual lifestyle wallet for personal wellness, learning and development, and more!Lifetime maximum benefit for family forming and fertility benefitsDedicated mental health support for employees and eligible dependentsGenerous time away including company holidays, paid time off, sick time, parental leave, and more!Lively office environment with catered meals, fully stocked kitchens, and geo-specific commuter benefits\n\nBase pay for the successful applicant will depend on a variety of job-related factors, which may include education, training, experience, location, business needs, or market demands. The expected salary range for this role is based on the location where the work will be performed and is aligned to one of 3 compensation zones. This role is also eligible to participate in a Robinhood bonus plan and Robinhood’s equity plan. For other locations not listed, compensation can be discussed with your recruiter during the interview process.\n\nZone 1 (Menlo Park, CA; New York, NY; Bellevue, WA; Washington, DC)\n\n$187,000—$220,000 USD\n\nZone 2 (Denver, CO; Westlake, TX; Chicago, IL)\n\n$165,000—$194,000 USD\n\nZone 3 (Lake Mary, FL; Clearwater, FL; Gainesville, FL)\n\n$146,000—$172,000 USD\n\nClick here to learn more about available Benefits, which vary by region and Robinhood entity.\n\nWe’re looking for more growth-minded and collaborative people to be a part of our journey in democratizing finance for all. If you’re ready to give 100% in helping us achieve our mission—we’d love to have you apply even if you feel unsure about whether you meet every single requirement in this posting. At Robinhood, we're looking for people invigorated by our mission, values, and drive to change the world, not just those who simply check off all the boxes.\n\nRobinhood embraces a diversity of backgrounds and experiences and provides equal opportunity for all applicants and employees. We are dedicated to building a company that represents a variety of backgrounds, perspectives, and skills. We believe that the more inclusive we are, the better our work (and work environment) will be for everyone. Additionally, Robinhood provides reasonable accommodations for candidates on request and respects applicants' privacy rights. Please review the specific Robinhood Privacy Policy applicable to the country where you are applying.",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 773,
    "views": 4437,
    "jobApplicationLimitReached": false,
    "applyMethod": "https://boards.greenhouse.io/robinhood/jobs/6545329?t=gh_src%3D&gh_jid=6545329&gh_src=ed898e781us&source=LinkedIn",
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/robinhood",
      "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQESwNiGp2qYlA/company-logo_400_400/company-logo_400_400/0/1728574763254/robinhood_logo?e=1755129600&v=beta&t=R-DqSjUPS2INPK7bfxVjPHWWUy_tQsVkff0qa6IE32g",
      "website": null,
      "name": "Robinhood",
      "employeeCount": 4126,
      "followerCount": 295238,
      "description": "Trade. Invest. Earn. \n\nrbnhd.co/social_media_disclosures",
      "specialities": [],
      "industries": [
        "Financial Services"
      ],
      "locations": [
        {
          "city": "Menlo Park",
          "state": "California",
          "country": "United States"
        }
      ]
    }
  },
  {
    "id": "4266068407",
    "title": "Creative Strategist, Copy",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4266068407/",
    "postedDate": "2025-07-13T22:33:51.000Z",
    "expireAt": "2025-08-10T04:33:46.000Z",
    "descriptionText": "Code3 is an integrated marketing agency, powering business growth for digital disruptors and Fortune 500 leaders alike. Our power is at the intersection of Connections, Creative and Commerce – that’s what is in our DNA. By harvesting insights and utilizing audience data, we work with our clients to develop scroll-stopping content and creative that performs and elevates the brands we work with across all digital media platforms.\n\nOur people are energized by challenges and sprint to find unorthodox solutions. We plan, activate and measure as one team, and we’re not afraid to push boundaries and test our way to success. Coders are Relentless, Gritty, Nimble humans who are always striving to be better.\n\nAs a Creative Strategist at Code3, you’ll work across a range of clients to shape and execute the copy strategy and identity across various digital platforms. You are an expert storyteller, and sharp communicator. You can bring your own ideas to life, as well as collaborate with others to bring a concept to reality. We're looking for someone who has a deep love and understanding for social, keeps current with trends, and understands the nuance of web and commerce channels (e.g. Amazon). You are someone who takes initiative, obsesses over the details and loves getting it all done in a quickly moving environment.\n\nWhat You’ll Do\n\nCreative concepting, copywriting in a variety of styles and mediums across multiple clientsCollaborate with cross-functional teams to conceptualize and execute concepts for websites, retailers, social media and other digital channelsContribute to the development and maintenance of brand guidelines for clientsWork closely with clients to understand their brand, goals, and design preferencesTake ownership of copy from concept to completion, ensuring deadlines and quality standards are metPresent and articulate concepts and work to clients, incorporating feedback and revisions as necessaryCreate and present decks (pitches, creative reviews) for client and internal review Manage creative delivery schedules both yours, and with your peersManaging and organizing assets and deliverablesKeep up to date with industry trends, audiences, category and competitor trendsUse performance data to refine copy and messaging\n\nWho Will Love This Role\n\nA self-motivated and focused multi-tasker with strong attention to detailA curious, strategic/analytical mind that enjoys problem-solvingA born collaborator: You constantly seek outside input. You see constructive criticism as a way to give your design super powers.An experimenter at heart: you’re curious about AI and new technologies to drive efficiencies and expand creative boundariesCuriosity. Tinkering. Drive. Interest. Inspiration. What keeps you up at night?\n\nYou Should Have\n\n3+ years experience creating engaging copy across platforms with a focus in social mediaA background in social media, digital media and creative executionStrong presentation and communication skillsStrong analytical and project management skills\n\nPerks And Benefits\n\nFull medical, dental, and vision benefits as well as generous retirement program Thoughtful parental leave and return programFlexible Time Off, holidays, quarterly Company “Recharge” Days, and holiday closure in DecemberOngoing learning and development opportunitiesCommitment to transparent DEIB practices\n\nCode3’s people are what set us apart. We’re dedicated to hiring, retaining, and developing a diverse group of remarkable Coders because we know it’s the way things should be. By prioritizing our commitment to fostering an inclusive, equitable, and safe environment, we are living our mission of fueling the growth of our people. It’s this focus that empowers Coders to not only achieve great work for our clients, but also propel their own development forward and upward. We strongly encourage people from underrepresented backgrounds and all identities to apply even if you don’t feel that you meet all of the requirements above!\n\nIf you have any special needs that we can accommodate, please reach out to our team at recruiting@code3.com so we can make accommodations.\n\nSalary Information: The base salary range for this position is $65,000 - $80,000 and is commensurate with candidate experience and location.\n\nFor candidates that are based in California, we encourage you to review this important information for California residents here. For best results, open the link in a new tab.",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 35,
    "views": 142,
    "jobApplicationLimitReached": false,
    "applyMethod": "https://job-boards.greenhouse.io/code3/jobs/6948099",
    "salary": "65,000 - 80,000 USD",
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/code3agency",
      "logo": "https://media.licdn.com/dms/image/v2/D560BAQEc_1uAzZD5PA/company-logo_400_400/company-logo_400_400/0/1713292080693/code3agency_logo?e=1755129600&v=beta&t=DC4d5Vd7CoAWMaMBli5lN6DCq7OPci5p_KPxih9SRAg",
      "website": null,
      "name": "Code3",
      "employeeCount": 198,
      "followerCount": 14736,
      "description": "Code3 (formerly SocialCode) is a performance marketing partner working at the intersection of media, creative, and commerce, to help brands succeed faster. With more than a decade of experience, Code3 manages digital advertising for disruptor and global brands, across the world’s most powerful platforms including Amazon, Facebook, Google, Instagram, LinkedIn, Twitter, Pinterest, Snapchat, TikTok, YouTube, and emerging channels like Voice and OTT.",
      "specialities": [],
      "industries": [
        "Advertising Services"
      ],
      "locations": [
        {
          "city": "Cleveland",
          "state": "Ohio",
          "country": "United States"
        }
      ]
    }
  },
  {
    "id": "4266236542",
    "title": "Global Solutions Architect - Legal Technology",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4266236542/",
    "postedDate": "2025-07-14T08:23:56.000Z",
    "expireAt": "2025-08-13T08:23:55.000Z",
    "descriptionText": "About\n\nJoin to apply for the Global Solutions Architect - Legal Technology role at Sodexo1 week ago Be among the first 25 applicantsJoin to apply for the Global Solutions Architect - Legal Technology role at SodexoGet AI-powered advice on this job and more exclusive features.At Sodexo, we are at the forefront of innovation, leveraging cutting-edge technology to drive business success. We are seeking a highly skilled and motivated Solutions Architect to join our dynamic team. If you are passionate about designing robust solutions and leading technical initiatives, we want to hear from you!The Solutions Architect is responsible for providing technical expertise and support to our Legal team, including attorneys, paralegals, and General Counsel. This role involves conducting business/technology impact assessments, designing solutions, and ensuring implementation aligns with best practices and organizational guidelines. The Solutions Architect will be the technical point of contact for the Legal team, enhancing their business capabilities through the use of technology.The Global Solutions Architect will be responsible for the oversight of Legal platforms and related systems. This role involves providing input into overall systems architecture, strategy, and planning. The Solutions Architect will collaborate with Legal partners, various departments (i.e., IT), and outside vendors to develop efficient and effective processes and workflows. This position is accountable for ensuring continuity and successful delivery of functional services to users throughout the organization. Additionally, the role includes delivering data reporting and related analytics, ensuring a high level of data and process integrity, facilitating end-user training, and providing effective and efficient customer service to internal users.Remote Role!What You'll DoAct as a trusted advisor to the Legal team, providing guidance on technology trends, best practices, and emerging solutions.Communicate technical concepts and solutions effectively to both technical and non-technical audiences.Build and maintain strong relationships with Legal team members and stakeholders.Engage with the Legal team to understand their objectives, requirements, and constraints.Design scalable and secure technology solutions that align with legal regulations, policies, and standards.Collaborate with cross-functional teams, including project managers, developers, and engineers, to ensure successful implementation of solutions.Participate in project planning and provide technical guidance and recommendations.Integrate new solutions with existing systems, databases, and applications.Stay up to date with the latest advancements in technology, legal regulations, and industry standards.Provide technical expertise and support to the Legal team, including attorneys, paralegals, and General Counsel.Manage and develop the solution architecture map, ensuring alignment with the strategic plan.Work closely with the Enterprise Architect to review and investigate new solutions.Develop deep knowledge relating to Legal programs, enabling departments to effectively manage complex requests or inquiries.Lead process design and enablement for Legal functions.Oversee data maintenance and integrity for Legal systems.What We OfferCompensation is fair and equitable, partially determined by a candidate's education level or years of relevant experience. Salary offers are based on a candidate's specific criteria, like experience, skills, education, and training. Sodexo offers a comprehensive benefits package that may include:Medical, Dental, Vision Care and Wellness Programs401(k) Plan with Matching ContributionsPaid Time Off and Company HolidaysCareer Growth Opportunities and Tuition ReimbursementMore extensive information is provided to new employees upon hire.What You BringBachelor’s or Master’s degree in Computer Science, Business, Engineering, or a related field.Proven experience in solution architecture, with a strong focus on application and system design.Strong knowledge of architecture principles, system integration, and security best practices.Technical experience with E-discovery, Litigation Holds, Case Management, Matter Management, Legal Research tools, Contract Lifecycle Management, and Compliance.Technical experience with the Conga Platform.Experience leading RFPs, building and deploying new tools, developing application roadmaps, and providing strategic direction and guidance on supporting these tools.Excellent problem-solving and analytical abilities.Strong communication and collaboration skills.Preferred Qualifications:Experience with cloud platforms (e.g., Azure, Oracle, Informatica).Experience with data modeling techniques and tools.Knowledge of data governance, master data management, and security best practices.Proficiency in business process modeling and system integration.Who We AreAt Sodexo, our purpose is to create a better everyday for everyone and build a better life for all. We believe in improving the quality of life for those we serve and contributing to the economic, social, and environmental progress in the communities where we operate. Sodexo partners with clients to provide a truly memorable experience for both customers and employees alike. We do this by providing food service, catering, facilities management, and other integrated solutions worldwide.Our company values you for you; you will be treated fairly and with respect, and you can be yourself. You will have your ideas count and your opinions heard because we can be a stronger team when you’re happy at work. This is why we embrace diversity and inclusion as core values, fostering an environment where all employees are valued and respected. We are committed to providing equal employment opportunities to individuals regardless of race, color, religion, national origin, age, sex, gender identity, pregnancy, disability, sexual orientation, military status, protected veteran status, or any other characteristic protected by applicable federal, state, or local law. If you need assistance with the application process, please complete this form.Qualifications & RequirementsMinimum Education Requirement: Bachelor’s Degree or equivalent experienceMinimum Functional Experience: 5 yearsSeniority levelSeniority levelNot ApplicableEmployment typeEmployment typeFull-timeJob functionJob functionEngineering and Information TechnologyIndustriesFacilities Services, Hospitals and Health Care, and HospitalityReferrals increase your chances of interviewing at Sodexo by 2xGet notified about new Global Solutions Architect jobs in Washington, DC.Solutions Architect, Higher Education and ResearchMaryland, United States $148,000.00-$235,750.00 3 days agoSolutions Architect, NTT Global AllianceDistrict of Columbia, United States $148,000.00-$235,750.00 2 days agoSolutions Architect, Public Sector (D.C. Metro, or surrounding areas)Senior Solutions Architect, Data ProcessingMaryland, United States $184,000.00-$287,500.00 2 weeks agoDistrict of Columbia, United States 4 days agoPrincipal Partner Solutions Architect - GSIWashington, DC $210,600.00-$304,325.00 2 weeks agoResident Solutions Architect -Public SectorDistrict of Columbia, United States $145,000.00-$155,000.00 2 days agoDistrict of Columbia, United States $159,000.00-$185,000.00 2 days agoDistrict of Columbia, United States $122,000.00-$203,000.00 2 weeks agoWashington, DC $114,600.00-$252,100.00 1 year agoWashington, DC $46,000.00-$242,900.00 1 week agoReston, VA $118,730.00-$201,840.00 1 week agoWashington, DC $159,000.00-$185,000.00 2 weeks agoMaryland, United States $128,480.00-$192,720.00 1 week agoMaryland, United States $46,000.00-$242,900.00 1 week agoWashington, DC $170,000.00-$230,000.00 5 days agoMaryland, United States $162,810.00-$260,330.00 3 days agoMaryland, United States $184,000.00-$287,500.00 2 weeks agoSenior Partner Solutions Architect, Atlassian PlatformWashington, DC $133,800.00-$198,300.00 2 weeks agoPartner, Lead Solution Architect – Health Managed ServicesDistrict of Columbia, United States 4 days agoChantilly, VA $114,600.00-$252,100.00 8 months agoPrincipal Solutions Architect Aviation, Project Kuiper Mobility TeamWashington, DC $128,480.00-$192,720.00 1 week agoPrincipal Solutions Architect Aviation, Project Kuiper Mobility TeamMaryland, United States $118,200.00-$204,300.00 2 weeks agoWe’re unlocking community knowledge in a new way. Experts add insights directly into each article, started with the help of AI. #J-18808-Ljbffr\n\nNice-to-have skills\n\nCase ManagementAzureOracleData ModelingDistrict of Columbia, United States\n\nWork experience\n\nSolutions Architect\n\nLanguages\n\nEnglish",
    "employmentType": "contract",
    "workplaceType": "hybrid",
    "easyApplyUrl": null,
    "applicants": 2,
    "views": 5,
    "jobApplicationLimitReached": false,
    "applyMethod": "https://tietalent.com/en/jobs/p-4516694/district-of-columbia-global-solutions-architect-legal-technology",
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/tietalent",
      "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQFEl92phgHiqQ/company-logo_400_400/company-logo_400_400/0/1704358607143/tietalent_logo?e=1755129600&v=beta&t=YhvHgNcr-BoxwbpkuUvZYl2xBvFJsmM0TsRuZf9rCtQ",
      "website": null,
      "name": "TieTalent",
      "employeeCount": 24,
      "followerCount": 86481,
      "description": "TieTalent is the career growth platform designed for tech professionals, connecting talents with top companies worldwide.\n\nBy joining our community, talents gain access to a complete overview of the job market and exclusive career resources. We offer two ways to find your next opportunity:\n\n✅ Let Job Opportunities Discover You – Create your profile, and our intelligent system matches you with job openings that align with your skills and career goals. Companies apply to you, and you decide which opportunities to explore.\n\n🔍 Explore External Job Listings – Discover a broad range of job openings from multiple sources. Think of TieTalent as the \"Kayak\" for jobs: we show you opportunities across various platforms, and when you show interest in an external listing, you’ll be redirected to apply directly through the respective site.\n\nFor companies, TieTalent provides a smart hiring platform that makes finding top tech talent fast and hassle-free. Our AI-powered system, combined with expert insights, connects businesses with 100K+ vetted professionals in IT, tech, AI, marketing, and sales—helping you hire the right talent quickly and efficiently.\n\nSince launching in October 2018, TieTalent has been trusted by hundreds of thousands of tech professionals and thousands of companies—from innovative startups to leading global enterprises.\n\n👉 Join us and be part of the future of tech recruitment.\n\n📜 Imprint & Terms & Conditions: https://tietalent.com/en/terms-and-conditions",
      "specialities": [
        "Recrutement",
        "Marketplace",
        "Jobs",
        "Talent match",
        "Talent matching services",
        "recruitment services ",
        "Talent Magnet "
      ],
      "industries": [
        "Software Development"
      ],
      "locations": [
        {
          "city": "Renens",
          "state": "Vaud",
          "country": "Switzerland"
        }
      ]
    }
  },
  {
    "id": "4266240401",
    "title": "Software Engineering Team Lead",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4266240401/",
    "postedDate": "2025-07-14T08:49:26.000Z",
    "expireAt": "2025-08-13T08:48:50.000Z",
    "descriptionText": "Contract Role: React/Next.js Engineering Lead\n Location: Cardiff (Remote-first, ideally local for occasional on-site meetings)\n Rate: Up to £600/day (Inside IR35, includes any travel)\n Start Date: ASAP (subject to BPSS clearance)\n Duration: 3 months initially, scope through to March 2026 A leading public sector body is building a new bilingual customer portal and is looking for a React/Next.js Engineering Lead to head up the technical delivery.You'll set the front-end direction, lead a small team, and stay hands-on with the code. The platform will integrate with internal systems and must meet GOV.UK standards for accessibility, performance, and security. Key Requirements:\n\nStrong React and TypeScript experience\nHands-on Next.js (preferred) and/or .NET Core\nExperience leading teams or acting as a technical lead\nSolid testing background (Jest, Cypress, XUnit)\nFamiliar with WCAG accessibility and GDS guidelines\nSkilled in Git, CI/CD, and modern DevOps practices\n Nice to Have:\n\nSQL/Entity Framework\nAzure or containerisation (Docker) experience\nKnowledge of Microsoft Dynamics or case management systems\n You'll be joining a collaborative, delivery-focused team with long-term ambitions. This is a high-impact role with a clear roadmap and an important end user. Interested? Apply now to discuss the role in more detail.",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 10,
    "views": 75,
    "jobApplicationLimitReached": false,
    "applyMethod": "http://www.applybe.com/?a=8428CA608.0",
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/xpertise-recruitment-ltd",
      "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQF31BdSrqltlg/company-logo_400_400/company-logo_400_400/0/1735814465101/xpertise_recruitment_ltd_logo?e=1755129600&v=beta&t=LicdcwDq8Oqm2bHlXwQO9V8Cbet0-crJ_CbxUGMQYxQ",
      "website": null,
      "name": "Xpertise Recruitment",
      "employeeCount": 35,
      "followerCount": 94755,
      "description": "Xpertise specialise in recruiting top to bottom Technology, Data and Transformation talent on a permanent & contractor basis across the UK. \n\nOur recruitment services have been recognised many times over including “Best IT/Technology Recruitment business”, “Best Client Service”, “Best Recruitment business in the UK to work” and many more viewable on our website. \n\nOur mission is to bring the human touch and build communities which is the envy of our industry and we do that through our “elevate” community events & treating people in the way that we would want to be treated.\n\nOur specialist areas include:\n\n- Senior IT Appointments\n- Cloud, Infrastructure, SRE and DevOps \n- Product, Project Delivery & Transformation \n- Software Engineering \n- Quality Engineering and Testing \n- Analytics, Data, AI and ML \n- Cyber Security and InfoSec \n- Architecture\n\nShould you be looking for a new role please email your CV to marketing@xpertise-recruitment.com",
      "specialities": [
        "Technology Recruitment",
        "Digital Recruitment"
      ],
      "industries": [
        "Staffing and Recruiting"
      ],
      "locations": [
        {
          "city": "Derby",
          "state": "England",
          "country": "UK"
        }
      ]
    }
  },
  {
    "id": "4266237360",
    "title": "Senior Platform Engineer",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4266237360/",
    "postedDate": "2025-07-14T08:01:50.000Z",
    "expireAt": "2025-08-13T08:01:50.000Z",
    "descriptionText": "What Makes us Different\nThe One Word GTM platform is highly configurable to fit the unique needs of each customer. Within our portfolio of stack solutions and a vast range of possible services we can seamlessly align to even the most complex supply chains.\nWe measure everything in the product ecosystem, including the world’s physical products and their interaction with global trade. This allows us to accurately evaluate impact, resulting in more sustainable business decision making. Benefiting people, planet and profit.\nHow You’ll Make an Impact as a Senior Platform Engineer \nDesign, deploy, and maintain highly available, secure, and cost effective cloud infrastructure on AWS.Leverage Infrastructure as Code tools like Terraform to streamline deployments and reduce manual work.Ensure maximum uptime, performance, and scalability by implementing best practices in Site Reliability Engineering.Mentor engineers, advocate for DevOps culture, and drive improvements across development, security, and operations.Stay ahead of the curve by adopting the latest AWS services, observability tools (Grafana), and Kubernetes based architectures.Implement security best practices and governance controls to protect critical systems and data.Work closely with cross-functional teams to support fast, efficient, and seamless software deployments.\nYour efforts will ensure our applications meet the diverse needs of global supply chains, contributing to our mission of creating sustainable, technology-driven solutions for worldwide trade.\nWhat We’re Looking for from You\nProven experience with AWS and deep understanding of cloud architecture best practices (AWS Well-Architected Framework).Hands-on experience with Terraform, Ansible, CloudFormation or similar tools.Proficiency with Kubernetes (EKS preferred), Docker, and ECS Fargate.Expertise with Jenkins, GitHub Actions, GitLab CI/CD, or Azure DevOps to enable fast and reliable releases.Strong experience with Python or Go, particularly for scripting and automation.Ability to troubleshoot complex infrastructure challenges and mentor engineers.Experience implementing IAM roles, security groups, encryption, and compliance standards.Strong teamwork and stakeholder management skills.\nDon’t worry if you don’t have everything in this list. We firmly believe in the power of hiring passionate people who are keen to learn. So if our business sounds of interest to you please get in touch!\nOur Culture\nLife at One World celebrates diversity and fosters collaboration through a vibrant workplace culture. We are proud to be ahead of industry D&I stats, with one in three One Worldians being female, and we celebrate a wide range of cultural backgrounds. Regular social events bring our workforce together, creating a united and inclusive environment. These gatherings provide opportunities for employees to share their unique backgrounds, traditions, and perspectives, strengthening bonds across teams and departments. Our commitment to embracing diversity not only enhances the work experience but also fuels innovation and creativity, as varied viewpoints contribute to our mission of creating sustainable supply chains for the benefit of people, planet, and profit.\nAdditional Benefits:\nPerformance bonusHybrid WorkingInterest Free Company loan up to £1,000Life AssurancePension SchemeWork from home set upFlu Jabs AnnuallyCycle to work SchemeTraining Budget per person per year - £2750Referral Bonus up to £750 per person you refer to work at One WorldCare First – Counselling and SupportTailored learning, progression and Development PlansSupply Chain Academy – Educational courses Available all costs covered.Free Eye Test annually + £60 vouchers towards glasses\nLife at One World\nOne World has been providing supply chain software to manage billions of products and thousands of organisations since 2010, and we're now embarking on a journey to create the supply chain of the future using next generation technology, innovation and creativity.\nOur mission is to empower supply chains through the management and optimisation of the product ecosystem, to promote trust and optimisation, from cradle to cradle. And that's why our software spans the entire trading ecosystem, enabling a product to be managed through every stage of its lifecycle. This visibility, insight and abundance of data allows us to deliver against our overall vision of sustainable supply chains for the benefit of people, planet and profit.\nWe’re part of GB Global, which provides comprehensive, fully managed and operated supply chain solutions, stimulating and supporting trade around the world. Since being founded in 1984, GB Global Group has grown to become the UK’s fastest growing privately owned supply chain and global trade management company. It currently employs over 3,000 people across its global network and has a turnover in excess of £1.5bn.\nWe’re always looking for passionate, innovative and capable individuals to join our team, who want to be part of making a difference through technology for the benefit of the planet, people and profit.",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 29,
    "views": 111,
    "jobApplicationLimitReached": false,
    "applyMethod": "https://oneworld.pinpointhq.com/postings/ed25a84a-6dde-4525-88ad-6dfa297714bd?utm_medium=social&utm_source=LinkedIn",
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/one-world-gtm",
      "logo": "https://media.licdn.com/dms/image/v2/D560BAQHMPCvemLB5gg/company-logo_400_400/company-logo_400_400/0/1709733048774/one_world_gtm_logo?e=1755129600&v=beta&t=fLl3IC3L_DSliwfOvdWDRbUOWSy96BRedwKxlBfS244",
      "website": null,
      "name": "One World GTM",
      "employeeCount": 53,
      "followerCount": 1868,
      "description": "Established in 2010, we are the first ever truly transparent, collaborative, intelligent digital supply chain system. We provide transparency at every level from raw material to component traceability to recycling or upcycling the product. One World brings together cutting-edge digital capabilities with the financial firepower and operational infrastructure of a world leading supply chain company. It provides organisations with the flexibility they need to reduce the impact of events that disrupt competitors’ supply chains, helps them be more efficient, and enables them to transform global practices. One World enables users to manage and reduce risks to the climate and their reputation\n\nWe have the people, process, and technology to create full product lifecycle management from creation to re-use. \n",
      "specialities": [
        "SaaS",
        "Global Trade",
        "Supply Chain",
        "Product",
        "Sustainability",
        "Trade",
        "Make",
        "Move"
      ],
      "industries": [
        "Software Development"
      ],
      "locations": [
        {
          "city": "London",
          "state": "England",
          "country": "UK"
        }
      ]
    }
  },
  {
    "id": "4266149976",
    "title": "MLOps Engineer | Python | Machine Learning | GCP | Kubernetes | CI/CD | Remote, UK",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4266149976/",
    "postedDate": "2025-07-14T08:37:51.000Z",
    "expireAt": "2025-09-12T08:37:44.000Z",
    "descriptionText": "MLOps Engineer | Python | Machine Learning | GCP | Kubernetes | CI/CD | Remote, UK\nAbout UsWe are an early-stage biotechnology company using live cell imaging and artificial intelligence to predict stem cell behavior. Our goal is to improve the manufacturing of human cells for research and therapeutic use by enabling a deeper understanding of cell differentiation. Founded in 2022 as a spin-out from a leading UK research institution, we are backed by prominent venture capital firms with experience investing in AI, life sciences, and deep tech startups.\nWhat We’re BuildingAt the core of our technology is a proprietary AI-powered SaaS platform that enables scientists to visualize, track, and predict cell differentiation in real-time. Designed to support high-throughput experiments, the platform integrates microscopy, computer vision, cloud infrastructure, and machine learning to accelerate advancements in cell biology and biomanufacturing.\nWe are currently seeking a DevOps / MLOps Engineer to help scale our cloud infrastructure and machine learning workflows as part of our growing technical team.\nKey ResponsibilitiesDevelop and maintain infrastructure for our SaaS platform that delivers AI-driven computer vision tools to researchers and scientists.Collaborate with a multidisciplinary team of machine learning engineers, data scientists, software developers, and biologists.Build and support GPU-accelerated environments for training and real-time inference of deep learning models.Deploy and manage ML pipelines using tools like Docker, Kubernetes, and frameworks such as Kubeflow or Ray.Create and document APIs that enable internal and external users to access data and model outputs.Implement secure authentication and authorization systems for platform users.Maintain and improve our cloud platform’s reliability, security, and compliance (e.g., GDPR, HIPAA readiness).Automate testing, training, and deployment of models through robust CI/CD pipelines.Monitor and troubleshoot performance issues across data and inference workflows in production.\nWhat We’re Looking For5+ years of experience in DevOps, MLOps, SRE, or Data Engineering roles.Strong proficiency with public cloud platforms (e.g., GCP, AWS, or Azure), with preference for GCP.Expertise in Terraform and infrastructure-as-code practices.Solid experience deploying workloads with Kubernetes, including cluster and node management.Familiarity with ML workload orchestration using Docker, Kubeflow, Ray, or similar tools.Skilled in Python and comfortable working with SQL and data processing tools.Understanding of the machine learning lifecycle from data ingestion to inference.Experience handling large-scale datasets and optimizing data pipelines.Strong communication skills and the ability to clearly document complex systems.A self-driven mindset and interest in staying current with trends in cloud, data, and ML tools.Experience leading infrastructure efforts in greenfield or early-stage environments.\nNice to HaveExperience working on SaaS platforms in biotech, healthcare, or life sciences.Experience with real-time ML inference and production monitoring.Familiarity with computer vision models and workflows.Understanding of data privacy regulations and scientific data formats (e.g., TIFF, OME-TIFF).Background working in early-stage startups (seed or Series A).\nWhat We OfferCompetitive salary and benefits.Growth opportunities and professional development.A collaborative, forward-thinking environment at the intersection of AI and biotechnology.A meaningful mission with the potential to impact healthcare through innovation in science and technology.\nWhy Join UsYou'll be part of a rapidly growing, interdisciplinary team working on complex challenges in AI and biology. Your contributions will shape the technical foundation of our product and accelerate both scientific discovery and therapeutic development. This is an opportunity to make a tangible impact during a pivotal stage of growth.\nMLOps Engineer | Python | Machine Learning | GCP | Kubernetes | CI/CD | Remote, UK",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": "https://www.linkedin.com/job-apply/4266149976",
    "applicants": 17,
    "views": 47,
    "jobApplicationLimitReached": false,
    "applyMethod": null,
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/enigma-rec",
      "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQFEqpNFpIoqsQ/company-logo_400_400/company-logo_400_400/0/1713259859209/enigma_rec_logo?e=1755129600&v=beta&t=1LC6SGyuEKmEpsZCStuu6G3pfO6lhVpiLXNg0Igz2Uc",
      "website": null,
      "name": "Enigma",
      "employeeCount": 25,
      "followerCount": 36140,
      "description": "Here at Enigma, we specialize in Generative AI recruitment, specifically focused on Machine Learning and Software Engineering disciplines. With a combined experience of 20+ years, we understand the intricacies of finding the perfect role as well as the right talent for your team.\n\nBut what sets Enigma apart? Our consultative approach. We don't just match candidates with job openings; we guide candidates, founders, and hiring managers through the recruitment process. Our value-added services go beyond traditional recruitment efforts, offering services such as recruitment process structuring, salary benchmarking, share allocation, CV reviews and so much more.\n\nWe're more than recruiters – we're partners in your success journey. Our mission is not only to connect you with exceptional talent and companies but also to support your growth and success every step of the way. We're committed to your success. Let us partner with you to connect you with people and companies alike, that will drive growth and innovation for years to come.",
      "specialities": [],
      "industries": [
        "Staffing and Recruiting"
      ],
      "locations": [
        {
          "city": "London",
          "state": "England",
          "country": "UK"
        }
      ]
    }
  },
  {
    "id": "4266039681",
    "title": "Technical Co-Founder – AI Platform (Life Insurance)",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4266039681/",
    "postedDate": "2025-07-13T13:28:13.000Z",
    "expireAt": "2026-01-09T13:28:13.000Z",
    "descriptionText": "We're seeking a Technical Co-Founder to join us at the ground level of a high-potential B2B AI SaaS startup in the financial services/life insurance industry.\nWe’ve validated the problem, secured early industry interest & traction (pre-revenue), and built the business framework/POC. We’re now looking for a visionary full-stack developer and AI expert to own the product roadmap and subsequently bring the platform up to MVP standards and to market. \n(STRICTLY UK BASED INDIVIDUALS ONLY!)\n🔧 What You’ll Do:Lead all things tech — architecture, development, infrastructure, deployment & securityBuild and scale our platform using Microsoft AzureOwn the full-stack: frontend, backend, databases, APIs, and DevOpsDrive AI/ML integration across the product to unlock automation & insightsCollaborate on product strategy, innovation, and roadmap planningHelp raise funding, hire/lead the tech team, and shape the company culture 🧠 What You Bring:Proven experience as a full-stack developer and technical founder or early-stage startup engineerDeep knowledge of Microsoft Azure ecosystem (App Services, Functions, DB, DevOps, etc.)Strong AI/ML skills (NLP, LLMs, data pipelines, model deployment)Ability to build scalable and secure SaaS platforms from scratchStartup mindset — resourceful, fast-moving, and relentlessly curiousBonus: FinTech or InsurTech experience (from a compliance, security & sensitivity approach) 🌍 What’s in It for You:Co-founder equity and leadership stakeFull autonomy over the technical direction and stackA chance to build something transformative in a multibillion-dollar industryA driven, business-savvy co-founder who’s already secured early momentum\nPlease note this is a NON-SALARY/AGENCY position, please only apply if you're genuinely interested in becoming a technical co-founder and NOT an employee/freelancer",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": "https://www.linkedin.com/job-apply/4266039681",
    "applicants": 20,
    "views": 141,
    "jobApplicationLimitReached": false,
    "applyMethod": null,
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/mcgimpsey-vallis-ltd",
      "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQGYYJsAJ6zZVQ/company-logo_400_400/company-logo_400_400/0/1729599018571/mcgimpsey_vallis_limited_logo?e=1755129600&v=beta&t=-8EpSuz7kCNQ6tQrhjah9Zmw0dlq45psRPB4bJxMugw",
      "website": null,
      "name": "McGimpsey Vallis Ltd",
      "employeeCount": 5,
      "followerCount": 33,
      "description": "Providing external lighting maintenance, LED upgrades, and lamppost installation services to commercial and retail clients",
      "specialities": [
        "External lighting maintenance",
        "LED upgrades",
        "Lamppost installation"
      ],
      "industries": [
        "Facilities Services"
      ],
      "locations": [
        {
          "city": "Chinnor",
          "state": "England",
          "country": "UK"
        }
      ]
    }
  },
  {
    "id": "4263893763",
    "title": "Power Platform Technical Consultant",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4263893763/",
    "postedDate": "2025-07-13T18:18:30.000Z",
    "expireAt": "2025-08-12T18:18:29.000Z",
    "descriptionText": "A global business and technology transformation partner is looking to hire a MS Power Platform Technical Consultant.\nWARNING: for this role candidates who require company support to legally live and work in the UK cannot be considered.\nTo be successfully appointed to this role, it is a requirement to obtain Security Check (SC) clearance. To obtain SC clearance, the successful applicant must have resided continuously within the United Kingdom for the last 5 years.\nRole is hybrid the first 6 month, 2 days in Newcastle, Manchester or Blackpool and fully remote after that. \nWhat will you do:Identify user needs and create great relationships with project stakeholders.Lead the design, development and implementation of Power Platform solutions to meet user needs within a delivery teamBe a technical specialist, producing high quality applications, both model driven and canvas, as well as enterprise scale Power Automate Cloud Flow solutions.Understand governance principles and be able to advise on best practices for empowering every Power Platform maker.Build solutions as part of an agile team using declarative tools, backed by Microsoft and using our own technical accelerators. You will be part of teams that follow software engineering best practices, and you will have a say in the design of a solution.\nYour skills and experience:Energy and excitement about the Power Platform, the technologies and capabilities it offers, and knowledge of its limitations.Hands on experience with Dataverse and Dataverse for Teams as part of implementing Power Platform solutions.Hands on experience in the setup of CI/CD, ideally using Azure DevOps.A passion for and experience with industry-wide standards and best practices when designing and building solutions in the Power Platform.A focus on delivering positive outcomes to our clients, whatever their scale.Experience delivering according to an agile methodology, working in collaborative teams in a commercial environment.\nHiring process: two stepsSalary- up to £75,000 annually DOE\nDirect hire full time employee opportunity (B2B contract is not available).\nWe offer an attractive referral scheme for placements we make (Terms & Conditions apply). https://www.tenthrevolution.com/referral-scheme so if you know anyone in your network who might be suitable or is looking for a specific role, please refer them to me.\nApply here if you would like to join a professional community of experts, who have got your back and will support you, every step of the way.",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": "https://www.linkedin.com/job-apply/4263893763",
    "applicants": 22,
    "views": 186,
    "jobApplicationLimitReached": false,
    "applyMethod": null,
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/tenthrevolution",
      "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQG1cF08hlVJUQ/company-logo_400_400/company-logo_400_400/0/1713427059617/tenthrevolution_logo?e=1755129600&v=beta&t=7xXZAPJdpXkZJWB0ZwaaMSPXl-uKn7oUi9iA3Fpc8fI",
      "website": null,
      "name": "Tenth Revolution Group",
      "employeeCount": 2210,
      "followerCount": 393956,
      "description": "As the global leaders in solving the technology skills gap, we find, train, and deploy experienced professionals, reskill your existing staff and deliver world-class consulting services, all through our unique range of talent solutions.\n\nWhat we do\n\nFind talent\nPermanent and contract recruitment for one role or an entire team\n\nTrain talent\nUpskill existing employees via our training programs\n\nDeploy talent\nAccess experienced professionals through our hire-train-deploy model\n\nConsulting services\nA new team or project support provided by us on a consultancy basis\n\n\nOur expertise\n\nERP & CRM\nWe understand the complexity of platforms such as Salesforce, Microsoft Dynamics 365, Oracle, ServiceNow, SAP, and Epicor, and this expertise means we can offer specialist support and market insights.\n\nData & AI\nOur Data and AI team specializes in connecting businesses with top-tier talent across data engineering, data science, AI, Machine Learning, data analytics, and data governance.\n\nCloud, Development & Security\nWhether you’re at the start of your journey and migrating to the cloud, need to optimize your existing infrastructure, or strengthen your organization’s cyber resilience, we’ll ensure your team has the skills and expertise to digitally transform your business and fully embrace the latest innovations in tech.",
      "specialities": [],
      "industries": [
        "Staffing and Recruiting"
      ],
      "locations": [
        {
          "city": "London",
          "state": "England",
          "country": "UK"
        }
      ]
    }
  },
  {
    "id": "4264430851",
    "title": "Financial Advice Quality Team Leader",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4264430851/",
    "postedDate": "2025-07-14T09:23:23.000Z",
    "expireAt": "2025-08-13T09:23:23.000Z",
    "descriptionText": "Are you qualified to Level 4 diploma in financial services?Do you have strong technical knowledge of a broad variety of UK retail financial advice products?Do you have workload management and team leading experience?\n... then look no further!\nSimplyBiz provides compliance, business, and regulatory support services to financial advisers, mortgage brokers, and other professionals in the UK financial services sector.\nWe are known for offering a comprehensive range of compliance solutions, including file checking, regulatory updates, training, and technology platforms designed to help advisory firms meet Financial Conduct Authority (FCA) requirements efficiently.\n\nROLE OVERVIEW\nAs Team leader you will be responsible for ensuring the Advice Quality Team continue to deliver quality desk-based file checking for clients, members, and prospects, across the full range of financial services products within our agreed service delivery time scales.\nWhile you won't be directly line managing the team, you'll be managing workload, assisting with more complex cases and using your passion and experience to help develop the team across a broad range of financial services products.\nInternally, this role will be called AQT - Team Leader.\n\nKEY RESPONSIBILITIES\nMember-Focused Responsibilities\nEnsure effective resource allocation and timely delivery by monitoring workloads and keeping AQ Managers fully informed of progress and potential challenges.Personally carry out a share of file checking duties, supporting the team during high-volume periods.Manage and deliver bespoke projects, including due diligence, analysis, and tailored reporting for member and internal needs.Analyse and present Management Information for internal stakeholders and external users, ensuring clarity, accuracy, and actionable insights.Drive continuous improvement in team efficiency, implementing and communicating change initiatives clearly and effectively.Ensure the team consistently exceeds performance, quality, and growth objectives.Handle member appeals and queries, offering responsive and professional support via phone and email.Actively contribute to the commercial success of the business by promoting Advice Quality services and relevant tools where appropriate.\nInternal Collaboration & Operations\nWork efficiently to meet personal and team targets, supporting broader business objectives.Collaborate with the AQ Manager to enhance processes and procedures for increased team productivity.Manage your own workload, prioritising effectively within agreed SLAs.Support internal departments, including preparing and delivering member presentation content.Identify opportunities to add value or collaborate with other business functions.\nManagement & Team Leadership\nMaintain accurate tracking and reporting of Management Information in line with agreed timescales.Provide leadership to the Advice Quality Team, including stepping in to support the Quality and Development Manager in the absence of the AQ Manager.Contribute to the onboarding and development of new team members by helping to shape and deliver induction and training processes.\nKnowledge & Compliance\nStay abreast of all relevant regulatory, industry, and internal policy changes, and support the team in understanding and implementing updates.Complete and record annual Continuing Professional Development (CPD) as required.Promote a culture of learning by sharing knowledge, identifying gaps in internal guidance, and contributing to updates of materials.Ensure all your individual training and CPD activities are completed in line with the team Training & Competence Scheme and accurately logged/ maintained on our internal systems.\nYOUR APPROACH TO WORK\nWe’re looking for someone who brings not only the right experience and technical skills but also the right mindset and approach to leadership. The ideal candidate will demonstrate:\nSelf-motivation and a positive attitudeContinuous learning approachConfident decision-makerStrong organisational and planning abilitiesExcellent analytical and problem-solving skillsOutstanding interpersonal and communication skillsEffective delegation skillsComposure under pressure\nEXPERIENCE & QUALIFICATIONS\nEssential\nMinimum level 4 qualification.Broad technical knowledge across all product areas.Previous experience in a compliance and/or file reviewing / advice quality role desirable.Management and/or training experience preferableExcellent customer service skills.Proficient in the use of Microsoft Office and Teams and Tech systems in generalExcellent communication and telephone skills\nDesirable\nBeneficial additional qualifications: Equity Release, Long Term Care, Mortgage and Protection, Pension Transfers\nRole Location\nThis is a remote-first opportunity although if you live close to our Huddersfield office you are more than welcome to base yourself from there.\nRight to Work\nYou will need to hold the long-term right to work in the UK without sponsorship.\n\nFintel plc and all the businesses within it adopt a zero-tolerance approach to discrimination on any of the protected grounds in the Equality Act 2010.\nWe are committed to providing equal opportunities to all current and prospective employees regardless of age, disability, sex, sexual orientation, pregnancy and maternity, race or ethnicity, religion or belief, gender identity, or marriage and civil partnership.\nWe aspire to have a diverse workforce because, in our view, diversity enables better business outcomes. We also believe that a more inclusive workplace, where people of different backgrounds work together, ensures better outcomes for all staff. From application to interview, we place inclusion at the heart of all we do.\nFor these reasons we strongly encourage suitably qualified applicants from a wide range of backgrounds.",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 1,
    "views": 61,
    "jobApplicationLimitReached": false,
    "applyMethod": "https://careers.simplybiz.co.uk/jobs/5837177-financial-advice-quality-review-team-leader",
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/simplybiz-plc",
      "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQEcqjDiORv7eQ/company-logo_400_400/company-logo_400_400/0/1727767917651/simplybiz_plc_logo?e=1755129600&v=beta&t=1t1Q4fbcwGvNij9bH171CxcV_MK-g3f56s6j-npVmz0",
      "website": null,
      "name": "Simplybiz",
      "employeeCount": 149,
      "followerCount": 8981,
      "description": "Driven by our belief in the value of professional financial advice, we exist to help financial professionals create better outcomes for consumers. \n \nBy delivering the technology and services platform that powers the future of financial advice, we shape a better financial future for all.\nSimplybiz is the leading provider of   technology, business and regulatory support to the UK retail financial services industry, helping financial professionals operate more effectively and deliver better outcomes for consumers. \n \nSupporting thousands of financial intermediaries with regulation, technology and business support, and hundreds   of product providers with market intelligence and expertise, our end-to-end platform connects and enables the market to help it evolve to its greatest potential.\n\nFor more information, please visit our website at www.Simplybiz.co.uk , call us on 01484 439100 or send us an email at info@Simplybiz.co.uk",
      "specialities": [
        "Compliance",
        "FCA regulation",
        "direct authorisation",
        "business support",
        "network leavers guidance",
        "professional development",
        "best practice",
        "professional connections",
        "marketing support",
        "mortgages",
        "adviser exit strategy",
        "legal connections"
      ],
      "industries": [
        "Financial Services"
      ],
      "locations": [
        {
          "city": "Huddersfield",
          "state": "England",
          "country": "UK"
        }
      ]
    }
  },
  {
    "id": "4266254110",
    "title": "QA Automation Engineer (Playwright)",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4266254110/",
    "postedDate": "2025-07-14T11:03:03.000Z",
    "expireAt": "2025-08-13T11:03:02.000Z",
    "descriptionText": "Quality Assurance Engineer (Playwright / Automation)Remote, or based in the North of England Salary circa £55k + Bonus + Benefits Package \nRole:\nReporting into Leadership, this role will play a significant role in helping a product focused, B2B organisation building new, robust automation frameworks from the ground up, as well as driving best practices in QA, and helping the cultural shift to QA automation, across both technical and non-technical team members. \nThis is a rare opportunity to help a reputable brand at the start of their QA automation journey, and will have the chance to not just make a long term, lasting impact, but also see personal career growth.\nSuited to people that enjoy variety, and deliver quickly. \nWhat you'll do:\nArchitect and implement end-to-end test automation using PlaywrightBuild a scalable automation framework from scratch, supported and backed by C-levelLead the shift from manual to automated testingTrain and mentor team members on modern QA tools and techniquesCollaborate closely with developers, analysts, and product teams to ensure quality is embedded from the startIntegrate tests into CI/CD pipelines and shape a shift-left QA strategyExplore emerging tools like AI-driven testing to drive continuous improvement\nWhat you'll bring:\n3+ years’ experience in test automation, with Playwright and JavaScript expertiseA proven track record of designing and scaling automation frameworksSolid understanding of web technologies and REST APIsExperience in Agile delivery and DevOps practicesGreat communication skills and a passion for quality and coaching\nBonus if you have:ISEB/ISTQB Foundation certificationExperience with tools like JIRA, GitHub Actions or Jenkins\nYou’ll be joining at a time of exciting transformation, with the autonomy to shape automation practices and influence quality culture across the organisation.\nLocation: can be remote based, with expensed travel, or office based if commutable.\nRemote QA Engineer, Remote Automation Engineer, Remote SDET, QA Automation Tester",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 60,
    "views": 164,
    "jobApplicationLimitReached": false,
    "applyMethod": null,
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/delaneybourton",
      "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQGR7IeNKuUyIg/company-logo_400_400/company-logo_400_400/0/1631367259235/delaneybourton_logo?e=1755129600&v=beta&t=PKAdahgwNx8K0jvNZb0dzLPUqMtS094ZXo56ijaw7OE",
      "website": null,
      "name": "Delaney & Bourton",
      "employeeCount": 3,
      "followerCount": 22681,
      "description": "Delaney & Bourton is a Technology and Change recruitment firm. We specialise in appointing and subsequently partnering with business leaders to build high performing technology, digital and change teams.\n\nOur mission is to provide an unrivalled Technology and Change recruitment solution, through flexible and \ninnovative methods which are founded upon our principles of exceptional quality, integrity and transparency.\n\nDue to technological advances and growing in-house recruitment functions, combined with the ever-increasing demand for exceptional talent in a skill-short technology, digital and change market, Delaney & Bourton was founded to synergise all of these effectively by building seamless partnerships with our clients.\n\nWe have proven track records delivering across the breadth of Technology, Digital and Change, including:  \n\nBoard Level and Technology Leadership\nProject Delivery and Transformation\nArchitecture and Strategy\nInfrastructure and Cloud Services \nData and Business Intelligence \nInformation and Cyber Security \n\nFor more information please visit www.delaneybourton.com \n\nOur partners are fixated on forging meaningful relationships by delivering exceptional quality.\n\nContact one of our partners directly. \n\n0121 667 4247 / contact@delaneybourton.com \n",
      "specialities": [
        "IT Recruitment",
        "Change Recruitment",
        "Technology Recruitment",
        "Leadership Recruitment",
        "Digital Recruitment",
        "Permanent Recruitment",
        "Contract Recruitment",
        "Interim Recruitment",
        "Recruitment Birmingham",
        "IT Birmingham",
        "IT Recruitment West Midlands",
        "Executive Search",
        "IT Jobs",
        "IT Recruitment Manchester",
        "IT Recruitment Nottingham",
        "IT Recruitment London",
        "IT Recruitment Derby",
        "IT Recruitment Sheffield",
        "IT Recruitment Wolverhampton",
        "IT Recruitment Leeds",
        "Technology Recruitment Birmingham"
      ],
      "industries": [
        "Staffing and Recruiting"
      ],
      "locations": [
        {
          "city": "Birmingham",
          "state": "England",
          "country": "UK"
        }
      ]
    }
  },
  {
    "id": "4264441370",
    "title": "Director of Product Design",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4264441370/",
    "postedDate": "2025-07-14T10:46:31.000Z",
    "expireAt": "2025-08-13T10:46:30.000Z",
    "descriptionText": "📣 Director of Product Design📍 London (remote first) | 💼 Permanent | 💰£100–130k + Stock Options | Hybrid / Remote\nWe’re working with a global tech company looking to hire a Director of Product Design to lead a key cross-functional product design team. This is a pivotal leadership role with responsibility for design strategy, team development, and deep collaboration across Product, Engineering, and broader business functions.\n💡 The OpportunityLead a high-impact, globally distributed product design teamOwn and evolve end-to-end user experience across a complex digital platformPartner with senior stakeholders across disciplines to drive business and user valueShape and scale design operations, systems, and processesChampion innovation, including exploration of emerging technologies and tooling\n🔍 What You’ll Bring10+ years in product design, with 4+ years in a leadership capacityStrong UX and product design fundamentals, ideally in B2B or SaaS environmentsExperience managing and mentoring distributed teamsExpertise in user-centred design, systems thinking, and design process leadershipExcellent communication, storytelling, and stakeholder management skillsA confident, autonomous leadership style with a proactive mindset\n🏆 Why Apply?Competitive salary + stock optionsFlexible hybrid/remote workingOpportunity to lead at a global scale in a design-mature organisationStrong emphasis on career growth and leadership developmentInclusive culture with active DE&I initiatives and support networks\n📩 Interested?Please apply with your CV and portfolio to learn more or reach out to me directly on LinkedIn. This is a discreet search so all enquiries handled in confidence!",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": "https://www.linkedin.com/job-apply/4264441370",
    "applicants": 8,
    "views": 48,
    "jobApplicationLimitReached": false,
    "applyMethod": null,
    "salary": "100,000 - 130,000 GBP",
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/developrec",
      "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQEKMF-zddxUGg/company-logo_400_400/company-logo_400_400/0/1735820254790/developrec_logo?e=1755129600&v=beta&t=c_rFX6uJk18vhI6Lld85VgWyYQ23_Z2poDIHiwCLZkU",
      "website": null,
      "name": "developrec",
      "employeeCount": 65,
      "followerCount": 206249,
      "description": "Welcome to develop. \n\nWe are a leading contributor to the software engineering and technology community and a disruptive recruitment business comprised of ten specialised brands: \n\ndevelop Java \ndevelop .NET\ndevelop JavaScript\ndevelop Web 3\ndevelop Technology\ndevelop Change\ndevelop Product & Design\ndevelop Embedded\ndevelop Python\ndevelop DevOps\n\nAt develop, we’re passionate about connecting your business with top technical talent, helping you scale with tailored recruitment solutions that drive innovation and success.\n\nWhy we’re different:\n\nOur customers deserve a partner that understands them. A partner that speaks their language and understands the importance of their objectives.\n\n1. Specialised Knowledge: All our Consultants learn to code in the language they recruit for. \n\n2. We are proud to be a strategic partner of, Tech She Can, a charity dedicated to increasing the number of women working in technology.\n\n3. Collaborative Integration: All clients receive a Slack collaboration channel built directly into our business. \n\nWe listened to our market's needs and responded with a range of recruitment products designed to deliver solutions, improve quality, reduce time-to-hire, and save money. \n\nPartnering with the world’s most innovative businesses, we offer product-based solutions for both permanent and contract recruitment objectives. Our teams are talented, and our processes are sophisticated. \n\nAre you looking for a Software Engineer to join your team? Or are you seeking a new role? Please feel free to send us a message. ",
      "specialities": [
        "software engineering",
        "recruitment",
        "technology",
        "java",
        "python",
        "php",
        "javascript",
        "opensource",
        ".net",
        "software development ",
        "software development ",
        "programming ",
        "dotnetcore",
        "tech recruitment ",
        "software engineer",
        "php",
        "front end",
        "back end",
        "devops",
        "fullstack developer",
        "dotnet",
        "technology recruitment london"
      ],
      "industries": [
        "Staffing and Recruiting"
      ],
      "locations": [
        {
          "city": "London",
          "state": "England",
          "country": "UK"
        }
      ]
    }
  },
  {
    "id": "4266244203",
    "title": "Senior Product Designer - Analytics",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4266244203/",
    "postedDate": "2025-07-14T09:22:13.000Z",
    "expireAt": "2026-01-10T09:33:09.000Z",
    "descriptionText": "In this role, you'll join the MIA (Merchant Intelligence & Analytics) team, where you'll help shape the tools that enable merchandisers to make data-informed decisions. These products support everything from understanding product performance to managing campaigns and uncovering insights from large volumes of data — turning complex datasets into clear, actionable outcomes. The tools you build will drive measurable revenue impact for some of the world's leading e-commerce brands.\n\nAbout Us\n\nConstructor is the next-generation platform for search and discovery in ecommerce, built on a unique GPT-based architecture made specifically for commerce. Constructor's AI-first solutions make it easier for shoppers to discover products they want to buy and for ecommerce teams to deliver highly personalized experiences, from search, to recommendations, to AI Shopping Agents and everything in between. Optimizing specifically for ecommerce metrics like revenue, conversion rate and profit, Constructor generates consistent $10M+ lifts for some of the biggest brands in ecommerce, such as Sephora, Petco, Under Armour, home24, Birkenstock and The Very Group. Constructor is a U.S. based company that has been in market since 2019. It was founded by Eli Finkelshteyn and Dan McCormick who still lead the company today.\n\nWe're a passionate team of technologists who love solving problems and want to make our customers' and coworkers' lives better. We value empathy, openness, curiosity, continuous improvement, and are excited by metrics that matter. We believe that empowering everyone in a company to do what they think is best can lead to great things.\n\nRequirements\n\nBeyond being a thoughtful designer, user advocate, and strong collaborator, here are a few things we really value:\n\nA goal-oriented, iterative mindset — You focus on solving high-impact problems and are comfortable learning, improving, and shipping quicklyPractical experience with research — You've led user interviews, usability tests, and data analysisExperience designing for unfamiliar problems — You've worked on products where you had to understand complex workflows outside your own experience—especially in B2B contextsExperience turning ambiguity into structure — You spot patterns, define systems, and design scalable, reusable solutions\n\nBonus points if:\n\nYou've designed decision-support tools, dashboards, reporting, or anything that helps users act on complex data\n\nBenefits\n\n🏝️ Unlimited vacation time - we strongly encourage all of our employees take at least 3 weeks per year💰 A competitive compensation package including stock options👨‍⚕️ Company sponsored US health coverage (100% paid for employee)🌎 Fully remote team - choose where you live🛋️ Work from home stipend! We want you to have the resources you need to set up your home office💻 Apple laptops provided for new employees🧑‍🎓 Training and development budget for every employee, refreshed each year👪 Parental leave for qualified employees🧠 Work with smart people who will help you grow and make a meaningful impact \n\nThis position is fully remote - Constructor.io is a remote-first company.\n\nDiversity, Equity, and Inclusion at Constructor\n\nAt Constructor.io we are committed to cultivating a work environment that is diverse, equitable, and inclusive. As an equal opportunity employer, we welcome individuals of all backgrounds and provide equal opportunities to all applicants regardless of their education, diversity of opinion, race, color, religion, gender, gender expression, sexual orientation, national origin, genetics, disability, age, veteran status or affiliation in any other protected group. Studies have shown that women and people of color may be less likely to apply for jobs unless they meet every one of the qualifications listed. Our primary interest is in finding the best candidate for the job. We encourage you to apply even if you don't meet all of our listed qualifications.",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": "https://www.linkedin.com/job-apply/4266244203",
    "applicants": 15,
    "views": 48,
    "jobApplicationLimitReached": false,
    "applyMethod": "https://apply.workable.com/j/EB29560CA7?src=LinkedIn&utm_source=linkedin.com&src=LinkedIn&src=LinkedIn&utm_source=linkedin.com&gh_src=i5qg2y1&gh_src=3d45b0b2teu&utm_source=linkedin.com",
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/constructor-io",
      "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQFAqrIMIFeYKA/company-logo_400_400/company-logo_400_400/0/1718379588135/constructor_io_logo?e=1755129600&v=beta&t=7ChPf4b9K7X96ItBZfPxDIaGOTz9uGK5bfqtLAzA9Oc",
      "website": null,
      "name": "Constructor",
      "employeeCount": 989,
      "followerCount": 83441,
      "description": "​​Constructor is the only search and product discovery platform designed exclusively for commerce where conversions matter. Our platform delivers unmatched KPI optimization and fast ROI for enterprise ecommerce brands, retailers, distributors, marketplaces, and more — while giving customers a personalized, enjoyable shopping experience. Unlike other platforms, Constructor is the only search and product discovery solution that was built from the ground up with clickstream data and advanced AI, not merely bolted onto a legacy keyword engine. \n\nConsistently outperforming competitors by an average of 3% in A/B tests, Constructor’s cloud-based solutions harness the power of natural language processing, machine learning, collaborative personalization, and Generative AI to deliver compelling user experiences across all aspects of product discovery. From search to browsing, recommendations, collections, merchant intelligence, quizzes, attribute enrichment, and AI shopping assistants, Constructor covers the entire discovery journey.\n\nOptimizing specifically for ecommerce metrics like revenue, conversion rate and profit,  Constructor generates consistent $10M+ revenue lifts for our customers, which include some of the world’s most recognized brands, like Sephora, Petco, Bonobos, Target Australia, Birkenstock, The Very Group, and many more.\n\nConstructor was named a Strong Performer in The Forrester Wave™ for Commerce Search And Product Discovery, Q3 2023, and a Visionary in the First-Ever Gartner Magic Quadrant for Search and Product Discovery. Constructor also recently received multiple G2 Summer 2025 badges—including 'Grid Leader' for E-Merchandising, E-Commerce Personalization,  'High Performer for Enterprise,' and 'Best Support.’\n\nLearn more at constructor.com. ",
      "specialities": [
        "Search",
        "E-commerce",
        "Product Discovery",
        "Personalization",
        "SaaS",
        "Recommendations",
        "Guided Selling",
        "Customer Experience"
      ],
      "industries": [
        "Software Development"
      ],
      "locations": [
        {
          "city": "San Francisco",
          "state": "California",
          "country": "United States"
        }
      ]
    }
  },
  {
    "id": "4266240094",
    "title": "Sr React Developer",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4266240094/",
    "postedDate": "2025-07-14T08:36:34.000Z",
    "expireAt": "2025-08-13T08:36:34.000Z",
    "descriptionText": "About The Company\n\nSpectrum IT Recruitment is a reputable and dynamic recruitment agency specializing in connecting talented IT professionals with leading organizations across various industries. With a strong presence in the technology sector, Spectrum IT Recruitment prides itself on delivering tailored staffing solutions that meet the unique needs of both clients and candidates. The company emphasizes professionalism, integrity, and a deep understanding of the IT landscape, ensuring that every placement contributes to the growth and success of its clients. Spectrum IT Recruitment values building long-term relationships and maintaining a high standard of service, making it a trusted partner for IT talent acquisition.\n\nAbout The Role\n\nWe are seeking a highly skilled Senior React Developer to join a successful technology company based in Staines. This role offers a hybrid working environment, with three days per week in the office, providing a flexible balance between collaborative teamwork and remote work. The Senior React Developer will be an integral part of an experienced development team responsible for creating modern, interactive user interfaces using React with TypeScript. The ideal candidate will have a strong background in front-end development, a passion for innovative UI/UX solutions, and the ability to work collaboratively in a fast-paced environment. This position provides an exciting opportunity to contribute to cutting-edge projects and enhance your professional growth within a supportive and forward-thinking organization.\n\nQualifications\n\nThe ideal candidate will possess a relevant degree in Computer Science, Software Engineering, or a related field, along with substantial commercial experience in a similar role. Proven expertise in React, TypeScript, and JavaScript is essential. Additionally, familiarity with modern front-end development tools and best practices will be highly advantageous. Candidates should demonstrate a solid understanding of software engineering principles, version control systems such as Git, issue tracking, and documentation processes. Experience with Node.js and front-end libraries like Jest or Rollup, as well as an appreciation for web and UX design, will be considered a plus. Candidates with experience in full-stack development or working with connected devices are encouraged to apply.\n\nResponsibilities\n\nThe Senior React Developer will be responsible for designing, developing, and maintaining high-quality, scalable user interfaces using React and TypeScript. Key responsibilities include collaborating with cross-functional teams to define project requirements, translating designs into functional code, and ensuring responsive, accessible, and user-friendly interfaces. The role involves participating in code reviews, implementing best practices for software development, and maintaining documentation for ongoing support and future enhancements. Additionally, the developer will troubleshoot and resolve technical issues promptly, contribute to the continuous improvement of development processes, and stay updated with the latest industry trends and technologies. The position also offers opportunities to work on connected device integrations and contribute to full-stack development efforts, depending on project needs.\n\nBenefits\n\nThe company offers a comprehensive benefits package designed to support the well-being and professional development of its employees. This includes competitive salary packages, flexible working arrangements, and opportunities for career progression within a forward-thinking organization. Employees will have access to ongoing training and development programs, encouraging continuous learning and skill enhancement. The organization fosters a collaborative and inclusive work environment, promoting work-life balance and employee engagement. Additional benefits may include health insurance, pension schemes, and other perks aimed at creating a supportive workplace for all team members.\n\nEqual Opportunity\n\nSpectrum IT Recruitment is an equal opportunity employer committed to creating an inclusive environment for all employees. We celebrate diversity and are dedicated to providing equal employment opportunities regardless of race, gender, age, disability, sexual orientation, religion, or any other protected characteristic. We believe that a diverse workforce enhances our ability to serve our clients effectively and fosters a culture of innovation and respect. All qualified applicants will receive consideration for employment without regard to any protected status.",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 47,
    "views": 125,
    "jobApplicationLimitReached": false,
    "applyMethod": "https://www.bestjobtool.com/job-description-uk/2977731287?source=LinkedIn",
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/hirenza-pvt-ltd",
      "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQHAFeA7tRlAYw/company-logo_400_400/B4EZW3Svr.HUAY-/0/1742536900309?e=1755129600&v=beta&t=PLn6TQNooAX8X7MCF8257RZOBnuLt8Ec1-LFEnZfy_I",
      "website": null,
      "name": "Hirenza",
      "employeeCount": 3,
      "followerCount": 2252,
      "description": null,
      "specialities": [],
      "industries": [
        "IT Services and IT Consulting"
      ],
      "locations": [
        {
          "city": "Indore",
          "state": "Madhya Pradesh",
          "country": "India"
        }
      ]
    }
  },
  {
    "id": "4260897497",
    "title": "Lead Product Designer",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4260897497/",
    "postedDate": "2025-07-14T07:00:13.000Z",
    "expireAt": "2025-08-13T07:00:13.000Z",
    "descriptionText": "About The Role\n\nWe’re looking for a Lead Product Designer to help us shape transformative digital experiences for global clients. Our work sits at the intersection of design, strategy, and technology, helping organisations navigate complexity by creating user-centric solutions that drive meaningful business impact.\n\nKey Responsibilities\n\nCross-functional Collaboration: Work in multidisciplinary teams to align business, technical, and user experience perspectives.User-centred design: Help to plan and support primary and secondary research activities to capture and assess the insights that underpin our thinking.Co-create Impactful design solutions: Translate complex business challenges into intuitive, visually engaging design solutions that create lasting impact.DesignOps: Show our clients what good looks like when it comes to how we work together, how we get our work done, and how our work creates impact.AI Integration: Identify opportunities where AI can enhance user experience and operational efficiency.\n\nWhat We Are Looking For\n\nTechnical proficiency: Proven experience creating scalable, reusable design assets, robust documentation, and comprehensive prototypes.Collaborative Mindset: Experience in multidisciplinary teams and effective decision-making.Effective Communicator: Strong skills in conveying design concepts clearly to diverse audiences.Adaptability and Curiosity: Comfortable in dynamic environments with a passion for learning and growth.Developing others: Experience providing design direction and mentorship to help more junior team members to deliver their best work.\n\nThis role offers an excellent opportunity to contribute to meaningful digital transformation projects while enhancing your design expertise.\n\nWhat we can offer you?\n\nCompetitive salary benchmarked externally and internally for salary fairnessCompany pension contribution of 6% (increasing with tenure)Private health insurance with WPA25 days of holidays + plus bank holidays and a day off for your birthday too. We offer a long service annual leave scheme of an additional day per year after three years’ unbroken service, up to a maximum of 30 daysA tiered parental leave policy, which offers 16-weeks maternity full pay and 6- weeks partner full pay (dependant on your tenure)A Learning budget of £1200 per year for self initiated learning, books and training coursesEV salary sacrifice (dependant on your tenure)A remote-first setup with two days per month to co-work together in LondonA flexible wellbeing budget of £50 per month (via a Juno platform subscription)\n\nDon’t worry about whether you’re a 100% fit! Take a look at what we do and what we've done and get in touch. Don’t just tell us where you’ve worked or studied, tell us who you are, where you are heading, and why you want to join us!\n\nNext steps\n\nIf this sounds like the opportunity you’ve been looking for and are ready to take the next step, please submit your application.\n\nOur application form is about as easy as it gets. All you need to do is enter your contact information and upload your attachments. We’d love to see a CV, and a few lines about yourself and why you want to join Futurice. You can also submit links to your LinkedIn profile or your portfolio, as well as share other attachments relevant to the application.\n\nWe usually follow the following format for interviews, held remotely:\n\n30min video/telephone introductory callFirst round competency based interview with two team membersSecond round interview focused on Futurice Values with other Senior members of the team\n\nHow We Work\n\nWe are a dynamic team of designers, strategists, and software engineers dedicated to creating a progressive environment and culture. Operating on a remote-first basis centred in London, we regularly gather in person to collaborate and strengthen our team spirit. We pride ourselves on our craft and our commitment to a people-first, one-team mentality that drives impactful results.\n\nEver since Futurice was founded, we’ve been committed to offering a workplace people will genuinely enjoy coming to every morning, Mondays included. We’ve put tons of effort into fostering a healthy and welcoming company culture combined with fair and competitive salaries as well as perks that improve the wellbeing of each Futuricean – take a look here to learn more, check our Culture handbook 2.0. Each of our offices also adds its own unique vibe and flavor into the mix. Learn more about our offices here!\n\nAt Futurice, new joiners are not expected to fit into a specific mold – people are free to come as they are, regardless of their background. We believe there’s power in perspectives and consider diversity an important part of our success. You can learn more about our DE&I commitment and efforts here.\n\nWe are Futurice, an outcome-focused digital transformation company. We help our clients solve their biggest challenges and empower them to make a positive impact on the world.\n\nWe are a company with a unique culture and empowering values: trust, transparency, care, and continuous improvement. As a career-defining workplace, we give you access to learning and training opportunities, catalyzing professional and personal progress for everyone.",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 144,
    "views": 577,
    "jobApplicationLimitReached": false,
    "applyMethod": "https://careers.futurice.com/jobs/5962031-lead-product-designer?utm_source=LinkedIn",
    "salary": "75,000 - 90,000 GBP",
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/futurice",
      "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQFHopTFwBEs5w/company-logo_400_400/company-logo_400_400/0/1669113361608/futurice_logo?e=1755129600&v=beta&t=u09ESMAHTqH3s8qYMpuhzSvwnIZBxlCCr0JHTl5qEz0",
      "website": null,
      "name": "Futurice",
      "employeeCount": 517,
      "followerCount": 44847,
      "description": "🚀 We are Futurice — Empowering the world to act\nAn outcome-focused digital transformation company, Futurice is dedicated to helping you solve your biggest challenges and empowering you to make a positive impact on the world.\n\n🌐 At the crossroads of technology, creativity, and business\nWorking at the intersection of technology, creativity, and your business, we help you unleash your full potential and create a measurable and sustainable business impact through digital transformation. We're here to help you navigate uncertainty – and we're not afraid of rolling up our sleeves and getting our hands dirty.\n\n💡Co-Creation: pushing the boundaries of collaboration\nWe know real change doesn’t happen from the outside. That’s why all our work is co-created together with our clients, pushing the boundaries of collaboration. \n\n📚 Ultimate learning platform\nWe strive to be the ultimate learning platform for our employees by providing learning opportunities, world-class ways of working, and by openly sharing our knowledge. It’s a win-win situation for everyone involved – it helps people broaden their skill sets, makes our work more efficient, and generates better results for our clients. \n\n🏆At Futurice, we believe in the future\nSince 2000, we have helped clients develop their business practices, ways of working, and culture to meet the challenges of digital disruption in virtually every industry ranging from energy, retail, and construction to media, finance, and automotive.\n\n🌍 Global team, local impact\nToday, our team comprises more than 800 experts representing over 50 nationalities, spread across seven offices in Berlin, Helsinki, London, Munich, Stuttgart, Stockholm, and Tampere. ",
      "specialities": [
        "mobile",
        "web",
        "software",
        "lean service creation",
        "consulting",
        "programming",
        "training",
        "agile",
        "design",
        "machine learning",
        "development",
        "cloud",
        "digital design",
        "service design",
        "software design",
        "Health",
        "Energy",
        "Mobility"
      ],
      "industries": [
        "IT Services and IT Consulting"
      ],
      "locations": [
        {
          "city": "Helsinki",
          "state": "Uusimaa",
          "country": "Finland"
        }
      ]
    }
  },
  {
    "id": "4266235556",
    "title": "Frontend Developer",
    "linkedinUrl": "https://www.linkedin.com/jobs/view/4266235556/",
    "postedDate": "2025-07-14T08:36:34.000Z",
    "expireAt": "2025-08-13T08:36:34.000Z",
    "descriptionText": "About The Company\n\nApplause IT Recruitment Ltd is a leading recruitment agency specializing in connecting talented IT professionals with innovative organizations across various industries. With a strong reputation for excellence and a commitment to understanding client needs, Applause IT Recruitment Ltd has established itself as a trusted partner in the technology recruitment space. Our mission is to facilitate meaningful career opportunities for candidates while helping businesses build high-performing teams that drive digital transformation and growth. We pride ourselves on our professional approach, extensive industry knowledge, and dedication to delivering exceptional service to both clients and candidates.\n\nAbout The Role\n\nWe are seeking a talented and motivated Front-End Developer to join our dynamic team. This role is based within the UK and offers flexibility with remote or hybrid working arrangements. As a key contributor to our digital projects, you will be responsible for creating engaging, high-converting user experiences tailored to our target markets. Your expertise in UX design and front-end development will be instrumental in developing responsive landing pages, microsites, and creative assets that support lead generation efforts. The ideal candidate will have a keen eye for detail, a passion for innovative design, and a solid understanding of digital marketing trends within the UK landscape.\n\nQualifications\n\nThe successful candidate will possess a strong technical background with expert-level skills in HTML, CSS, and JavaScript. A solid understanding of UX principles, particularly related to attention-driven layouts and form flow, is essential. Experience with design tools such as Figma, Canva, or Photoshop is required, along with familiarity with AI tools like ChatGPT for content support and prototyping. Candidates should have experience working with analytics platforms such as Google Analytics and Tag Manager, as well as a good grasp of UK digital culture and user behavior. Additional qualifications include experience in fast-loading, performance-optimized builds, and a proactive approach to testing and optimization.\n\nResponsibilities\n\nDevelop and maintain responsive, mobile-first landing pages and microsites optimized for lead capture across platforms like Google, Facebook, and TikTok.Utilize modern JavaScript frameworks or vanilla JavaScript to deliver engaging, high-speed front-end experiences.Design and implement effective lead capture forms, including multi-step flows, progress indicators, and user-friendly UI components.Create banners, UI components, and creative assets using tools such as Figma, Photoshop, Canva, or AI design platforms.Collaborate closely with the marketing team to test, analyze, and optimize layouts, copy, and user flows through analytics and A/B testing methodologies.Stay informed about UK media trends, headlines, formats, and topics, integrating relevant themes into your work to enhance engagement.Prioritize user experience, site performance, and conversion rates in all development activities.Maintain code quality, ensure cross-browser compatibility, and adhere to best practices in front-end development.\n\nBenefits\n\nJoining Applause IT Recruitment Ltd offers a competitive salary range of 50,000 to 60,000, commensurate with experience. We provide flexible working arrangements to support work-life balance, whether remote or hybrid. Our benefits package includes ongoing professional development opportunities, access to cutting-edge tools and technologies, and a collaborative work environment that encourages innovation. You will have the chance to work on impactful projects within a fast-paced agency setting, gaining valuable experience in digital marketing and lead generation strategies. Additionally, we promote a culture of continuous learning and support your career growth through mentorship and training programs.\n\nEqual Opportunity\n\nAt Applause IT Recruitment Ltd, we are committed to fostering an inclusive and diverse workplace. We believe that a variety of perspectives and backgrounds enrich our team and contribute to our success. We provide equal employment opportunities to all applicants and employees without regard to race, color, religion, gender, sexual orientation, age, disability, or any other protected characteristic. Our goal is to create a welcoming environment where everyone can thrive and reach their full potential.",
    "employmentType": "full_time",
    "workplaceType": "remote",
    "easyApplyUrl": null,
    "applicants": 135,
    "views": 403,
    "jobApplicationLimitReached": false,
    "applyMethod": "https://www.bestjobtool.com/job-description-uk/2978573767?source=LinkedIn",
    "salary": null,
    "company": {
      "linkedinUrl": "https://www.linkedin.com/company/hirenza-pvt-ltd",
      "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQHAFeA7tRlAYw/company-logo_400_400/B4EZW3Svr.HUAY-/0/1742536900309?e=1755129600&v=beta&t=PLn6TQNooAX8X7MCF8257RZOBnuLt8Ec1-LFEnZfy_I",
      "website": null,
      "name": "Hirenza",
      "employeeCount": 3,
      "followerCount": 2252,
      "description": null,
      "specialities": [],
      "industries": [
        "IT Services and IT Consulting"
      ],
      "locations": [
        {
          "city": "Indore",
          "state": "Madhya Pradesh",
          "country": "India"
        }
      ]
    }
  }
]